[
    {
        "title": "battlestar galactica",
        "status": "watched",
        "rating": 3,
        "overview": "When an old enemy, the Cylons, resurface and obliterate the 12 colonies, the crew of the aged Galactica protect a small civilian fleet - the last of humanity - as they journey toward the fabled 13th colony, Earth.",
        "poster": "https://image.tmdb.org/t/p/w500/99PJSbcO2LeM10uOGWeFihNp77j.jpg",
        "year": "2004",
        "tmdb_rating": 8.2,
        "seasons": [
            {
                "season_number": 1,
                "episode_count": 13,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "33",
                        "overview": "In the wake of the Cylon sneak attack, the ragtag fleet of human survivors is forced to play a deadly game of cat-and-mouse with their pursuers. Every 33 minutes, they make a jump to a new location. And every 33 minutes, the Cylons manage to find them. The pilots are on the brink of exhaustion, relying on artificial stimulants to keep fighting, and the civilians are beginning to doubt the leadership of Commander Adama and President Roslin.",
                        "air_date": "2004-10-18",
                        "watched": true
                    },
                    {
                        "episode_number": 2,
                        "name": "Water",
                        "overview": "Lt. Sharon Valerii wakes up soaking wet in the tool room with an explosive charge in her duffel bag. Shortly afterward, a mysterious explosion destroys all the port-side water tanks on Galactica, creating a crisis for the entire fleet. Sharon can't remember a thing, but all the evidence points to her as a saboteur. She confesses her concern to Chief Tyrol, but he can't believe she's responsible.",
                        "air_date": "2004-10-25",
                        "watched": true
                    },
                    {
                        "episode_number": 3,
                        "name": "Bastille Day",
                        "overview": "The fleet has found a source of water, but who will take on the difficult and dangerous job of mining it from the icy planet? Commander Adama and President Roslin send Lee to the Astral Queen, a prisoner transport ship, with an offer for its inmates: Volunteer for this mission and earn \"freedom points\".",
                        "air_date": "2004-11-01",
                        "watched": true
                    },
                    {
                        "episode_number": 4,
                        "name": "Act of Contrition",
                        "overview": "After a flight deck accident kills 13 pilots and wounds many others, Kara is thrust into service as a flight instructor and ordered to turn a group of civilian pilots and academy washouts into full-fledged Viper pilots.",
                        "air_date": "2004-11-08",
                        "watched": true
                    },
                    {
                        "episode_number": 5,
                        "name": "You Can't Go Home Again",
                        "overview": "When Lt. Kara Thrace goes missing in action after encountering a Cylon patrol while on a training mission, Commander Adama feels responsible — especially in light of her recent admission that she blames herself for his son Zak's death.",
                        "air_date": "2004-11-15",
                        "watched": true
                    },
                    {
                        "episode_number": 6,
                        "name": "Litmus",
                        "overview": "When a new copy of Doral, a Cylon who had been previously exposed while serving as the Galactica's public-relations officer, sneaks aboard and blows himself up, killing three people, Commander Adama and President Roslin must finally make public the terrifying secret known only to a select few: Cylons now look like humans.",
                        "air_date": "2004-11-22",
                        "watched": true
                    },
                    {
                        "episode_number": 7,
                        "name": "Six Degrees of Separation",
                        "overview": "When Baltar and the Number Six who lives in his head have a falling out, she abandons him, only to surface a short while later aboard the Galactica. But now she's called Shelley Godfrey, everyone can see her, and she's telling them that she has evidence, passed on by the late Dr. Amarak, that will prove Baltar sold out the human race to the Cylons.",
                        "air_date": "2004-11-29",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Flesh and Bone",
                        "overview": "A Cylon, who calls himself Leoben, is discovered on one of the ships in the fleet. Commander Adama sends Kara to interrogate him — or, rather, it. The Cylon tells Kara that he planted a nuclear device on one of the ships. Although she doesn't believe it, Kara passes on the warning.",
                        "air_date": "2004-12-06",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Tigh Me Up, Tigh Me Down",
                        "overview": "President Roslin's fears that Commander Adama is a Cylon are stoked when she learns he's making secret wireless calls to other ships. Then, to make things worse, a single Cylon raider appears near the Galactica and begins acting strangely after being damaged in battle.",
                        "air_date": "2004-12-13",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Hand of God",
                        "overview": "As its fuel supply dwindles, the fleet must seek out a new supply of tylium ore or risk becoming sitting ducks to any Cylon attack. A recon patrol finds an asteroid full of the fuel, but there's a catch — the Cylons have found it first and established a heavily guarded refining plant.",
                        "air_date": "2005-01-03",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Colonial Day",
                        "overview": "When President Roslin calls an Interim Quorum of the Twelve Colonies, she discovers that democracy brings its ugly stepsisters — politics and deadly intrigue — to the party. Tom Zarek, the charismatic convicted terrorist, is elected as the delegate from Sagittaron and immediately proposes elections for the vice-presidency.",
                        "air_date": "2005-01-10",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Kobol's Last Gleaming (1)",
                        "overview": "While flying a supply patrol, Crashdown and Sharon Valerii discover a bountiful planet that can support human life. Indeed, it might be Kobol, the legendary \"home of the gods.\" The discovery prompts Commander Adama to send a ground team to investigate; it also gives new life to President Roslin's belief that she is a tool of destiny and that this discovery, like her rapidly spreading cancer, is part of an ancient prophecy.",
                        "air_date": "2005-01-17",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Kobol's Last Gleaming (2)",
                        "overview": "When Commander Adama learns that Kara disobeyed orders and Jumped to Caprica on orders from President Roslin, he demands the president's resignation, with the implied threat of a military coup. Roslin refuses his demand and sparks a confrontation.",
                        "air_date": "2005-01-24",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 2,
                "episode_count": 20,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Scattered",
                        "overview": "With Adama out of action, Colonel Tigh takes his position as commander of the Galactica. Boomer is in jail, and the cat's out of the bag - she's a Cylon.",
                        "air_date": "2005-07-15",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Valley of Darkness",
                        "overview": "Tigh has to work with Lee to defeat a Cylon boarding party that threatens to take over Galactica and destroy the fleet.",
                        "air_date": "2005-07-22",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Fragged",
                        "overview": "Democracy is brought back to the fleet and soon with it come hardball politics and potentially deadly intrigue.",
                        "air_date": "2005-07-29",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Resistance",
                        "overview": "Tigh imposes martial law and threatens to split the fleet as Lee works to free President Roslin and organize democratic resistance.",
                        "air_date": "2005-08-05",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Farm",
                        "overview": "Adama and Roslin fight for the hearts and minds of the fleet's population, as Starbuck finds herself trapped in a supposed resistance hospital.",
                        "air_date": "2005-08-12",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Home (1)",
                        "overview": "President Roslin's fragile coalition is put to the test in the first part of a two-part story. Apollo, who has sided with Roslin, runs into a conflict with Zarek and his accomplice Meier.",
                        "air_date": "2005-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Home (2)",
                        "overview": "Adama heads to Kobol to find Roslin, reassembles the fleet and heads down to Kobol himself to find the presidential party in search of the \"Tomb of Athena\" which allegedly leads to Earth. Apollo hangs out with Starbuck , Zarek tries to keep his cronie off plotting with Boomer who is unaware of tension building between Helo and Tyrol.",
                        "air_date": "2005-08-26",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Final Cut",
                        "overview": "A reporter is sent to Galactica to chronicle the harsh realities of life during wartime.",
                        "air_date": "2005-09-09",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Flight of the Phoenix",
                        "overview": "Sharon informs Adama that the Galatica has been infected with a computer virus that is tampering with the basic ship functions and is scanning them for weaknesses. All this is preparation for a major assault by the Cylon Raiders. So with the clock ticking, Commander Adama must pull himself together and decide: Can he trust Sharon?",
                        "air_date": "2005-09-16",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Pegasus",
                        "overview": "Battlestar Galactica was not the only Battlestar to have survived the cylon attack, The Battlestar Pegasus also survived.",
                        "air_date": "2005-09-23",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Resurrection Ship (1)",
                        "overview": "The Battlestars Galactica and Pegasus face a new Cylon target, a \"Resurrection\" ship, while a power struggle threatens to result in all-out war among the human fleet.",
                        "air_date": "2006-01-06",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Resurrection Ship (2)",
                        "overview": "The struggle between Adama and Cain is temporarily put on hold while the two Battlestars combine forces for an assault on the Cylon Resurrection Ship. Apollo faces a momentous decision and Baltar takes an interest in Gina, the Cylon prisoner.",
                        "air_date": "2006-01-13",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Epiphanies",
                        "overview": "As President Roslin nears death, Dr. Gaius Baltar must be groomed for the worst case scenario. Roslin orders the death of Sharon's unborn child. A sabotaged Viper leads to an investigation that uncovers a movement of people seeking peace with the Cylons.",
                        "air_date": "2006-01-20",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "Black Market",
                        "overview": "Pegasus' new commander Fisk is murdered by black marketeers, and Lee is charged with solving the crime. Roslin seeks to stamp out the black market by introducing new trade regulations.",
                        "air_date": "2006-01-27",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Scar",
                        "overview": "A crazed Cylon Raider attacks the Colonial fleet in a series of hit-and-run attacks. Overworked Viper pilots must defend a mining operation from this Raider that they nickname \"Scar.\"",
                        "air_date": "2006-02-03",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "Sacrifice",
                        "overview": "A woman takes hostages on Cloud Nine and demands that Adama turn over Sharon in order to avenge her husband's death at the hands of the Cylons.",
                        "air_date": "2006-02-10",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The Captain's Hand",
                        "overview": "Apollo assists in the search for a missing Raptor team as the new commander of the Pegasus grows increasingly unstable.",
                        "air_date": "2006-02-17",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "Downloaded",
                        "overview": "After Boomer's consciousness is downloaded into a new body following her death, she struggles with her new life on Cylon-occupied Caprica. Number Six is asked to help Boomer adjust to her new role in Cylon society.",
                        "air_date": "2006-02-24",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "Lay Down Your Burdens (1)",
                        "overview": "Chief Tyrol is plagued by terrifying dreams and seeks the aid of a priest. Kara leads a rescue mission to Caprica. Roslin and Baltar go head-to-head in a presidential debate that changes dramatically with the discovery of a habitable planet.",
                        "air_date": "2006-03-03",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "Lay Down Your Burdens (2)",
                        "overview": "When Baltar wins the vote, Roslin considers stealing the election because she believes he is a Cylon collaborator.",
                        "air_date": "2006-03-10",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 3,
                "episode_count": 20,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Occupation",
                        "overview": "Tigh, Tyrol and Anders lead the Resistance on New Caprica to increasingly deadly attacks against the Cylons. Kara finds herself trapped in a new life with Leoben Conoy, and Duck makes a fateful decision. Meanwhile on Galactica, Adama struggles with the question of whether to return to New Caprica to mount a rescue attempt.",
                        "air_date": "2006-10-06",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Precipice",
                        "overview": "Adama plans to return to New Caprica and drop off a surprising person to act as a liaison between Galactica and the Resistance. Tigh's insistence on the use of suicide bombers and ever escalating violence stuns even the fellow leaders of the Resistance. Eventually, the suicide bombings cause the Cylon occupiers to crackdown on their human subjects.",
                        "air_date": "2006-10-06",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Exodus (1)",
                        "overview": "Sharon helps the Resistance on New Caprica as Adama leads Galactica on a dangerous rescue operation. Tyrol races to save Cally from the execution squad. Meanwhile Anders uncovers treachery among the humans. Number Three meets the Oracle Selloi after having strange dreams about the temple.",
                        "air_date": "2006-10-13",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Exodus (2)",
                        "overview": "Tigh must decide the fate of his wife Ellen after the assistance she rendered to the Cylons. Lee struggles with his assignment to protect the civilian fleet on its journey toward Earth while Adama returns to New Caprica with just the Galactica. The Resistance coordinates an attack on the Cylons just as Galactica arrives. As the Cylons begin to lose control, Number Three vows to put a final end to the New Caprican experiment.",
                        "air_date": "2006-10-20",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Collaborators",
                        "overview": "Tyrol participates in the Circle, a secret tribunal on Galactica that tries and convicts in absentia those accused of collaborating with the Cylons during the Occupation. The death sentences--administered without the knowledge of Roslin or Adama--begin to weigh on Tyrol's conscience. Baltar faces a similar jury among the Cylons, who must decide whether he is allowed to stay with them.",
                        "air_date": "2006-10-27",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Torn",
                        "overview": "Lingering feelings of rage lead Saul Tigh and Kara Thrace to cause problems aboard Galactica between the survivors from New Caprica and those who stayed with the fleet during the Occupation. Baltar assists the Cylons in an attempt to stay alive and uncovers details about Cylon civilization. A Cylon baseship falls victim to a mysterious disease.",
                        "air_date": "2006-11-03",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "A Measure of Salvation",
                        "overview": "Apollo formulates a plan that threatens the very existence of the Cylon culture. Adama and Roslin must decide whether to follow through on the plan to use a biological weapon against the Cylons. D'Anna Biers (Number Three) believes Baltar knows who created the virus that infected and disabled the Cylon baseship. She is willing to take extreme measures to learn the truth.",
                        "air_date": "2006-11-10",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Hero",
                        "overview": "A figure from Adama's past returns to haunt him. His return raises questions about why the Cylons launched their initial attack against the Twelve Colonies.",
                        "air_date": "2006-11-17",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Unfinished Business",
                        "overview": "Adama stages a boxing tournament on the Galactica to help the crew relax. The competitive atmosphere sets off a brutal match between Kara and Lee. Flashbacks from New Caprica reveal the origin and nature of their dispute.",
                        "air_date": "2006-12-01",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Passage",
                        "overview": "The Colonial fleet faces starvation when the food-processing machines are contaminated. Kat plays a vital role in the success or failure of the \"Passage\" through space.",
                        "air_date": "2006-12-08",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Eye of Jupiter",
                        "overview": "Tyrol discovers the Temple of Five on the algae planet. The temple may hold the Eye of Jupiter, which is believed to show the way to Earth. The Cylons take a keen interest in the discovery. Athena learns that her baby, Hera, may still be alive. Lee relies on Anders to help build civilian support for the protection of the Eye. His relationship with Kara complicates matters.",
                        "air_date": "2006-12-15",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Rapture",
                        "overview": "D'Anna/Number Three squares off against Adama over the Temple of the Five. Athena asks for Helo's aid in her plan to rescue Hera. On the algae planet, Apollo orders Dee to leave her defended position in order to save Kara. Anders helps Apollo to hold off the Cylon Centurion attack. Another copy of D'Anna finds the Temple and continues her search for the identities of the Final Five. Her messianic complex begins to concern the other Cylons.",
                        "air_date": "2007-01-21",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Taking a Break from All Your Worries",
                        "overview": "Now on board Galactica, Baltar faces charges of treason. He contemplates suicide with the help of Number Six. Questions remain about his true identity. Is he a Cylon or isn't he? Apollo shows off the new drinking establishment on Galactica, Joe's Bar, to Tyrol. Apollo thinks about Kara and wonders whether his marriage to Dee is worth saving.",
                        "air_date": "2007-01-28",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The Woman King",
                        "overview": "The Sagittarons allege that a doctor is discriminating against them. As Helo investigates, he becomes concerned that the doctor may even be murdering patients. Meanwhile, Athena unwittingly brings Hera to the doctor for treatment.",
                        "air_date": "2007-02-11",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "A Day in the Life",
                        "overview": "Chief Tyrol and his wife Cally become trapped in a malfunctioning airlock. Adama remembers his late wife Carolanne as he marks his wedding anniversary. His relationship with President Roslin continues to become more friendly and personal.",
                        "air_date": "2007-02-18",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "Dirty Hands",
                        "overview": "Amid a heated labor dispute, Tyrol asks the imprisoned Baltar for advice. Seelix becomes involved after she is turned down for flight training.",
                        "air_date": "2007-02-25",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "Maelstrom",
                        "overview": "Kara continues to have dreams about Leoben Conoy and the mandala she painted at her old apartment on Caprica. While on patrol in her Viper, she encounters a Cylon Heavy Raider. When Tyrol cannot verify Kara's claim that the Cylon ship struck the Viper, Admiral Adama and Lee become concerned about her mental stability.",
                        "air_date": "2007-03-04",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The Son Also Rises",
                        "overview": "When Baltar's representatives face assassination attempts, Adama asks Lee to protect Baltar's lawyer. After taking on the assignment, Lee seeks to play an active role in Baltar's defense.",
                        "air_date": "2007-03-11",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "Crossroads (1)",
                        "overview": "Baltar's trial testimony threatens the very stability of the fleet. Lee assists Romo Lampkin in Baltar's defense. Some in the fleet begin to feel that Baltar is divine. Though he dismisses such beliefs, Number Six suggests that the followers may know more about his true nature than Baltar does himself.",
                        "air_date": "2007-03-18",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "Crossroads (2)",
                        "overview": "As Baltar's trial comes to a conclusion, key members of the fleet discover that they may be the Final Five Cylons. Tigh attempts to decipher the strange music he is hearing in his head, while a Cylon fleet approaches.",
                        "air_date": "2007-03-25",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 4,
                "episode_count": 20,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "He That Believeth in Me",
                        "overview": "During the Cylon attack, Sam Anders has a strange encounter with a Cylon Raider. The crew of the Galactica view Starbuck's return with suspicion and doubt. Gaius Baltar takes refuge with a group of women who believe he has the power to heal others.",
                        "air_date": "2008-04-04",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Six of One",
                        "overview": "The Cylons learn that the Final Five are in the Colonial fleet. Some of the Cylons want the Cavil model to stop lobotomizing the Raider ships. Starbuck desperately tries to convince the others that the fleet is going the wrong way in their search for Earth.",
                        "air_date": "2008-04-11",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Ties That Bind",
                        "overview": "Kara Thrace seeks her own path in the search for Earth while the Cylons face the threat of sentient Centurions. A member of Galactica's crew learns a dark secret about a loved one.",
                        "air_date": "2008-04-18",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Escape Velocity",
                        "overview": "Gaius Baltar sets off a debate on religious freedom when he promotes his belief in a single God.",
                        "air_date": "2008-04-25",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Road Less Traveled",
                        "overview": "Specialist Tyrol continues to sink into despair after his recent loss. He becomes curious about Gaius Baltar's sermons and the following he has attracted. The crew of the Demetrius grow concerned about Kara's mental stability as an old enemy arrives with a tempting offer.",
                        "air_date": "2008-05-02",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Faith",
                        "overview": "The dying President Roslin and the aggressive Viper pilot Kara Thrace try to accept the new terms of the relationship with the Cylons.",
                        "air_date": "2008-05-09",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Guess What's Coming to Dinner?",
                        "overview": "President Roslin faces challenges as the Colonials plot with Cylon rebels to destroy a Resurrection Hub.",
                        "air_date": "2008-05-16",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Sine Qua Non",
                        "overview": "With President Roslin missing along with the cylon base ship a new president must be decided on.  Galactica goes on a search for the missing base ship and the Galactica crew members that were on board.",
                        "air_date": "2008-05-30",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Hub",
                        "overview": "Colonial Viper pilots plan an attack on the Resurrection Hub with their Cylon rebel allies.",
                        "air_date": "2008-06-06",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Revelations",
                        "overview": "D'Anna holds President Roslin and other Colonials hostage in order to draw out the Final Five from the Colonial fleet. Col. Tigh believes he has the solution to end the standoff.",
                        "air_date": "2008-06-13",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Sometimes a Great Notion",
                        "overview": "Kara struggles with the foreboding prediction of the Cylon Hybrid, while Adama and the Colonial fleet face despair over their shocking discovery.",
                        "air_date": "2009-01-16",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "A Disquiet Follows My Soul",
                        "overview": "Tigh and Number Six take their first glimpse at their unborn child, Tyrol offers Adama Cylon technology in return for his fellow Cylons properly reintegrated into the fleet, and an attempted coup leads to a costly struggle to maintain civility.",
                        "air_date": "2009-01-23",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Oath",
                        "overview": "Loyalties are made clear when Gaeta orchestrates a coup d'état of the Adama regime. Both prisoners and lives are taken as many of the fed up people work to take over Galactica.",
                        "air_date": "2009-01-30",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "Blood on the Scales",
                        "overview": "President Roslin faces off against Tom Zarek and Lt. Gaeta as they try to take control of the Colonial fleet. Both the alliance with the rebel Cylons and Adama's life are at stake.",
                        "air_date": "2009-02-06",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "No Exit",
                        "overview": "As Sam Anders recovers from his head injury onboard the Galactica, he begins to remember events from ancient Earth. The Final Cylon struggles with the fallout from the Final Five's former plans. One of the humanoid Cylons vows to get revenge for being created in the image of Man. Tyrol informs Admiral Adama about the extensive structural damage on the Galactica.",
                        "air_date": "2009-02-13",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "Deadlock",
                        "overview": "Ellen escapes from Cavil only to face a momentous choice regarding the 13th Tribe and the Final Five Cylons.",
                        "air_date": "2009-02-20",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "Someone to Watch Over Me",
                        "overview": "Kara feels lost while she struggles to cope with Sam's continued coma, meanwhile Boomer faces charges of treason from the Cylons onboard the base ship who blame her for voting against her model during the civil war causing the deaths of thousands of Cylons.",
                        "air_date": "2009-02-27",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "Islanded in a Stream of Stars",
                        "overview": "The rebel Cylons and the Colonial humans react to Hera's kidnapping while the physical condition of the Galactica continues to deteriorate.",
                        "air_date": "2009-03-06",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "Daybreak (1)",
                        "overview": "With Galactica on the verge of falling apart, Admiral Adama readies the ship for what could be its final mission, as Baltar's Six warns that humanity's final chapter is near.",
                        "air_date": "2009-03-13",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "Daybreak (2)",
                        "overview": "Adama and the Galactica crew stake the survival of the human race on their plan to rescue Hera from the Cylon colony in this, the series finale.",
                        "air_date": "2009-03-20",
                        "watched": false
                    }
                ]
            }
        ]
    },
    {
        "title": "lost",
        "status": "watched",
        "rating": 0,
        "overview": "Stripped of everything, the survivors of a horrific plane crash  must work together to stay alive. But the island holds many secrets.",
        "poster": "https://image.tmdb.org/t/p/w500/og6S0aTZU6YUJAbqxeKjCa3kY1E.jpg",
        "year": "2004",
        "tmdb_rating": 7.9,
        "seasons": [
            {
                "season_number": 1,
                "episode_count": 24,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Pilot (1)",
                        "overview": "Stripped of everything, the 48 survivors scavenge what they can from the plane for their survival. Some panic. Some pin their hopes on rescue. A few find inner strength they never knew they had-like Kate who, with no medical training, suddenly finds herself suturing the doctor's wounds. The band of friends, family, enemies and strangers must work together against the cruel weather and harsh terrain. But the intense howls of  mysterious creatures stalking the jungle fill them all with fear. Fortunately, thanks to the calm leadership of quick-thinking Jack and level-headed Kate, they have hope. But even heroes have secrets, as the survivors will come to learn.",
                        "air_date": "2004-09-22",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Pilot (2)",
                        "overview": "Having escaped the \"creature\" and retrieved the plane transceiver, a group of the survivors travel to higher ground so they can transmit a signal. En route, they receive a mysterious transmission and encounter another of the island's inhabitants. Meanwhile, back at camp, Jack tends to a wounded man who reveals a secret about Kate.",
                        "air_date": "2004-09-29",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Tabula Rasa",
                        "overview": "Jack and Hurley discover an alarming secret about Kate, as the marshal's life hangs in the balance and he suffers a lot of pain. Meanwhile Kate, Charlie, Sawyer, Sayid, Boone and Shannon ponder the mysteries they have begun to uncover and worry that telling the other survivors will cause panic. They decide to lie for the time being. Also, Locke's befriending of Walt disturbs Michael, but Walt is more concerned in finding his dog. Lastly, Kate flashes back to when she was arrested by the marshal in Australia.",
                        "air_date": "2004-10-06",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Walkabout",
                        "overview": "The survivors are jolted awake in the middle of the night when wild island beasts (which are wild boars) invade the beach encampment. Kate and Michael join the mysterious Locke on a hunt for food -- and a shocking secret about Locke is revealed. On the hunt for food someone is injured. Meanwhile, some survivors are horrified by Jack's plan for the dead bodies still scattered among the wreckage -- he wants to burn them. Jack sees someone that's not there, and we find out that one of the survivors was not able to walk but now he can.",
                        "air_date": "2004-10-13",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "White Rabbit",
                        "overview": "Jack is nearly delirious from lack of sleep and struggles to overcome the haunting events that brought him to Australia and, subsequently, to the island. Meanwhile, Boone gets caught in a treacherous riptide trying to save a woman who went out swimming. A pregnant Claire's health takes a bad turn from lack of fluids, and a thief may have stolen the last bottles of water. Veronica Hamel guest-stars as Jack's mother, Margo.\n\nAlso, Jack flashes back at 12 years old, to find himself on the playground in an altercation with a bully, who ultimately beats him up, and later learns a life lesson from his father.",
                        "air_date": "2004-10-20",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "House of the Rising Sun",
                        "overview": "Walt and the others are shocked when Michael is brutally beaten, but only the non-English-speaking Jin and Sun know the truth behind the attack. Meanwhile Kate, Jack, Sawyer and Sayid argue about where the survivors should camp -- on the beach, where they're more likely to be seen, or in a remote inland valley where fresh water abounds; and Locke discovers Charlie's secret.",
                        "air_date": "2004-10-27",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Moth",
                        "overview": "Charlie begins a painful journey of withdrawal from drugs, surprisingly aided by Locke, whose true motive for helping Charlie is a mystery. Meanwhile, survivors struggle to find and free Jack when he's buried alive in a cave collapse, and someone might be secretly thwarting Sayid, Kate, and Boone when they enact a plan to find the source of the French transmission.",
                        "air_date": "2004-11-03",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Confidence Man",
                        "overview": "Shannon's inhaler runs out and Boone believes Sawyer has the remaining three in his stash. When Sawyer refuses to give them up, Jack and Sayid resort to torturing Sawyer until he agrees to reveal the location of the inhalers. In flashback we hear Sawyer's story and find he is not who he says he is.",
                        "air_date": "2004-11-10",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Solitary",
                        "overview": "Sayid's life is placed in grave danger after he stumbles upon the source of the mysterious French transmission, the woman Danielle Rousseau (guest-star Mira Furlan). She was on the distress call and is found alive. Meanwhile, Hurley has a ridiculous plan to make life on the island a little more civilized.  The plan involves golf clubs he finds in the debris, and it looks like it just might work.  Lastly, we flash back to Sayid's childhood friend Nadia as well as his participation in hostage situations in Iraq.",
                        "air_date": "2004-11-17",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Raised by Another",
                        "overview": "Claire has a horribly realistic nightmare about her new baby being harmed or kidnapped. Flashbacks reveal Claire's backstory: the former boyfriend who got her pregnant, then abandoned her, and the psychic who convinced her to take the ill-fated flight that landed her on the island.  Hurley is shocked and confused when he discovers that Ethan Rom (guest-star William Mapother), another plane crash survivor, does not appear on the flight manifest.",
                        "air_date": "2004-12-01",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "All the Best Cowboys Have Daddy Issues",
                        "overview": "Survivors wonder why Charlie and Claire have been abducted - and by whom - and a search party ventures into the treacherous jungle to look for the pair. Suspicions focus on Ethan Rom (guest-star William Mapother), who, it was recently discovered, was not a passenger on the doomed flight.  Jack battles inner demons relating to his father,  while Boone and Locke discover another island mystery.",
                        "air_date": "2004-12-08",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Whatever the Case May Be",
                        "overview": "Jack, Kate and Sawyer fight over possession of a newly discovered locked metal briefcase which might contain insights into Kate's mysterious past. Meanwhile, Sayid asks a reluctant Shannon to translate notes he took from the French woman. A rising tide threatens to engulf the fuselage and the entire beach encampment, and Rose and a grieving Charlie tentatively bond over Claire's baffling kidnapping.",
                        "air_date": "2005-01-05",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Hearts and Minds",
                        "overview": "When Locke learns that Boone wants to share their \"secret\" with Shannon, Locke decides to teach him a lesson.  This leads to Shannon's life being placed in what seems like peril.  Boone and Shannon's dark past is revealed in a shocking backstory that recalls their relationship right before the plane crash and presages the return of the beast. Kate, who has become a confidante to the soft-spoken Sun, is puzzled by Sun's mysterious behavior and the revelation that she can speak English.  A hungry Hurley must convince Jin to share his fish by making up for offending Jin by rejecting his offer of raw fish early on, or he'll continue to suffer digestive problems from the limited island diet.",
                        "air_date": "2005-01-12",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "Special",
                        "overview": "Violence ensues and a mysterious island beast makes a re-appearance when Michael and Locke clash over Walt's upbringing. Meanwhile, Charlie is tempted to read the missing Claire's diary, and Sayid enlists Shannon to help decipher the French woman's map.",
                        "air_date": "2005-01-19",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Homecoming",
                        "overview": "After the missing Claire returns with no recollection of what has happened since before she boarded the doomed Oceanic flight 815, Jack and Locke formulate a plan of defense against her kidnapper, the mysterious Ethan (guest-star William Mapother), who threatens to kill off the other survivors one by one unless Claire is returned to him. Meanwhile, the disappointment Charlie feels when Claire does not remember him triggers recollections of a woman he had let down in the past.",
                        "air_date": "2005-02-09",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "Outlaws",
                        "overview": "Kate and Sawyer divulge dark secrets to each other while tracking a renegade boar that Sawyer swears is purposely harassing him.  Hurley and Sayid worry that Charlie is losing it after facing a brush with death and killing Ethan with 6 bullets to the chest.  A shocking prior connection between Sawyer and Jack is revealed in a flashback which shows Sawyer meeting Jack's father in a bar. Robert Patrick (\"Terminator 2: Judgment Day,\" \"The X-File\") guest stars.",
                        "air_date": "2005-02-16",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "...In Translation",
                        "overview": "When the raft the survivors have been building mysteriously burns down, Michael is convinced that Jin is responsible for the sabotage, which only serves to escalate their rivalry. Meanwhile, Sun stuns her fellow survivors with a surprising revelation, and Boone gives Sayid a warning about his step-sister Shannon. Lastly, more details of Jin and Sun's troubled marriage are revealed through flashbacks.",
                        "air_date": "2005-02-23",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "Numbers",
                        "overview": "When Hurley becomes obsessed with the French woman and heads into the jungle to find her, Jack, Sayid and Charlie have no choice but to follow. Hurley flashes back to the hugely life-altering experience he had before boarding the plane.",
                        "air_date": "2005-03-02",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "Deus Ex Machina",
                        "overview": "Locke thinks he's being sent a sign on how to get the hatch open, and he and Boone venture inland. Jack is reluctant to offer assistance when Sawyer begins to experience excruciating headaches and needs glasses.",
                        "air_date": "2005-03-30",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "Do No Harm",
                        "overview": "Jack tends to a severely wounded Boone after Locke returns him to the caves.  In the confusion, Locke slips away to deal with his guilt over the crisis. Meanwhile, Claire unexpectedly goes into labor while deep in the forest.",
                        "air_date": "2005-04-06",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The Greater Good",
                        "overview": "After another funeral, tempers rise as the survivors' suspicions of each other grow, and an unlikely survivor vows revenge. The events that landed Sayid on Flight 815 play out as he engages Locke in a psychological game of cat and mouse to uncover the truth about the mishap that claimed Boone's life.",
                        "air_date": "2005-05-04",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "Born to Run",
                        "overview": "Jack suspects foul play when Michael becomes violently ill while building the raft. The suspects include Sawyer and Kate, who compete for the last seat on the raft and do anything possible to prevent each other from getting it.  Meanwhile, a secret from Kate's past is revealed to the other survivors on the island.",
                        "air_date": "2005-05-11",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "Exodus (1)",
                        "overview": "The French woman-Danielle Rousseau-shocks the survivors by showing up to the camp with a dire warning about \"the Others\" who are on the island, and the black smoke that precedes them. Meanwhile, Michael and Jin ready the raft for sailing.  In flashbacks, we see the survivors final moments before they boarded their fateful flight.",
                        "air_date": "2005-05-18",
                        "watched": false
                    },
                    {
                        "episode_number": 24,
                        "name": "Exodus (2)",
                        "overview": "The castaways on the raft are surprised at sea by something unexpected. Meanwhile, remaining islanders attempt to blow open the hatch, and a visitor to the encampment might be a threat to Claire's infant son.",
                        "air_date": "2005-05-25",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 2,
                "episode_count": 24,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Man of Science, Man of Faith",
                        "overview": "Jack, Locke and Kate explore the mysterious hatch but Jack decides to wait before going down into the hatch. Kate and Locke aren't so patient. When Shannon chases after Vincent the dog, she encounters a familiar face in the jungle.",
                        "air_date": "2005-09-21",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Adrift",
                        "overview": "With the abduction of Walt fresh on their minds, their raft destroyed, and Jin missing, Michael and Sawyer fight for their lives in the middle of nowhere in the ocean and discover a new predator in the roiling sea. Meanwhile on land, Locke must descend into the hatch when Kate goes missing inside.  Also, Jack isn't too far behind Locke as he decides to go into the hatch as well later on. Lastly, flashbacks reveal more of Michael's troubled relationship with ex-lover Susan and their baby son Walt as they fight over custody for Walt and Michael must let go.",
                        "air_date": "2005-09-28",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Orientation",
                        "overview": "Jack, Locke and Kate learn more secrets about the hatch. Meanwhile, after being beaten and taken captive, Sawyer, Michael and Jin wonder if their captors are fellow survivors or the dreaded \"Others.\" Flashbacks reveals more of Locke's past in this episode as well as the introduction of  Helen (guest star Katey Segal) who shakes things up even more with her revealing personality and past.",
                        "air_date": "2005-10-05",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Everybody Hates Hugo",
                        "overview": "Hurley struggles with an assigned task inside the hatch as he flashbacks to disturbing memories in his life before the crash. Meanwhile, Sawyer, Michael and Jin learn the identities of their captors on the island. Claire uncovers a startling piece of information about the fate of the raft.",
                        "air_date": "2005-10-12",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "...And Found",
                        "overview": "Michael sets off into the jungle by himself determined to find Walt, but discovers that he is not alone. Meanwhile, Sawyer and Jin are ordered by their captors to take them to their camp, and Sun frantically searches for her missing wedding ring. In flashbacks this episode reveals more of Jin's life before ending up on the island.",
                        "air_date": "2005-10-19",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Abandoned",
                        "overview": "Sawyer's wound becomes life-threatening as he, Michael and Jin make their way through the interior of the island with the tail section survivors. Meanwhile, Shannon is once again haunted by visions of Walt.",
                        "air_date": "2005-11-09",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Other 48 Days",
                        "overview": "The harrowing first 48 days in the lives of the tail section survivors are revealed. Flashbacks reveal the point of view of Ana-Lucia, Mr. Eko, Bernard and Libby and other survivors as they landed on the other side of the island on the beach. As the days progress danger hits their camp as well when \"The Others\" start taking people against their will.  As the survivors race inland, trying to stay a step ahead of The Others, they realize that someone among them wasn't on Flight 815.",
                        "air_date": "2005-11-16",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Collision",
                        "overview": "Violence erupts when Ana Lucia and her group stumble upon Sayid and the other castaways on the island. Ana Lucia holds Sayid captive. Kate and Jack care for Sawyer when Mr. Eko brings him back to the camp himself. Flashbacks reveal Ana Lucia's troubled life as a cop.",
                        "air_date": "2005-11-23",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "What Kate Did",
                        "overview": "As Kate’s backstory continues, her original crime is revealed. She thinks something is haunting her through Sawyer.  Locke and Eko make an interesting discovery about the film, and Michael has a mysterious encounter with the computer.",
                        "air_date": "2005-11-30",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The 23rd Psalm",
                        "overview": "This episode will shed more light on why Eko took a mysterious 40-day vow of silence, and possibly information on his stick. Also, Claire begins to lose faith in Charlie after Eko begins to question him about the Virgin Mary statue, and Kate gives the recovering Sawyer a much-needed haircut.",
                        "air_date": "2006-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Hunting Party",
                        "overview": "Jack, Locke and Sawyer follow after a determined Michael after he heads into the jungle toward the dreaded \"Others\" in search of Walt. Meanwhile, Sun has a surprising reaction to Jin's desire to join the search party, and Hurley and Charlie commiserate over the age-old conundrum of \"what women want.\"",
                        "air_date": "2006-01-18",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Fire + Water",
                        "overview": "When Charlie's vividly surreal dreams lead him to believe Claire's baby, Aaron, is in danger, Locke suspects Charlie may be using again. Meanwhile, Sawyer encourages Hurley to act on his attraction to Libby.",
                        "air_date": "2006-01-25",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Long Con",
                        "overview": "Some of the island survivors fear that \"The Others\" may have returned when Sun is greatly injured during a failed kidnapping attempt at her plant garden. Also, the trust barrier becomes very thin between Locke and Jack in terms of locking up the guns and being kept safe. Meanwhile, Sawyer is an amused but highly interested bystander when tension escalates between Jack, Locke, Kate and Ana Lucia. When Jack purposely takes Sawyer's medication from him he pushes more in favor of helping Locke. Lastly, flashbacks reveal more of Sawyer's con artist past.",
                        "air_date": "2006-02-08",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "One of Them",
                        "overview": "After Sun is attacked, some of the survivors begin to think that one of the \"other survivors\" might be one of \"The Others.\" When French woman Danielle Rousseau leads Sayid to a mysterious captive in the jungle, he becomes determined to find out if he is one of \"The Others\". Meanwhile, Sawyer discovers Hurley’s potentially devastating breach of the survivors’ trust and blackmails him into helping track an elusive island creature that won’t leave Sawyer alone.",
                        "air_date": "2006-02-15",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Maternity Leave",
                        "overview": "A mysterious illness that baby Aaron suddenly contracts sends a desperate Claire, Kate and French woman Danielle to return to the same area where Claire was initially kidnapped. It is there where she believes she can find a cure for Aaron's illness. In the meantime, Jack and Locke are doing their best to keep their prisoner a secret from the rest of the survivors on the island.",
                        "air_date": "2006-03-01",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The Whole Truth",
                        "overview": "Sun comes to the realization that she might be pregnant. She struggles on whether to tell Jin about the situation. Meanwhile, with no success from Jack or Sayid, Ana-Lucia is called in by Locke to interrogate the new prisoner Henry Gale to get more information out of him about the balloon that he and his wife supposedly landed on the island with.",
                        "air_date": "2006-03-22",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "Lockdown",
                        "overview": "When the hatch suddenly takes on a life of its own, Locke is forced to enlist the help of an unlikely ally to control the matter. Meanwhile, Ana Lucia, Sayid and Charlie go off into the jungle to find out the truth about Henry Gale and see if there really is balloon craft out there in the jungle that carried him and his wife to the island.",
                        "air_date": "2006-03-29",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "Dave",
                        "overview": "Libby lends a helping hand to Hurley to support him when he begins to think the island is having a strange effect on him. Hurley begins to see Dave (guest-star Evan Handler, Sex and the City) on the island, who was his friend in the mental institution Hurley was in. Also, Locke's sense of purpose is shaken when the prisoner gives him new information about the hatch.",
                        "air_date": "2006-04-05",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "S.O.S.",
                        "overview": "Rose is surprisingly and vehemently opposed to Bernard's plan to create an S.O.S. signal; romantic sparks are rekindled between Jack and Kate when they trek into the jungle to propose a \"trade\" with \"The Others\"; and Locke begins to question his faith in the island.",
                        "air_date": "2006-04-12",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "Two for the Road",
                        "overview": "After finding an exhausted Michael in the forest, Jack and Kate bring him back to the main camp. When he finally wakes up, Michael has some new details about \"The Others.\" Also, a lovestruck Hurley plans a date for Libby.",
                        "air_date": "2006-05-03",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "?",
                        "overview": "Mr. Eko has dreams about his brother leading him somewhere. He seeks Locke's help in finding a secret location, the \"question mark.\" Meanwhile, Jack and the other survivors grapple with the horrific situation in the hatch with the death of Ana-Lucia and Libby clinging to life.",
                        "air_date": "2006-05-10",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "Three Minutes",
                        "overview": "A determined Michael convinces Jack and several castaways to help him rescue Walt from \"The Others.\" With Jack away, Locke is left in charge of the hatch and must decide if he should believe Henry and not push the button, risking everyone's safety.  Meanwhile, the events that happened to Michael after he left are finally revealed. Meanwhile, Charlie struggles with Eko's decision to discontinue building the church.",
                        "air_date": "2006-05-17",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "Live Together, Die Alone (1)",
                        "overview": "After discovering something odd just offshore, Jack and Sayid come up with a plan to confront \"The Others\" and hopefully get Walt back. At the same time there will be an answer to the question of where Michael has been and resolution of him and Walt. Meanwhile, Eko and Locke come to blows as Locke makes a potentially cataclysmic decision regarding the \"button\" and the hatch. Lastly, Desmond returns and he sheds some more light on his experience on the island in the three years prior to when Locke came down into that hatch.",
                        "air_date": "2006-05-24",
                        "watched": false
                    },
                    {
                        "episode_number": 24,
                        "name": "Live Together, Die Alone (2)",
                        "overview": "After discovering something odd just offshore, Jack and Sayid come up with a plan to confront \"The Others\" and hopefully get Walt back. Meanwhile, Eko and Locke come to blows as Locke makes a potentially cataclysmic decision regarding the \"button\" and the hatch.",
                        "air_date": "2006-05-24",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 3,
                "episode_count": 23,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "A Tale of Two Cities",
                        "overview": "Jack, Kate, and Sawyer are prisoners of the mysterious \"Others.\" After their captors drug them and take blood samples, they are held in separate areas. The camp leaders--Ben (Henry Gale), Mr. Friendly and a new woman, Juliet--try to make the castaways adjust to their new circumstances.\n\nFlashbacks reveal more about Jack's past with his father and his wife Sarah.",
                        "air_date": "2006-10-04",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Glass Ballerina",
                        "overview": "Sun and Jin's lives are put in danger when Sayid tries to locate Jack and the other missing castaways. Sayid also creates a plan in order to get the attention of the \"Others\" on the beach. Meanwhile, Henry (i.e. Ben) gives Jack an offer that is very tempting in exchange for his cooperation. Lastly, Kate and Sawyer must adjust to harsh conditions that are being forced upon them by \"The Others.\"",
                        "air_date": "2006-10-11",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Further Instructions",
                        "overview": "Locke, Eko and Desmond are found scattered about the island after the implosion of the hatch. Locke receives a message from the Island asking him to fix the situation he caused.\n\nHurley returns to the beach camp to report the imprisonment of Kate, Jack and Sawyer by the Others.\n\nDesmond has been fundamentally altered by the implosion, giving him a mysterious new power.",
                        "air_date": "2006-10-18",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Every Man for Himself",
                        "overview": "The Others prevent Sawyer and Kate from escaping, leaving Sawyer perplexed by the extent of the measures taken to keep them imprisoned. Jack is asked to use his medical training to save the life of one of the Others. At the beach, Desmond's strange behavior attracts attention. He begins to construct a mysterious device.",
                        "air_date": "2006-10-25",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Cost of Living",
                        "overview": "A delirious Eko wrestles with past demons; some of the castaways go to the Pearl station to find a computer they can use to locate Jack, Kate and Sawyer; Jack does not know who to trust when two of the Others are at odds with each other.",
                        "air_date": "2006-11-01",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "I Do",
                        "overview": "Jack makes a decision regarding Ben's offer. Sawyer's life is placed in danger when Pickett decides to make good on his threat. Locke discovers a hidden message that may help unlock the island's secrets. Kate recalls memories from the past, which caused her to make an important choice.",
                        "air_date": "2006-11-08",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Not in Portland",
                        "overview": "Jack has the Others in a desperate situation as he holds Ben's life in his hands.  Meanwhile, Kate and Sawyer try to escape from their captors. Flashbacks reveal Juliet's past as a medical researcher in Miami.",
                        "air_date": "2007-02-07",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Flashes Before Your Eyes",
                        "overview": "After Desmond rescues Claire from drowning, Charlie gets Hurley to help him find out why Desmond has seemed able to predict the future. Desmond recalls exactly what took place in the moments after he turns the key, where he experienced a strange vision of his life prior to his Army days.",
                        "air_date": "2007-02-14",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Stranger in a Strange Land",
                        "overview": "As Kate and Sawyer journey back to the main island with Karl, who is exhibiting effects of the brainwashing video, they argue over whether to go back and save Jack. On Hydra island, as Juliet's fate rests in his hands and a power struggle within the Others ensues, Jack recollects the time he spent in Phuket, Thailand and his relationship with Achara, a mysterious tattoo artist.",
                        "air_date": "2007-02-21",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Tricia Tanaka Is Dead",
                        "overview": "Kate is still struggling over their decision to leave Jack in the hands of the Others as she and Sawyer return to their camp.  Meanwhile, Hurley finds an old van in the jungle and attempts to use it to help a fellow survivor in need of faith and hope.  Flashbacks reveal more of Hurley's tumultuous past with the numbers curse.",
                        "air_date": "2007-02-28",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Enter 77",
                        "overview": "On their mission to rescue Jack, Kate, Sayid, and Locke stumble upon a mysterious structure surrounded by farm animals and meet its strange inhabitant. Back at the camp, in order to reclaim his belongings, Sawyer plays in a ping-pong competition.",
                        "air_date": "2007-03-07",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Par Avion",
                        "overview": "Claire has an idea to send a message to the outside world. Charlie, however, is resistant to the idea, and Desmond tries to sabotage the plan. As Claire tries to get the truth behind their actions out of the pair, she remembers traumatic events from her past. Meanwhile, the rescue party encounters a dangerous obstacle.",
                        "air_date": "2007-03-14",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Man from Tallahassee",
                        "overview": "When Kate and Locke arrive at the Others' camp, Ben promises to tell Locke the island's secrets as long as he stops his destructive plan, and Kate's reunion with Jack doesn't go very well when she learns that the Others have offered him a deal. More of Locke's troubled past is revealed.",
                        "air_date": "2007-03-21",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "Exposé",
                        "overview": "As the truth about Sun's kidnapping by \"the Others\" comes to her attention, Hurley becomes suspicious of Sawyer's attempt to reveal the mystery behind two fellow survivors, Nikki and Paulo. Through series of flashbacks we will discover what Nikki and Paulo were doing before the crash and how they survived 65 days on the island.",
                        "air_date": "2007-03-28",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Left Behind",
                        "overview": "Kate and Juliet are stranded in the jungle after Kate learns that there is a traitor in the survivor's midst. Meanwhile, Sawyer's poor attitude and selfish ways towards the beach community may earn him a vote of banishment if he doesn't have a change of heart.",
                        "air_date": "2007-04-04",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "One of Us",
                        "overview": "The celebration of Jack's return is cut short when he arrives at the beach with an Other, Juliet, whose flashbacks pick up from where they left off, showing us how she got onto the island and became an other. Meanwhile, Claire is threatened by a strange illness.",
                        "air_date": "2007-04-11",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "Catch-22",
                        "overview": "Desmond convinces Hurley, Jin, and Charlie to follow him on a trek through the jungle after he receives a series of visions. Flashbacks reveal the time that Desmond spent with a cloister of monks. Meanwhile, a despondent Kate turns to Sawyer for companionship after seeing Jack and Juliet together.",
                        "air_date": "2007-04-18",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "D.O.C.",
                        "overview": "Sun allows Juliet to examine her when she learns that all of \"The Others\" pregnant woman died before they gave birth on the island. Meanwhile, Desmond and an unlikely nemesis collaborate to save a new island inhabitant's life.",
                        "air_date": "2007-04-25",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The Brig",
                        "overview": "After abandoning the Others, Locke takes Sawyer on a trek through the jungle to help him eliminate a common enemy. Meanwhile, back at the beach, the parachutist Naomi has crucial information about flight 815.",
                        "air_date": "2007-05-02",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The Man Behind the Curtain",
                        "overview": "Ben unwillingly divulges information to Locke about the island, taking him on a journey to various locations including strange monuments and the mysterious Jacob. Back at the beach, Juliet's secret is revealed. Flashbacks will show us the origins of DHARMA and the history of the island, including 'the purge.'",
                        "air_date": "2007-05-09",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "Greatest Hits",
                        "overview": "While Jack devises a plan to do away with \"The Others\" once and for all, Sayid uncovers a flaw in \"The Others'\" system that could lead to everyone's rescue. But it requires Charlie to take on a dangerous task that may make Desmond's premonition come true.\n\nA Charlie-centric episode.",
                        "air_date": "2007-05-16",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "Through the Looking Glass (1)",
                        "overview": "The season 3 finale finds the castaways preparing for an invasion by the slightly less mysterious Others, while Charlie and Desmond find more than they were looking for in the underwater \"Looking Glass Hatch\".",
                        "air_date": "2007-05-23",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "Through the Looking Glass (2)",
                        "overview": "The season 3 finale finds the castaways preparing for an invasion by the slightly less mysterious Others, while Charlie and Desmond find more than they were looking for in the underwater \"Looking Glass Hatch\".",
                        "air_date": "2007-05-23",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 4,
                "episode_count": 13,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Beginning of the End",
                        "overview": "They thought they had met the enemy. They thought they had seen evil. They thought wrong. As the new season begins, the survivors feel that rescue is close at hand, but they don't know whether or not to believe Charlie's final message that the people claiming to liberate them are not who they seem to be. As unlikely alliances are formed, those they thought could be trusted may turn against them, as the enemy of their enemy becomes their friend. But who can be trusted? Is rescue really as close as it seems?",
                        "air_date": "2008-01-31",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Confirmed Dead",
                        "overview": "The survivors begin to question the intentions of their supposed rescuers when four strangers arrive on the island.",
                        "air_date": "2008-02-07",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Economist",
                        "overview": "Locke's hostage may be the key to getting off the island, so Sayid and Kate go in search of their fellow castaway in an attempt to negotiate a peaceful deal.",
                        "air_date": "2008-02-14",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Eggtown",
                        "overview": "Kate needs to get information out of the hostages, but it may jeopardize her standing with Locke -- as well as with Sawyer. Meanwhile in the future Kate's Court hearings take place.",
                        "air_date": "2008-02-21",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Constant",
                        "overview": "Sayid and Desmond hit a bit of turbulence on the way to the freighter, which causes Desmond to experience some unexpected side effects.",
                        "air_date": "2008-02-28",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Other Woman",
                        "overview": "Juliet receives an unwelcome visit from someone from her past and is given orders to track down Charlotte and Faraday in order to stop them from completing their mission -- by any means necessary. Meanwhile, Ben offers Locke an enticing deal.",
                        "air_date": "2008-03-06",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Ji Yeon",
                        "overview": "Juliet is forced to reveal some startling news to Jin when Sun threatens to move to Locke's camp. Meanwhile, Sayid and Desmond begin to get an idea of the freighter's crew when they meet the ship's captain.",
                        "air_date": "2008-03-13",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Meet Kevin Johnson",
                        "overview": "Sayid confronts Ben's spy on the freighter, and Ben urges daughter Alex to flee Locke's camp in order to survive an impending attack.",
                        "air_date": "2008-03-20",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Shape of Things to Come",
                        "overview": "Jack tries to discover the identity of a body that has washed ashore. Meanwhile, Locke's camp is attacked by Ben's adversaries.",
                        "air_date": "2008-04-24",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Something Nice Back Home",
                        "overview": "Kate and Juliet must learn to work together when Jack's health is seriously compromised, and something goes wrong as Sawyer, Claire, Aaron and Miles continue their trek away from Locke's camp and back to the beach",
                        "air_date": "2008-05-01",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Cabin Fever",
                        "overview": "Locke finds out where Jacob's cabin is. Life on the freighter becomes dangerous.",
                        "air_date": "2008-05-08",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "There's No Place Like Home (1)",
                        "overview": "Sayid goes back to the island to bring the rest of the people to the freighter. Ben, Locke, and Hurley go to another Dharma station in order to \"move the island\".",
                        "air_date": "2008-05-15",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "There's No Place Like Home (2)",
                        "overview": "The face-off between the survivors and the freighter people continues, and the Oceanic Six find themselves closer to rescue.",
                        "air_date": "2008-05-29",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 5,
                "episode_count": 17,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Because You Left",
                        "overview": "The remaining island survivors start to feel the effects of the aftermath of moving the island, and Jack and Ben begin their quest to reunite the Oceanic 6 in order to return to the island with Locke's body in an attempt to save their former fellow castaways.",
                        "air_date": "2009-01-21",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Lie",
                        "overview": "Hurley and Sayid are on the run from the cops after stumbling into trouble at the safehouse; the island survivors come under attack by unknown forces; and an old friend offers some shocking advice to Kate in order to ensure that \"the lie\" remain a secret.",
                        "air_date": "2009-01-21",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Jughead",
                        "overview": "Desmond looks for a woman who might be the key to helping Faraday stop the island's unpredictable movements through time; Locke finds out who has been attacking the survivors.",
                        "air_date": "2009-01-28",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Little Prince",
                        "overview": "Kate discovers that someone knows the secret of Aaron's true parental lineage. Meanwhile, the dramatic shifts through time are placing the lives of the remaining island survivors in extreme peril.",
                        "air_date": "2009-02-04",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "This Place Is Death",
                        "overview": "Locke shoulders the burden of ending the island's increasingly violent movements through time; Ben is stymied in his efforts to reunite the Oceanic 6 and bring them back to the island.",
                        "air_date": "2009-02-11",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "316",
                        "overview": "The members of Oceanic 6 discover how to get back to the island, but not all of them want to return.",
                        "air_date": "2009-02-18",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Life and Death of Jeremy Bentham",
                        "overview": "Locke's mission off the island as Jeremy is revealed.",
                        "air_date": "2009-02-25",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "LaFleur",
                        "overview": "Sawyer perpetuates a lie with some of the other island survivors in order to protect themselves from mistakes of the past.",
                        "air_date": "2009-03-04",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Namaste",
                        "overview": "After meeting old acquaintances Sawyer is forced to continue lying to protect them.",
                        "air_date": "2009-03-18",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "He's Our You",
                        "overview": "Everyone on the island is at risk when one of the survivors decides to go against them and taking matters into their own hands.",
                        "air_date": "2009-03-25",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Whatever Happened, Happened",
                        "overview": "Kate goes to extreme measures to save Ben's life when Jack refuses to help. Meanwhile, Kate begins to tell the truth about the lie in order to protect Aaron.",
                        "air_date": "2009-04-01",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Dead Is Dead",
                        "overview": "To atone for sins of the past, Ben must attempt to summon the smoke monster in order to be judged.",
                        "air_date": "2009-04-08",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Some Like It Hoth",
                        "overview": "Suspicions about a possible breach intensify after Ben is taken from the infirmary, and a reluctant Miles is forced to work with Hurley when he's asked to deliver an important package to a top Dharma official.",
                        "air_date": "2009-04-15",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The Variable",
                        "overview": "On the 100th episode milestone for the series, the time of reckoning has begun when Daniel Faraday comes clean regarding what he knows about the island.",
                        "air_date": "2009-04-29",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Follow the Leader",
                        "overview": "Jack and Kate find themselves at odds over the direction to take to save their fellow island survivors, Locke further solidifies his stance as leader of \"The Others,\" and Sawyer and Juliet come under scrutiny from the Dharma Initiative.",
                        "air_date": "2009-05-06",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The Incident (1)",
                        "overview": "Jack's decision to put a plan in action in order to set things right on the island is met with some strong resistance by those close to him, and Locke assigns Ben a difficult task.",
                        "air_date": "2009-05-13",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The Incident (2)",
                        "overview": "Jack's decision to put a plan in action in order to set things right on the island is met with some strong resistance by those close to him, and Locke assigns Ben a difficult task.",
                        "air_date": "2009-05-13",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 6,
                "episode_count": 17,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "LA X (1)",
                        "overview": "Two outcomes of the detonation of the hydrogen bomb are presented. Flight 815 lands safely at LAX, where Kate escapes from the marshal and Jack learns that his father's body was lost in transit.",
                        "air_date": "2010-02-02",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "LA X (2)",
                        "overview": "Jack, Sawyer, Kate, Miles and Hurley, struggling to save Sayid, face an ancient secret. Meanwhile, a fake Locke exits the chamber to everyone's awe.",
                        "air_date": "2010-02-02",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "What Kate Does",
                        "overview": "When Sawyer escapes from the temple, Kate and Jin are sent to bring him back. Meanwhile, the Others determine Sayid is infected and attempt to poison him. In the flash sideways, Kate, still on the run, takes Claire to a hospital when she goes into labor.",
                        "air_date": "2010-02-09",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Substitute",
                        "overview": "On the island, the Man in Black attempts to recruit Sawyer in his attempt to leave the island, while an impromptu funeral is held for the real Locke. In the flash sideways, Locke is fired from his job and becomes a substitute teacher.",
                        "air_date": "2010-02-16",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Lighthouse",
                        "overview": "On Jacob's orders, Hurley leads Jack to a lighthouse. Meanwhile, Claire questions an Other she has captured while tending to an injured Jin. In the flash sideways, Jack is a single father trying to bond with his son.",
                        "air_date": "2010-02-23",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Sundown",
                        "overview": "After recruiting Sayid to his cause, the Man in Black issues an ultimatum to the Others: either join him or die. Meanwhile, Kate is reunited with Claire. In the flash sideways, Sayid helps his brother, who is in debt to a loan shark.",
                        "air_date": "2010-03-02",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Dr. Linus",
                        "overview": "Ilana discovers Ben killed Jacob, so she plans to kill him. Meanwhile, Jack, Hurley and a suicidal Richard visit the Black Rock. In the flash sideways, Ben, a high school teacher, tries to blackmail the school's principal.",
                        "air_date": "2010-03-09",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Recon",
                        "overview": "The Man in Black sends Sawyer on a reconnaissance mission to Hydra Island, where he discovers that Charles Widmore has returned to the island with a team of scientists. In the flash sideways, Sawyer is a lonely cop who is still searching for the original Sawyer.",
                        "air_date": "2010-03-16",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Ab Aeterno",
                        "overview": "Richard Alpert's back story is shown: In 1867, he is brought to the island on the Black Rock as a slave. He makes a deal with Jacob to be his representative in exchange for immortality. In the present day, Hurley convinces him to help the candidates replace Jacob and stop the Man in Black from leaving the Island.",
                        "air_date": "2010-03-23",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Package",
                        "overview": "After Jin is kidnapped and taken to Hydra Island by Widmore's team, the Man in Black confronts Widmore. On the main island, Sun loses her ability to speak English. In the flash sideways, Sun and Jin are abducted after failing to complete a transaction for Sun's father.",
                        "air_date": "2010-03-30",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Happily Ever After",
                        "overview": "On the island, Widmore subjects Desmond to a large amount of electromagnetic energy as an experiment. In the flash sideways, Desmond, with the aid of Charlie, starts to have visions of his life in the original timeline.",
                        "air_date": "2010-04-06",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Everybody Loves Hugo",
                        "overview": "In order to prevent more loss of life, Hurley leads the other survivors to speak with the Man in Black. In the flash sideways, Hurley meets Libby, while Desmond continues his mission to let the Oceanic 815 passengers know of their lives on the island.",
                        "air_date": "2010-04-13",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Last Recruit",
                        "overview": "The survivors split into two groups; one led by Sawyer, the other by the Man in Black. Sawyer's group travels to Hydra Island, where they are captured by Widmore's crew after Sun and Jin are reunited. In the flash sideways, the passengers of Oceanic 815 continue to cross paths with each other.",
                        "air_date": "2010-04-20",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The Candidate",
                        "overview": "After the remaining survivors are reunited, Sawyer and Jack hatch a plan to divert the Man in Black's attention and leave the island without him on Widmore's submarine, but disastrous consequences await them. In the flash sideways, Jack investigates the cause of Locke's paralysis and offers treatment.",
                        "air_date": "2010-05-04",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Across the Sea",
                        "overview": "Jacob and the Man in Black are revealed to be twin brothers. They are raised by a mysterious woman who is charged with protecting the island. As revenge for the murder of their adoptive mother (who killed their real mother), Jacob throws his brother into the source of electromagnetism after being made the island's guardian, which transforms the Man in Black into the smoke monster.",
                        "air_date": "2010-05-11",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "What They Died For",
                        "overview": "Ben finally takes his revenge on Widmore after accepting the Man in Black's request for assistance. Jacob explains the purpose of the candidates, and Jack volunteers to take his place. The search for Desmond reveals that he has been rescued and the Man in Black plans to use him to destroy the island. In the flash sideways, each person ends up on their way to a concert.",
                        "air_date": "2010-05-18",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The End",
                        "overview": "For different reasons, Jack and the Man in Black both use Desmond to extinguish the light at the heart of the island. The island starts disintegrating, but The Man in Black is also made mortal. Still desperate to escape, The Man in Black fights Jack and mortally wounds him, but with help from Kate, Jack kills him. Realizing his destiny, Jack sacrifices himself to relight the heart of the island, so his friends can escape on the Ajira plane. Hurley takes Jack's place as protector of the island and makes Ben the new advisor. The flash sideways is revealed to be a type of limbo, or holding pattern, for the main characters, where they reside until accepting their life and death, and are then able to \"let go\" and \"move on\" together.",
                        "air_date": "2010-05-23",
                        "watched": false
                    }
                ]
            }
        ]
    },
    {
        "title": "Monk",
        "status": "watched",
        "rating": 0,
        "overview": "Adrian Monk was once a rising star with the San Francisco Police Department, legendary for using unconventional means to solve the department's most baffling cases. But after the tragic (and still unsolved) murder of his wife Trudy, he developed an extreme case of obsessive-compulsive disorder. Now working as a private consultant, Monk continues to investigate cases in the most unconventional ways.",
        "poster": "https://image.tmdb.org/t/p/w500/fLO6glULGTE0iZ4LQcikDeciRdH.jpg",
        "year": "2002",
        "tmdb_rating": 7.9,
        "seasons": [
            {
                "season_number": 1,
                "episode_count": 13,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Mr. Monk Meets the Candidate (1)",
                        "overview": "A former San Francisco police detective suffering from an extreme case of obsessive-compulsive disorder is called in to investigate an apparent assassination attempt of a mayoral candidate in which one of his bodyguards is killed.",
                        "air_date": "2002-07-12",
                        "watched": true
                    },
                    {
                        "episode_number": 2,
                        "name": "Mr. Monk Meets the Candidate (2)",
                        "overview": "With an introduction to Monk's talent, his phobia's, and need for an assistant, Monk investigates the murder of the candidate bodyguard and a political worker. He determines the candidate was not the intended target.",
                        "air_date": "2002-07-12",
                        "watched": true
                    },
                    {
                        "episode_number": 3,
                        "name": "Mr. Monk and the Psychic",
                        "overview": "When a woman drives off the road to her death, her body is mysteriously found the next morning by a psychic known for fudging the truth. Monk must discover if she's telling the truth this time, or else let a murderer go free.",
                        "air_date": "2002-07-19",
                        "watched": true
                    },
                    {
                        "episode_number": 4,
                        "name": "Mr. Monk Meets Dale the Whale",
                        "overview": "A judge is murdered while placing a 911 call, but before she dies she names her attacker - notorious criminal Dale Biederbeck. The problem is, \"Dale the Whale\" is over 800 pounds and hasn't left his bed in years.",
                        "air_date": "2002-07-26",
                        "watched": true
                    },
                    {
                        "episode_number": 5,
                        "name": "Mr. Monk Goes to the Carnival",
                        "overview": "A police officer and friend of Stottlemeyer is framed for a crime he didn't commit involving a ferris wheel. Meanwhile Monk tries to convince Stottlemeyer to get him reinstated.",
                        "air_date": "2002-08-02",
                        "watched": true
                    },
                    {
                        "episode_number": 6,
                        "name": "Mr. Monk Goes to the Asylum",
                        "overview": "Monk is committed to an asylum, where he becomes convinced the chief psychiatrist committed a murder several years prior.",
                        "air_date": "2002-08-09",
                        "watched": true
                    },
                    {
                        "episode_number": 7,
                        "name": "Mr. Monk and the Billionaire Mugger",
                        "overview": "When billionaire software magnate Sidney Teal is shot dead by ex-cop Archie Modine after allegedly turning mugger and another policeman mysteriously flees the scene, Stottlemeyer calls in Monk to investigate. Meanwhile, Sharona threatens to quit (this time for sure) when her paycheck bounces, and Stottlemeyer is hounded by reporters demanding information on \"Fraidy Cop.\"",
                        "air_date": "2002-08-16",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Mr. Monk and the Other Woman",
                        "overview": "A very tidy woman who resembles Trudy turns Monk's head while he's investigating a triple homicide. The only problem is, she's the prime suspect.",
                        "air_date": "2002-08-23",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Mr. Monk and the Marathon Man",
                        "overview": "A woman is murdered during the San Francisco marathon and Monk suspects her married lover. But he was running the race, and his tracking chip says he never left.",
                        "air_date": "2002-09-13",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Mr. Monk Takes a Vacation",
                        "overview": "While on vacation at a resort, Benjy claims he witnessed a murder. Monk believes him, but with no body and the cleanest crime scene Monk has ever seen, it's going to be hard to convince everybody else.",
                        "air_date": "2002-09-20",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Mr. Monk and the Earthquake",
                        "overview": "Renowned philanthropist Henry Rutherford is killed when a minor earthquake rocks the city and sends a display case falling on top of him. But when Monk examines the scene, he finds clues that suggest foul play.",
                        "air_date": "2002-10-04",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Mr. Monk and the Red-Headed Stranger",
                        "overview": "When monk's favorite singer, Willie Nelson, is suspected of murdering his tour manager, Monk steps in to clear his name.",
                        "air_date": "2002-10-11",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Mr. Monk and the Airplane",
                        "overview": "Monk's first flight proves to be harder than he anticipated when he begins to suspect that a fellow passenger murdered his wife.",
                        "air_date": "2002-10-18",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 2,
                "episode_count": 16,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Mr. Monk Goes Back to School",
                        "overview": "When English teacher Beth Landow falls from the clock tower at Trudy's former high school, the assistant principal doubts the police department's conclusion that the death was a suicide and invites Monk to investigate. Monk quickly concludes that the suicide note is a forgery: a highly respected English teacher wouldn't confuse \"\"its\"\" with \"\"it's.\"\"  A few words with the teachers in the lounge lead him to suspect that the murderer is a science teacher, Derek Philby. Unfortunately for Monk, Philby was proctoring an SAT exam when Ms. Landow's body landed on Philby's car, setting off his car alarm and alerting the entire school to her death. Armed with a strong suspicion but no evidence, Monk becomes a substitute teacher in hopes of finding the information that will incriminate Philby, who arrogantly informs him that he's \"\"failing the class\"\"--he has no evidence to support his hypothesis. Faced with students who throw erasers at him, an irate father who is also the school's gym teacher threat",
                        "air_date": "2003-06-20",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Mr. Monk Goes to Mexico",
                        "overview": "When a friend's college-age son dies mysteriously in Mexico, the mayor sends Monk to investigate. Doubting the coroner's report that the young man \"\"drowned\"\" in mid-air, Monk nevertheless has difficulty concentrating on the case. His eighteen suitcases carrying not only his clothes and \"\"back-up pillowcases\"\" but a year's supply of food and his favorite brand of bottled water are stolen, leaving him with nothing he considers safe to eat or drink. Even worse, someone is trying to kill him, first by running him down with a pick-up truck and then by planting an explosive device behind a picture that he compulsively straightens every time he enters his room. Neither the witnesses nor the police, a south-of-the-border caricature of Stottlemeyer and Disher, offer any helpful leads--except for the mention of another unsolved murder, this one a mauling by a \"\"wild lion,\"\" the previous year. The fact that both victims were from San Francisco offers Monk the clue that he needs to solve the case and e",
                        "air_date": "2003-06-27",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Mr. Monk Goes to the Ballgame",
                        "overview": "When a ruthless CEO and his wife are lured to an industrial park and are shot dead in their car, Monk connects their murders to a star baseball player's quest for the single season home run record.",
                        "air_date": "2003-07-11",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Mr. Monk Goes to the Circus",
                        "overview": "When a sarcastic and unpopular ringmaster is murdered by an acrobat wearing a face mask and a Ninja-like costume, Stottlemeyer suspects an animal trainer who not only has a motive but also owns the murder weapon. Monk, however, suspects the ringmaster's ex-wife, a trapeze artist billed as The Queen of the Sky who is also a sharpshooter. Meanwhile, the Monk alienates Sharona by telling her that her fear of elephants is irrational and advising her to suck it up.",
                        "air_date": "2003-07-18",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Mr. Monk and the Very, Very Old Man",
                        "overview": "Captain Stottlemeyer must take a page from the Book of Monk when his wife nags him into looking into the murder of the world's oldest man. First on-screen appearance of Karen Stottlemeyer (Glenne Headly).",
                        "air_date": "2003-07-25",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Mr. Monk Goes to the Theater",
                        "overview": "Sharona's actress sister, Gail, is suspected of murdering Hal Duncan, a fellow actor who dies onstage after Gail stabs him with what she insists is a retractable knife. When Sharona's mother (who thinks that Sharona is Monk's partner, not his assistant) arrives for a visit and Sharona tells her the bad news, Monk and Sharona promise to \"\"do whatever it takes\"\" to discover what really happened. \"\"Whatever it takes\"\" turns out to be a bit more than Monk bargained for, however. After talking with the props manager, he begins to suspect that Jenna Ryan, Gail's understudy, somehow killed Duncan and framed Gail, even though she was at a party on the other side of town when Duncan died. In order to talk with and observe Jenna, he endures a painful half hour at a speed dating service and even agrees to take the dead man's part in the play for two days until a new actor arrives. While Monk is on stage battling stage fright and fully aware that one of the knives on the stage is real, Sharona searche",
                        "air_date": "2003-08-01",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Mr. Monk and the Sleeping Suspect",
                        "overview": "Monk suspects that the man responsible for the mail bombing murder of rich and beautiful Amanda Babbage is the victim's brother, Brian – who has been in a coma for four months after attempting to lure Stottlemeyer and Disher into a car chase and crashing into two cars. Since the package was postmarked three days before the bombing, Stottlemeyer is naturally skeptical, but he prefers siding with Monk to tagging along behind Agent Grooms of the Bureau of Alcohol, Tobacco, and Firearms, who suspects the victim's other brother, Ricky.",
                        "air_date": "2003-08-08",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Mr. Monk Meets the Playboy",
                        "overview": "Suspecting that her boss, Elliott D'Souza, has been murdered by playboy/publisher Dexter Larsen after withdrawing his financial backing for Larsen's Sapphire magazine, D'Souza's secretary hires Monk to investigate. After enlisting the help of the initially reluctant Stottlemeyer and Disher and convincing them that D'Souza's death was no accident despite his being alone in a room locked from the inside, Monk suddenly tries to withdraw from the case. The reason? Larsen has obtained and is threatening to publish nude photographs of Sharona, relics of her past as a struggling single mother in Atlantic City. When Sharona discovers the reason for Monk's strange behavior, her first reaction is shame and fear, but Benjy's response to her partial confession arms her with fierce determination to retrieve the photos and \"\"nail\"\"  the murderer. Through the common bond of motherhood, she persuades the Sapphire Girl who had provided Dexter's alibi to confess the truth. Meanwhile, Monk puts together De",
                        "air_date": "2003-08-15",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Mr. Monk and the 12th Man",
                        "overview": "Faced with a string of nine brutal murders, all with different MOs and no apparent similarities among the victims, Captain Stottlemeyer calls in Monk to help him investigate. Suspicion falls at first on Henry Smalls, an insurance agent whose calendars appear in three of the victims' photographs. But as Monk, accompanied by Sharona and her new boyfriend, Deputy Mayor Kenny Shale, waits in the dark for Smalls to return home, he helplessly witnesses a fatal stabbing in which the suspect becomes the victim. Rushing after the murderer, who is wearing a ski mask, Monk tries futilely to subdue him, but all he's able to discover is that the murderer bites his fingernails. As the number of victims rises to eleven, the diversity of the victims, combined with the fact that they all live in Marin County, suddenly causes both Monk and Stottlemeyer to realize that they're all members of a jury. The ensuing investigation leads them to a six-year-old personal injury case, won by the plaintiff, who is",
                        "air_date": "2003-08-22",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Mr. Monk and the Paperboy",
                        "overview": "When Monk's paperboy is murdered on his doorstep by a guy looking to steal his newspapers, Monk turns to the pages of the newspaper for clues to solve the baffling crime.",
                        "air_date": "2004-01-16",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Mr. Monk and the Three Pies",
                        "overview": "When Monk's older brother Ambrose calls him about a \"\"life-or-death matter,\"\" Monk accepts the call grudgingly and agrees to meet the brother from whom he's been estranged since Ambrose refused to attend Trudy's funeral seven years before. In fact, Ambrose, an agoraphobic packrat whose house is full of bundled up newspapers, has not left the home he and Adrian grew up in for thirty-two years. Believing Ambrose's claim that his next-door neighbor, Pat Van Ranken, has murdered his wife after a loud argument, Monk and Sharona visit Van Ranken and decide to follow him. Van Ranken, meanwhile, is behaving very strangely, entering a potato sack race and a bingo tournament in which the prizes include a cherry pie. It's not hard for the Monk brothers to tie Van Ranken to another murder involving a cherry pie--the challenge is finding a motive for Van Ranken and proving that he did it. The episode provides a glimpse of Monk's family background and the reasons for his estrangement from his brother,",
                        "air_date": "2004-01-23",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Mr. Monk and the T.V. Star",
                        "overview": "After visiting the set of the hit TV series Crime Lab S.F. during a celebration of its one hundredth episode, Monk suspects the show's star, Brad Terry, of murdering his ex-wife so he won't have to share his huge new paychecks with her. But the actor's alibi seems solid--he was with photographers when the victim's screams were heard. To complicate matters, a fan confesses to the crime and Terry passes a lie detector test. After Terry invites the captain, Disher, and Sharona--but not Monk--to a party, Monk realizes that Terry reminds him of a popular boy who treated him the same way in sixth grade and begins to doubt his own instincts. But when Stottlemeyer invites Monk to hear Marci's confession, Monk's doubts shift to Marci's story. When she tells him that Terry's ex-wife was once an actress who made a single B movie, Monk has the clue he needs to solve the crime.",
                        "air_date": "2004-01-30",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Mr. Monk and the Missing Granny",
                        "overview": "Unable to pay for Monk's services as a private detective, middle-aged law student Julie Parlo offers him a trade--she'll help Monk become reinstated as a policeman with the SFPD if he'll help her find her missing grandmother. The only clue to the identity of the kidnappers is a roughly drawn lightning bolt on a note left at the grandmother's house, leading Stottlemeyer and Disher to suspect the former leader of an anti-Vietnam War group from the Seventies. But when the captain, anticipating Monk's reinstatement, invites Monk to help him with interrogation, Monk accidentally discovers that the suspect's tattoo doesn't match the symbol on the note--it has three humps instead of two.   Meanwhile, the kidnappers order Julie to provide turkey dinners to the homeless in exchange for the return of the grandmother. Julie complies and her grandmother is returned safely, leading Stottlemeyer to put the case \"\"on the back burner.\"\" True to her promise, Julie informs Monk of a loophole that will all",
                        "air_date": "2004-02-06",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "Mr. Monk and the Captain's Wife",
                        "overview": "On her way to film a documentary (apparently about a union dispute), Captain Stottlemeyer's wife, Karen, is badly injured when her car is struck by a tow truck whose nonunion driver has been killed by a sniper. Distraught and furious, the captain blames a sleazy union official and his thug, a theory that seems to be confirmed when a second tow truck driver is murdered. But Lieutenant Disher, in charge of the crime scene investigation, discovers an odd detail that doesn't fit well with this scenario – both the assailant and the murdered truck driver were barefoot. Empathizing with the captain's anguish, Monk offers to do whatever he can to help and of course ends up investigating the case. A small dog that follows Sharona from the crime scene leads her to the home of a handsome man who seems attracted to her, but Monk is more interested in the next-door neighbor's off-kilter sundial. Meanwhile, the captain, fearing that his wife will die, becomes increasingly violent, taking out his anger...",
                        "air_date": "2004-02-13",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Mr. Monk Gets Married",
                        "overview": "After a phone call from Lt. Disher, Monk and Sharona find him in Captain Stottlemeyer's office, drinking Scotch to console himself because his 58-year-old mother has married a 37-year-old antique dealer he's sure is up to no good. The con man, Dalton Padron, has taken his aging bride to a marriage counseling clinic for their honeymoon, and Sharona persuades Monk that the best way to catch him is to pose as husband and wife and join him at the clinic. In a group therapy session, Sharona accuses Padron of winking at her and, in the scuffle that follows, snatches an old letter from his jacket pocket. The letter confirms their suspicions: Padron is after the gold that was stashed away 150 years earlier by the crazy old prospector who once owned the house. Padron later grabs the letter and burns it, but not before Monk and Sharona discover that the secret is somewhere in the hundreds of journals that the old man wrote before he died. Early the next morning, Sharona follows Padron into an ol",
                        "air_date": "2004-02-27",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "Mr. Monk Goes to Jail",
                        "overview": "Who would murder a death-row inmate forty-five minutes before his execution--and why? That's the question Captain Stottlemeyer asks Monk--but Monk's response is to ask why it matters. As Monk is hurrying to leave the prison, however, he gets a phone call from his old nemesis, Dale \"\"the Whale\"\" Biederbeck, that changes his plans. The police consider Dale a suspect in the inmate's murder (the young man owed him twelve hundred dollars) and refuse to give him a window in his cell until his name is cleared, so Dale strikes a bargain with Monk--solve the case and he'll provide information about Trudy's murder. After interviewing the cook who prepared the dead inmate's last meal, Monk notices that another cook never clocked out the evening before. The missing cook is found dead in a freezer with a wad of bills in his apron pocket--clearly the person who bribed him to poison the inmate was afraid he would talk and killed him, too. On his way out of the prison, he receives another phone call, th",
                        "air_date": "2004-03-05",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 3,
                "episode_count": 16,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Mr. Monk Takes Manhattan",
                        "overview": "Monk and his friends go to New York City to discover the connection between Trudy's murder and Warrick Tennyson, whose name was given to Monk by Dale the Whale in last season's cliffhanger, \"\"Mr. Monk Goes to Jail.\"\" As they're checking into their hotel, mayhem breaks out in the lobby and three people are killed, including the Latvian ambassador to the United Nations. Monk quickly discovers that the ambassador's coat is wet--an odd detail because minutes earlier he was standing near Monk in a dry coat. Monk provides a police sketch artist with minute details about the perpetrator's left ear--the only part of his face that wasn't covered--and Stottlemeyer pressures the New York police captain to allow them access to Tennyson in exchange for their help in the new case. However, the DA, for reasons of her own, is blocking their access to Tennyson, and only after Stottlemeyer \"\"borrows\"\" the keys to the captain's office and pulls out the file that he saw Captain Cage hurriedly stuff into the b",
                        "air_date": "2004-06-18",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Mr. Monk and the Panic Room",
                        "overview": "In yet another case of murder in a room locked from the inside, a music producer is found dead with bullets in his back, head. and chest, clearly neither an accident nor a suicide. But this time there's a further twist: the dead man's pet chimpanzee, Darwin, is caught with the murder weapon in his hand. Not wanting to make a monkey of himself by falsely accusing a chimpanzee of murder, Stottlemeyer takes the chimp into the interrogation room, tempting the animal to fire what he thinks is an empty gun. Meanwhile, Disher realizes that he's inadvertently given the captain a loaded gun and panic ensues. When the gun goes off, endangering not only Stottlemeyer but Disher, Monk, and Sharona as well, Stottlemeyer is persuaded that the chimp is guilty and is ready to allow animal control to put him to sleep. Sharona, however, is convinced that Darwin is innocent. In desperation, Sharona resorts to breaking and entering to rescue Darwin, persuading the most unlikely person imaginable to take hi",
                        "air_date": "2004-06-25",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Mr. Monk and the Blackout",
                        "overview": "Three deaths during a city-wide blackout result in a joint investigation by Stottlemeyer, Monk, Sharona, and Disher, with the unprecedented cooperation of the FBI and the help of power company spokeswoman Michelle Rivas, an attractive brunette who is inexplicably attracted to Monk. While Sharona and Dr. Kroger pressure Monk to call Michelle, Disher follows up on Monk's suggestion that the power outage is connected to a '90s radical named Winston Brenner. Everything fits--the handwriting in the note, the phrasing, even a pair of photographs. Everything except one small detail at the end of the report--Brenner died in 1995. When the FBI acknowledges the possibility that Brenner may have faked his own death to avoid a trial, Captain Stottlemeyer presents a tree-hugging former friend of Brenner's with the evidence that Brenner is still alive and reminds him that this particular power outage is also a homicide. When the tree-hugger is murdered, it becomes clear that the killer is indeed Bre",
                        "air_date": "2004-07-09",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Mr. Monk Gets Fired",
                        "overview": "Karen Stottlemeyer has decided to film a \"\"cinema verite\"\" documentary about her husband's work, but her timing couldn't be worse. The police commissioner shouts at the captain (on camera) for focusing on a routine arson fire in a wig factory and relying on Monk to solve a more newsworthy case involving a female victim whose body was cut up with a chainsaw. Monk is in even worse trouble. After presenting some useful leads involving the chainsaw victim's age and nationality, he accidentally erases several years' worth of crucial computer files, and the enraged commissioner revokes Monk's private practice license despite Stottlemeyer's protests that doing so will destroy him. With Sharona forced to return to her old job as a nurse, the devastated Monk sits in the hospital hallway all day waiting for her until, at her exasperrated insistence, he finds a job with a magazine as a fact checker.   Meanwhile, having identified the victim based on Monk's information, the captain and Disher zero i",
                        "air_date": "2004-07-16",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Mr. Monk Meets the Godfather",
                        "overview": "When five members of the West Coast Mafia are shot down in a barbershop, Monk is pressured by mob godfather Salvatore Lucarelli and his nephew \"\"Fat Tony\"\" to solve the case. But the FBI in the person of Agent Colmes is pressuring him, too. Despite Captain Stottlemeyer's insistence that Colmes is not to be trusted, Monk accepts his offer of reinstatement on the police force if he can bring down the whole gang. The only clues are a partially completed crossword puzzle and a gumball machine that was apparently used to break a back window so the killer could escape. With a Mafia bodyguard named Vince as their \"\"babysitter,\"\" Monk and Sharona interview the sole witness, Phil Bedard, a young U.S. mint employee who tells them that he saw three men running from the scene, one of them wearing a jacket with a strange-looking number 15 on the back. Bedard also explains the heightened security at the mint: someone has stolen five double-headed pennies. Associating the numbers on the jackets with a Ch",
                        "air_date": "2004-07-23",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Mr. Monk and the Girl Who Cried Wolf",
                        "overview": "It's Sharona's turn to be terrified. After several frightening and mysterious encounters with a blood-soaked man that no one else can see, she begins to doubt her own sanity, and Stottlemeyer advises Monk to give her time off to restore her nerves. Monk is left with an irritating substitute nurse whose philosophy is the opposite of Sharona's: everything from Monk's requests for wipes to the obsessively systematic organization of his refrigerator has to go. Wanting Sharona back again, Monk goes to the garage where Sharona first saw the blood-soaked man and finds a clue--the silver tip from the toe of a cowboy boot. Meanwhile Sharona, who is attending a night class in creative writing, apparently forgets to turn in an assignment and seems to be misplacing objects. But when her writing instructor's husband dies of a heart attack after eating tomato soup, Sharona recognizes the plot of her missing story and realizes that she's not crazy. All she and Monk have to do now is tie together the...",
                        "air_date": "2004-07-30",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Mr. Monk and the Employee of the Month",
                        "overview": "When Edna Coruthers, a model employee at a giant chain store called Mega-Mart, is killed by a falling television set, Monk is called in to investigate by the store's security chief--who turns out to be his disgraced ex-partner, Joe Christie. Neither Monk nor Stottlemeyer wants to work with Christie, whom they hold responsible for some missing cocaine and the death of two police officers, and both of them disregard the evidence that Edna might have been murdered--a broken shoe heel (suggesting that the victim ran from someone or something), her dust allergy (which normally kept her from entering the loading dock where the death occurred), and the three letters (in different handwriting but with similar stamps) complaining about the victim. Twenty-seven days later, realizing that the stamps were all from the same roll and therefore from the same person, Monk reluctantly agrees to help Christie discover a suspect and a motive by working undercover as a store clerk. But he still doesn't tr",
                        "air_date": "2004-08-06",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Mr. Monk and the Game Show",
                        "overview": "With Sharona in New Jersey to visit her ailing mother, Monk is left in the very incompetent hands of his annoying upstairs neighbor, Kevin Dorfman, but the prospect of a week with Kevin is eased somewhat by a visit from Trudy's father, Dwight Ellison. Dwight invites Monk (and Kevin) to spend the week with him and his wife, Marcia – and at the same time investigate gameshow host Roddy Lankman, who appears to be involved in a conspiracy to allow one of his contestants, Val Birch, to win every game. Despite the memories of Trudy aroused by spending time with her parents in her former home and the questionable help of Kevin, Monk discovers evidence that Lankman visited Birch's house – and that Birch visited the site of the accident that killed Lankman's assistant, Lizzie Talvo. To discover exactly how Lankman and his crooked contestant are communicating – and possibly prove that they're involved in something much worse than cheating – Monk becomes a contestant on the game show. His knowledge o",
                        "air_date": "2004-08-13",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Mr. Monk Takes His Medicine",
                        "overview": "Captain Stottlemeyer and Lieutenant Disher are making a routine arrest when a mysterious man in a car drives up and shoots at them, wounding Stottlemeyer. When Monk and Disher try to apprehend their prime suspect, Monk’s obsessive-compulsive disorder allows the suspect to escape. Consumed with guilt, Monk goes to Dr. Kroger who gives him a drug to alleviate his obsessive-compulsiveness but impairs his sleuthing ability.",
                        "air_date": "2004-08-20",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Mr. Monk and the Red Herring",
                        "overview": "With Sharona in New Jersey remarried to her ex-husband, Monk has been without an assistant for three months and it's time to find a new one--if only he could find a suitable applicant. When Natalie Teeger, a thirty-something widow with an eleven-year-old daughter, arrives at his house, he thinks she's applying for the job, but she's really been sent by Captain Stottlemeyer to get Monk's help--two men have broken into her apartment in the last few days and she had to kill the second one with scissors in self-defense. Examining Natalie's apartment, Monk finds a single clue, an unused fish net caught between the sofa cushions, suggesting that the intruders were trying to steal Mr. Henry, Julie's pet fish. But why would anyone want to steal a ninety-nine-cent red herring, er, crimson marblefish? A second clue surfaces when Lieutenant Disher finds a note in the dead perp's pocket reading \"\"2:30 Sea of Tranquility\"\" and Natalie identifies the Sea of Tranquility as an exhibit at the science mus",
                        "air_date": "2005-01-21",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Mr. Monk vs. the Cobra",
                        "overview": "When John Ricca, author of a controversial and unfavorable biography of martial artist Sonny (\"\"the Cobra\"\") Chow, is found dead in his home, all the evidence points to Chow as the murderer. Unfortunately for Captain Stottlemeyer, his chief suspect has been dead for six years. While Monk and Natalie (who's more interested in being reimbursed for her business expenses than in solving the case) visit Chow's former teacher, Master Zee, who claims that Chow died in his arms, Stottlemeyer resorts to having the corpse dug up to prove that, despite rumors to the contrary, Chow is indeed dead. A dental X-ray proving that the corpse is Chow leaves Monk to figure out who tried to frame the dead man for murder. On an inadvertent tip from Disher, an avid Cobra fan, Monk and Natalie visit the Sonny Chow museum, where Monk finds two important clues--a hairbrush that has been stolen from its case and replaced with a lookalike and the stamp that the museum proprietor placed on Natalie's hand so that she",
                        "air_date": "2005-01-28",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Mr. Monk Gets Cabin Fever",
                        "overview": "After witnessing a Chinese gangland murder, Monk has to stay in an FBI safe house--a cabin in the woods--in the protective custody of Agent Grooms, with Stottlemeyer and Natalie as company. Awakened by a man's scream, Monk convinces Stottlemeyer and Natalie that a woman in a nearby cabin has murdered her husband. Agent Grooms, however, remains skeptical. After Grooms disconnects their telephone, Stottlemeyer locks him in the bathroom and the three \"\"borrow\"\" Grooms's car and set out in a rainstorm to investigate, only to get stuck in the mud on the way. Meanwhile, Disher and his new girlfriend Hayley are encountering a strange circumstance--the fortunes in their fortune cookies keep coming true. When a fortune informs Disher that an old friend is in trouble and only he can save him, Disher immediately sets out to save Monk, unaware that he's leading a pair of hitmen to the FBI cabin. After a rainy night in the car, Stottlemeyer leads Natalie and Monk through the woods toward the neighbor",
                        "air_date": "2005-02-04",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Mr. Monk Gets Stuck in Traffic",
                        "overview": "When Monk, Natalie, and Julie get stuck in a traffic jam after a multi-car collision blocks the freeway, Monk gets out of the car to investigate. He soon deduces from the absence of skid marks and other clues that the young man in the overturned Volkswagen that caused the pile-up was murdered and his body placed in the car to make his death look like an accident. But the highway patrolman in charge of the \"\"accident\"\" scene wants nothing to do with Monk (or the not-very-successful lawyer who has latched onto him), and the mountains blocking the signal prevent Monk from calling Captain Stottlemeyer for an authorization to investigate. Monk briefly returns to Natalie's car, where he finds Julie in need of a bathroom and Natalie nursing an injured wrist. Unfortunately for them, Monk's mind is on the fatality, and he returns to the Volkswagen. The angry officer gives him the victim's name and occupation (environmental activist), but he still refuses to listen to Monk's evidence. Meanwhile, t",
                        "air_date": "2005-02-11",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "Mr. Monk Goes to Vegas",
                        "overview": "In the middle of the night, Monk receives a phone call from a drunken Stottlemeyer, who has gone to Las Vegas with Disher for a fellow officer's bachelor party. Stottlemeyer believes that a wealthy casino owner has murdered his wife, but he needs Monk's help to prove that the death wasn't an accident. Unfortunately, when Monk arrives in Vegas with Natalie the next morning, Stottlemeyer can't remember anything that happened the previous night--including how his pants happened to be thrown out the window. As Monk and Natalie explore the elevator where the woman died, interrogate witnesses, and reenact the death scene (with Monk in the role of victim), Stottlemeyer tries to retrace his steps and deal with Disher, who has become addicted to blackjack and fallen hopelessly deep into debt. When Monk, at Stottlemeyer's insistence, takes Disher's place at the blackjack table to win back his money, he figures out how the murder occurred as he simultaneously places winning bets, but the casino o",
                        "air_date": "2005-02-18",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Mr. Monk and the Election",
                        "overview": "With her daughter's school about to be closed as a cost-cutting measure, Natalie becomes a candidate in the upcoming school board election despite Monk's fears that she'll desert him if she wins. Natalie's frustrations with a jammed photocopier and other defective equipment bought at a police auction are dwarfed by fear for her life when a sniper fires into her campaign headquarters, further damaging the equipment and killing a security guard. The only clues to the identity of the sniper are an oddly folded note demanding that \"\"Natalie Teege\"\" withdraw from the election and a bullet from a semiautomatic rifle made in Russia. Suspicion falls on Natalie's opponent in the election, Harold Krenshaw, whom Monk knows as a fellow patient of Dr. Kroger's. Although Monk thinks that Krenshaw is lying about his friendship with Dr. Kroger and Krenshaw admits to being an excellent shot, Monk is sure that Krenshaw is innocent because he wouldn't misspell Natalie's name. When Krenshaw passes a polygra",
                        "air_date": "2005-02-25",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "Mr. Monk and the Kid",
                        "overview": "After twenty-two-month-old Tommy Graser finds a severed finger and gives it to a policeman, Monk walks through the park with Tommy trying to retrace the child's steps. He finds no body or other incriminating evidence, but he does discover a surprising affection for the placid and intelligent toddler, who constantly repeats Monk's name and quietly submits to having his hands wiped when he touches \"\"nature.\"\" A lab technician identifies the finger as that of a twenty-five-year-old man, and Monk deduces from a callus that the young man played the violin. After visiting the home of Daniel Carlyle, a musician who fits this description, Monk concludes that Daniel's mother and her other son, Jason, killed Daniel and that Jason is masquerading as his brother. Meanwhile, little Tommy is temporarily removed from the custody of his foster parents, and Monk surprises everyone, including himself, by volunteering to care for him for two weeks until his new adoptive parents can take him. With Tommy in",
                        "air_date": "2005-03-04",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 4,
                "episode_count": 16,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Mr. Monk and the Other Detective",
                        "overview": "Monk appears to have met his match when a fellow detective shows up at a crime scene knowing all the answers.",
                        "air_date": "2005-07-08",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Mr. Monk Goes Home Again",
                        "overview": "Monk is reunited with his agoraphobic brother, Ambrose, after the murder of an armored car driver.",
                        "air_date": "2005-07-15",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Mr. Monk Stays in Bed",
                        "overview": "Monk feels too sick to work until a case gets him out of bed.",
                        "air_date": "2005-07-22",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Mr. Monk Goes to the Office",
                        "overview": "Monk goes undercover as an office worker to solve a case.",
                        "air_date": "2005-07-29",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Mr. Monk Gets Drunk",
                        "overview": "Monk goes to a wine-tasting and finds it a bit more than he bargained for.",
                        "air_date": "2005-08-05",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Mr. Monk and Mrs. Monk",
                        "overview": "Is Monk hallucinating or is he really seeing Trudy?",
                        "air_date": "2005-08-12",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Mr. Monk Goes to a Wedding",
                        "overview": "Needing a date for her brother's rehearsal dinner, Natalie resorts to asking Lt. Disher.",
                        "air_date": "2005-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Mr. Monk and Little Monk",
                        "overview": "Monk encounters an old crush from junior high when she hires him to discover why her housekeeper was killed and her favorite painting vandalized.",
                        "air_date": "2005-08-26",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Mr. Monk and the Secret Santa",
                        "overview": "When an officer dies after drinking poisoned wine sent to Captain Stottlemeyer as a Christmas gift,  the captain suspects Frank Prager, who tried to shoot him outside a bar several months earlier. Searching the crime scene for clues, Monk notes that the bullet holes seem to form a pattern, but neither he nor Stottlemeyer can figure out the message they're intended to convey. After trying unsuccessfully to talk with Prager's young daughter, Monk goes under cover as Santa Claus. This time he learns  that Prager is hiding in a church with \"\"three ladies\"\" in front of it. But when Prager is caught and interrogated, it's clear that he had nothing to do with the poisoned wine. With the other suspects on Disher's list also eliminated, Monk and the captain are back to square one. But when Monk opens the card accompanying his gift from the Christmas party, he finds the clue that solves the case.",
                        "air_date": "2005-12-02",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Mr. Monk Goes to a Fashion Show",
                        "overview": "Monk is facing a crisis: he's down to five shirts. But Inspector No. 8, the only shirt inspector who can meet Monk's criteria for perfection, is not up to her usual standards. Sensing that something is wrong, Monk visits No. 8 on the job. The inspector, Maria Ortiz, informs him that her son, Pablo, has been imprisoned for murdering a fashion model, but she's certain that he's innnocent. Monk is chiefly concerned about his shirts, but Natalie persuades him to talk to Pablo because \"\"it's the right thing to do.\"\" The conversation uncovers just one clue: Pablo can't read English. When Monk realizes that the killer must have been able to read an emergency exit sign, he's convinced that Pablo is innocent despite the DNA evidence used to convict him. With Stottlemeyer and Disher in tow, Monk and Natalie attempt to talk to the model's former roommate and the fashion designer she worked for, Julian Hodge. But now there's a new problem: Hodge wants thirteen-year-old Julie to model for him. Watching the rehearsal for a fashion show in which Julie will make her debut, Monk discovers a clue that points him to the real killer. When another supermodel is found dead, it's imperative that Monk find new evidence to prove his suspect guilty of both murders and set Pablo free--and for Natalie to get Julie away from the person committing the murders.",
                        "air_date": "2006-01-13",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Mr. Monk Bumps His Head",
                        "overview": "Suffering from amnesia, Monk wakes up believing he is the husband of an eccentric resident of a small town.",
                        "air_date": "2006-01-20",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Mr. Monk and the Captain's Marriage",
                        "overview": "During the investigation of a murder in a junkyard, Captain Stottlemeyer punches a cop named Ryan Sharkey, who claims to be having an affair with the captain's wife, Karen. The only witness to the murder, a homeless man named Gerald or Jerry, has disappeared, but Stottlemeyer suspects businessman Michael Karpov, who is facing charges for money laundering and had a motive for killing the victim, who was scheduled to testify against him. Removed from the case and ordered to take anger management classes, Stottlemeyer asks Monk and Natalie to follow his wife, whom he suspects of lying about her whereabouts. They discover Karen having lunch with a man but are only able to photograph him from the back before being interrupted. Meanwhile, the homeless witness has been stunned and thrown from the third floor of a building but survives the fall, thanks to a corrugated refrigerator carton. Disher places Karpov in a line-up otherwise composed of police officers, including Sharkey, but Stottlemeyer, still enraged at Sharkey, disrupts the line-up before the procedure has been completed. An apple provides the clue that Monk needs to solve the murder case, and Karen reveals the identity of the mystery man she had lunch with. Unfortunately for the captain, it isn't Sharkey.",
                        "air_date": "2006-01-27",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Mr. Monk and the Big Reward",
                        "overview": "Low on cash because they haven't had a homicide to investigate in three weeks, Monk and Natalie search for the stolen Alexander Diamond, hoping to win the million-dollar reward. Unfortunately, they have competition in the form of a retired Scotland Yard investigator, a bounty hunter, and a gadget-loving private detective, all of whom want the reward money for themselves. Monk quickly figures out that the heist was an inside job and that one of the robbers was under five feet tall, short enough to hide inside a roll-top desk. He also discovers a clue linking a perpetrator to a transcendental meditation retreat. With their competitors close behind them, Monk and Natalie head for the retreat, where they find the thief, who is unfortunately dead. Meanwhile, Disher is having to interrogate a strange young woman who keeps turning herself in for such \"\"crimes\"\" as stealing pens or murdering a hamster. Monk tells Natalie that he's solved the case and they race to the police station with the other detectives following. The only thing left is to find the diamond before their competitors do.",
                        "air_date": "2006-02-03",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "Mr. Monk and the Astronaut",
                        "overview": "When Captain Stottlemeyer suspects that a suicide is really a murder, Monk confirms his suspicions by discovering that the victim, Joanne Raphelson, was too short to have used the stool she supposedly stood on to hang herself. But the next clue, the remains of an olive, a cherry, and a cocktail onion on a stirring stick, leads Monk to suspect that the murder was committed by an astronaut, Steve Wagner. A little research reveals a motive--Joanne was about to publish a book revealing that Wagner had abused her five years earlier. Now all Monk has to do is to prove that Wagner could commit the murder when he was in outer space.",
                        "air_date": "2006-03-03",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Mr. Monk Goes to the Dentist",
                        "overview": "During the investigation of an armored car heist involving the deaths of two drivers and the theft of valuable government bonds, Lt. Disher tries to convince Captain Stottlemeyer that he witnessed a murder while under anesthesia in the dentist's office. When one of the highjackers, Denny Jardeen, is found murdered, Disher insists that Jardeen is the man he saw Dr. Bloom and his assistant kill while he was sedated. Stottlemeyer still thinks that Disher was hallucinating, and Disher angrily leaves the force, deciding to revive his high school rock band, the Randy Disher Project, as an alternate means of earning his living. Meanwhile, the only clue to Jardeen's murder is two pairs of bruises each ten inches apart on the dead man's chest.",
                        "air_date": "2006-03-10",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "Mr. Monk Gets Jury Duty",
                        "overview": "Monk is summoned to jury duty against his wishes and must solve two crimes: he has to convince the jury the defendent is not guilty, and solve the mystery of a corpse outside the jury room's window.",
                        "air_date": "2006-03-17",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 5,
                "episode_count": 16,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Mr. Monk and the Actor",
                        "overview": "While working on a double murder, Monk finds that imitation is the sincerest form of flattery when he finds that an obsessive method actor has been cast to play...Adrian Monk in a new movie.",
                        "air_date": "2006-07-07",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Mr. Monk and the Garbage Strike",
                        "overview": "Monk finds himself adrift in an ocean of filth when a garbage strike brings San Francisco to a halt...and Adrian to near-paralysis.",
                        "air_date": "2006-07-14",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Mr. Monk and the Big Game",
                        "overview": "Julie and her friends hire Monk to look into the suspicious death of their basketball coach.",
                        "air_date": "2006-07-21",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Mr. Monk Can't See a Thing",
                        "overview": "When Monk goes to his firehouse to get his smoke detectors inspected, the crew is quickly called away to a fatal house fire in which a young woman is killed. Minutes later, a mysterious intruder walks into the firehouse, lethally bludgeons a veteran fireman, blinds Monk with cleaning acid, then escapes. Despite Monk losing his eyesight, Stottlemeyer coaxes him to continue investigating, and Monk soon finds that the fire and his attack are connected.",
                        "air_date": "2006-07-28",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Mr. Monk, Private Eye",
                        "overview": "When Natalie convinces Monk to go into business as a private eye, his first case is a seemingly innocuous fender bender that leads to a far more dangerous investigation.",
                        "air_date": "2006-08-04",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Mr. Monk and the Class Reunion",
                        "overview": "Monk attends his college reunion and uncovers a complex murder plot against one of his former classmates.",
                        "air_date": "2006-08-11",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Mr. Monk Gets a New Shrink",
                        "overview": "When Dr. Kroger retires after his cleaning lady is killed, it's up to Monk to solve the case and get Dr. Kroger back to work.",
                        "air_date": "2006-08-18",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Mr. Monk Goes to a Rock Concert",
                        "overview": "Monk goes to a rock concert to look for Captain Stottlemeyer's son and finds himself in the middle of a murder investigation.",
                        "air_date": "2006-08-25",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Mr. Monk Meets His Dad",
                        "overview": "When Monk's truck driving father rolls into town at Christmastime, Monk joins him on the road, where they stumble across a very peculiar mystery.",
                        "air_date": "2006-11-17",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Mr. Monk and the Leper",
                        "overview": "A missing millionaire suffering from leprosy comes out of hiding to hire Monk, who soon finds himself in the midst of a shadowy murder plot worthy of a classic Hollywood film noir.  Episode originally aired in black and white.",
                        "air_date": "2006-12-22",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Mr. Monk Makes a Friend",
                        "overview": "A fun-loving everyman named Hal bumps into Monk, and the two become fast friends.  For the first time in his life, Monk appears to have a buddy.  But is Hal up to something?",
                        "air_date": "2007-01-19",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Mr. Monk is At Your Service",
                        "overview": "When Natalie suspects foul play in the deaths of her parents' wealthy neighbors, Monk goes undercover as a butler to investigate.",
                        "air_date": "2007-01-26",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Mr. Monk is On the Air",
                        "overview": "Monk goes toe to toe with a popular radio shock jock who is suspected of killing his wife.",
                        "air_date": "2007-02-02",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "Mr. Monk Visits a Farm",
                        "overview": "When Lt. Disher inherits a farm from an uncle who committed suicide, he decides to quit the police force and start a new life in the country. But Disher soon suspects that his uncle was murdered, so Monk joins him on the farm to investigate.",
                        "air_date": "2007-02-09",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Mr. Monk and the Really, Really Dead Guy",
                        "overview": "When the mysterious “Six Way Killer” strikes in San Francisco, Monk matches his detective skills against the flashy forensic technology of a federal agent as they both pursue the murderer.",
                        "air_date": "2007-02-23",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "Mr. Monk Goes to the Hospital",
                        "overview": "Monk goes to the emergency room for a bloody nose, but when a doctor in the hospital turns up dead, Monk joins the murder investigation, and soon his own life is in grave danger.",
                        "air_date": "2007-03-02",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 6,
                "episode_count": 16,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Mr. Monk and His Biggest Fan",
                        "overview": "When Marci Maven is accused of a bizarre crime, she turns to the object of her obsession for help - Adrian Monk.",
                        "air_date": "2007-07-13",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Mr. Monk and the Rapper",
                        "overview": "Monk is hired to clear the name of a famous rap star who is accused of murder.",
                        "air_date": "2007-07-20",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Mr. Monk and the Naked Man",
                        "overview": "Monk must confront his prejudice against nudists when he's called to investigate a murder on a nude beach.",
                        "air_date": "2007-07-27",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Mr. Monk and the Bad Girlfriend",
                        "overview": "Monk's friendship with Captain Stottlemeyer is put to the test when Monk suspects the captain's girlfriend of murder.",
                        "air_date": "2007-08-03",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Mr. Monk and the Birds and the Bees",
                        "overview": "Monk tries to prove a sports agent is guilty of murder while helping Natalie’s teenage daughter with her love life.",
                        "air_date": "2007-08-10",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Mr. Monk and the Buried Treasure",
                        "overview": "Monk digs up trouble after following a treasure map brought to him by Dr. Kroger's son Troy.",
                        "air_date": "2007-08-17",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Mr. Monk and the Daredevil",
                        "overview": "Monk has trouble coping with new information that he finds out about his arch-rival, Harold Krenshaw.",
                        "air_date": "2007-08-24",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Mr. Monk and the Wrong Man",
                        "overview": "When a man he sent to prison years ago is cleared based on new evidence, a guilty Monk tries to help him adjust to life on the outside.",
                        "air_date": "2007-09-07",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Mr. Monk Is Up All Night",
                        "overview": "Mr. Monk takes a walk when he can't sleep, but ends up running into a murder.",
                        "air_date": "2007-09-14",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Mr. Monk and the Man Who Shot Santa Claus",
                        "overview": "Monk becomes a social pariah when he shoots a man dressed as Santa Claus. Then he must clear his name and foil a larger criminal plot, all in time for Christmas.",
                        "air_date": "2007-12-07",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Mr. Monk Joins a Cult",
                        "overview": "Monk joins a cult to solve a murder case, but becomes entranced by the cult's charismatic leader.",
                        "air_date": "2008-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Mr. Monk Goes to the Bank",
                        "overview": "One of Monk's treasured possessions is stolen from a safety deposit box, and he'll go to any length to solve the case.",
                        "air_date": "2008-01-18",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Mr. Monk and the Three Julies",
                        "overview": "Monk searches for a killer who is apparently targeting women with the name Julie, a name which Natalie's daughter shares.",
                        "air_date": "2008-01-25",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "Mr. Monk Paints His Masterpiece",
                        "overview": "Monk decides to take up painting as a hobby, and discovers an ardent admirer willing to buy anything he produces.",
                        "air_date": "2008-02-01",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Mr. Monk Is On The Run (1)",
                        "overview": "Monk is arrested for murder, and finds that he has to go on the lam to clear himself.",
                        "air_date": "2008-02-15",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "Mr. Monk Is On The Run (2)",
                        "overview": "Stottlemeyer must keep up the pretense that Monk is dead, while Adrian tries to determine who framed him for murder.",
                        "air_date": "2008-02-22",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 7,
                "episode_count": 16,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Mr. Monk Buys a House",
                        "overview": "Monk finds himself forced to move into what he hopes will be his dream house... which is anything but.",
                        "air_date": "2008-07-18",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Mr. Monk and the Genius",
                        "overview": "Monk must match wits against a grandmaster chess player that he suspects of murder.",
                        "air_date": "2008-07-25",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Mr. Monk Gets Lotto Fever",
                        "overview": "Monk has to help out Natalie when she becomes involved in a lotto scandal.",
                        "air_date": "2008-08-01",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Mr. Monk Takes a Punch",
                        "overview": "Monk finds a new lease on life after giving up his hope of reinstatement to the SFPD.",
                        "air_date": "2008-08-08",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Mr. Monk Is Underwater",
                        "overview": "A friend of Natalie's ex-husband seemingly commits suicide aboard a locked cabin on a submarine. Monk agrees to investigate, despite his phobia about being on--and beneath--the water.",
                        "air_date": "2008-08-15",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Mr. Monk Falls in Love",
                        "overview": "When Monk develops a crush on a model who is accused of murder, he is determined to prove her innocence, even though she confessed.",
                        "air_date": "2008-08-22",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Mr. Monk's 100th Case",
                        "overview": "As Monk and his friends watch a TV news magazine piece on the solution of his hundredth case, he realizes that one of the victims was murdered by a different killer.",
                        "air_date": "2008-09-05",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Mr. Monk Gets Hypnotized",
                        "overview": "Monk agrees to undergo hypnotic therapy as treatment for his OCD and reverts to a different persona.",
                        "air_date": "2008-09-12",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Mr. Monk and the Miracle",
                        "overview": "When three homeless men seek Monk's services at the holidays, Natalie convinces him to investigate their friend's death; Stottlemeyer's faith is reawakened after a visit to a monastery fountain rids him of crippling pain.",
                        "air_date": "2008-11-28",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Mr. Monk's Other Brother",
                        "overview": "When Monk's delinquent half-brother, Jack Jr., escapes from prison and breaks into Monk's apartment, he manipulates Monk into helping him find the person he claims framed him for murder.",
                        "air_date": "2009-01-09",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Mr. Monk on Wheels",
                        "overview": "When Natalie unwittingly helps a thief steal the bicycle of a biotech CEO, she ropes Monk into solving a crime straight out of \"Encyclopedia Brown\" until Monk learns the hard way how dangerous this thief really is.",
                        "air_date": "2009-01-16",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Mr. Monk and the Lady Next Door",
                        "overview": "While investigating a murder at a museum of oddities, Monk befriends a warm older woman, but he has trouble believing the friendship comes without a catch.",
                        "air_date": "2009-01-23",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Mr. Monk Makes the Playoffs",
                        "overview": "Monk has scored tickets to the biggest football game of the year, but he and Captain Stottlemeyer can't go inside until they figure out who tried to blow up a fan in the parking lot.",
                        "air_date": "2009-01-30",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "Mr. Monk and the Bully",
                        "overview": "When a childhood bully who terrorized Monk hires the detective to trail his wife, whom he suspects of infidelity, Monk relishes the opportunity to prove him right — and things get even sweeter when the bully is accused of murder.",
                        "air_date": "2009-02-06",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Mr. Monk and the Magician",
                        "overview": "When a friend of Monk's is killed, Monk believes that a magician is responsible and a battle of wits and sleight-of-hand ensue.",
                        "air_date": "2009-02-13",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "Mr. Monk Fights City Hall",
                        "overview": "Monk becomes involved in the disappearance of a city official that could have ramifications concerning Trudy's murder.",
                        "air_date": "2009-02-20",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 8,
                "episode_count": 16,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Mr. Monk's Favorite Show",
                        "overview": "After the attempted murder of a former child star from Monk's favorite show, Monk accept the job as her bodyguard.",
                        "air_date": "2009-08-07",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Mr. Monk and the Foreign Man",
                        "overview": "Monk meets a visiting African widower who's determined to find the hit-and-run-driver who killed his wife near Monk's apartment. Monk begins to identify with the man and confuses his wife with Trudy.",
                        "air_date": "2009-08-14",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Mr. Monk and the UFO",
                        "overview": "Monk and Natalie are stranded in a small desert town and the detective spots a UFO. He soon discovers himself the center of attention, and is called in to investigate a dead woman discovered in the desert.",
                        "air_date": "2009-08-21",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Mr. Monk is Someone Else",
                        "overview": "Monk assumes a dead hitman's identity in order to foil an assassination plot.",
                        "air_date": "2009-08-28",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Mr. Monk Takes the Stand",
                        "overview": "Monk and the police have a killer right where they want him... until the case goes to court and a hotshot lawyer demolishes the prosecution as he uses Monk's phobias against them",
                        "air_date": "2009-09-11",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Mr. Monk and the Critic",
                        "overview": "Natalie suspects a theater critic is responsible for a murder, despite the fact that he was present to review her daughter Julie's play at the same time the victim died.",
                        "air_date": "2009-09-18",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Mr. Monk and the Voodoo Curse",
                        "overview": "Area residents receive unmarked dolls that seem to predict a series of strange deaths, leading many to suspect a voodoo curse is in play. The mystery hits close to home when Natalie becomes involved.",
                        "air_date": "2009-09-25",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Mr. Monk Goes to Group Therapy",
                        "overview": "After Monk's insurance company refuses to pay for more private therapy sessions, he joins Dr. Bell's therapy group, where it appears that someone is murdering fellow patients.",
                        "air_date": "2009-10-09",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Happy Birthday, Mr. Monk",
                        "overview": "Natalie tries to throw a surprise party for her surprise-hating boss, who is busy trying to solve the murder of a maintenance man.",
                        "air_date": "2009-10-16",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Mr. Monk and Sharona",
                        "overview": "When Sharona returns to San Francisco to handle legal issues related to an uncle's death, Monk suspects foul play and is torn between the differing styles of Sharona and Natalie.",
                        "air_date": "2009-10-23",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Mr. Monk and the Dog",
                        "overview": "Monk reluctantly adopts a dog while looking into the suspicious disappearance of its owner.",
                        "air_date": "2009-10-30",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Mr. Monk Goes Camping",
                        "overview": "To get reinstated, Monk must go camping with the son of a committee member... and try to solve a crime.",
                        "air_date": "2009-11-06",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Mr. Monk Is the Best Man",
                        "overview": "Monk must determine who is trying to ruin a friend's wedding.",
                        "air_date": "2009-11-13",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "Mr. Monk and the Badge",
                        "overview": "Upon being reinstated, Monk is put in charge of tracking down a serial killer.",
                        "air_date": "2009-11-20",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "Mr. Monk and the End (1)",
                        "overview": "Monk is called to a murder at the location where he first heard of his wife's murder, and while Monk figures out who the assassin is, he doesn't know that the one who ordered the hit is also responsible for the death of Trudy. Knowing that Monk will eventually put all the pieces together, he orders Monk's death, and when all hope seems lost, Monk discovers something which could finally end his 12-year nightmare.",
                        "air_date": "2009-11-27",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "Mr. Monk and the End (2)",
                        "overview": "After listening to Trudy's last message, Monk finally discovers who killed his wife. Racing against time before he dies of poison, he must make a fateful decision.",
                        "air_date": "2009-12-04",
                        "watched": false
                    }
                ]
            }
        ]
    },
    {
        "title": "Future Man",
        "status": "watched",
        "rating": 3,
        "overview": "Josh Futturman, a janitor by day/world-ranked gamer by night, is tasked with preventing the extinction of humanity after mysterious visitors from the future proclaim him the key to defeating the imminent super-race invasion.",
        "poster": "https://image.tmdb.org/t/p/w500/49mOgAEa4eKpPsoBH8UvvXwEMDT.jpg",
        "year": "2017",
        "tmdb_rating": 7.157,
        "seasons": [
            {
                "season_number": 1,
                "episode_count": 13,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Pilot",
                        "overview": "Josh Futturman feels stuck in his dead-end job as a janitor so all he really does is play Biotic Wars, an unbeatable videogame the rest of the world has given up on. But when Josh beats the game, mysterious visitors from the future appear: the world is in danger, and Josh is the only one who can save it.",
                        "air_date": "2017-11-14",
                        "watched": true
                    },
                    {
                        "episode_number": 2,
                        "name": "Herpe: Fully Loaded",
                        "overview": "In 1969, Josh, Tiger, and Wolf launch a mission to infiltrate a fraternity party and prevent Dr. Kronish from contracting herpes—but the destruction they’ve left in their wake quickly catches up with them.",
                        "air_date": "2017-11-14",
                        "watched": true
                    },
                    {
                        "episode_number": 3,
                        "name": "A Riphole in Time",
                        "overview": "Tiger and Wolf decide it’s time for Dr. Kronish to die. Josh reluctantly agrees to help—but when he realizes he can’t go through with it, he finds himself caught in Tiger and Wolf’s sights instead.",
                        "air_date": "2017-11-14",
                        "watched": true
                    },
                    {
                        "episode_number": 4,
                        "name": "A Fuel's Errand",
                        "overview": "In the wake of the disastrous attempt to assassinate Dr. Kronish, Tiger and Wolf kick Josh off the mission. When they realize their Time Travel Device is compromised, Josh makes a deal: if he can get them more fuel, they’ll let him back on the team.",
                        "air_date": "2017-11-14",
                        "watched": true
                    },
                    {
                        "episode_number": 5,
                        "name": "Justice Desserts",
                        "overview": "Tiger, Wolf, and Josh work to unmask the Biotics undercover at the Kronish Labs Christmas party. Meanwhile, Josh grows closer to his coworker Jeri as she helps him avoid the obsessed policeman hot on Josh’s tail.",
                        "air_date": "2017-11-14",
                        "watched": true
                    },
                    {
                        "episode_number": 6,
                        "name": "A Blowjob Before Dying",
                        "overview": "With just twenty-seven minutes before a bomb explodes in the head of their captured Biotic, Josh, Tiger, and Wolf hold a high-stakes interrogation in Josh's bedroom while Josh’s unwitting parents host a holiday dinner party downstairs.",
                        "air_date": "2017-11-14",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Pandora's Mailbox",
                        "overview": "Josh, Tiger, and Wolf jump into the future to steal the fuel they desperately need to continue their mission. But when they arrive at their destination, they are confronted by an unexpected enemy.",
                        "air_date": "2017-11-14",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Girth, Wind & Fire",
                        "overview": "The end of the mission is in sight as Tiger and Wolf prepare for one final jump into the past. But when Josh’s mom is kidnapped, Josh refuses to let Tiger and Wolf leave before they mount a daring rescue to save her.",
                        "air_date": "2017-11-14",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Operation: Fatal Attraction",
                        "overview": "Convinced he knows how to stop Dr. Kronish once and for all, Josh commandeers the TTD and leads the team on a mission into the past. But when Wolf goes missing, they have to spilt up, forcing Josh to carry out his insane plan alone.",
                        "air_date": "2017-11-14",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Operation: Natal Attraction",
                        "overview": "Still in the past, Josh desperately tries to change Dr. Kronish’s future while not messing up his own. Meanwhile, Tiger and Wolf confront each other over Wolf's wavering dedication to the cause.",
                        "air_date": "2017-11-14",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Beyond the TruffleDome",
                        "overview": "Torn apart by internal divisions, the team is scattered throughout history, as Tiger and Wolf reckon with the way the mission has changed them and the possibility that they might fail.",
                        "air_date": "2017-11-14",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Prelude to an Apocalypse",
                        "overview": "Josh discovers that his interference in the past has completely transformed his life…for the better. Wolf and Tiger deal with the aftermath of their failed mission to the past.",
                        "air_date": "2017-11-14",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "A Date With Destiny",
                        "overview": "Out of time and options, the team reconciles that their actions have made everything much, much worse and plan one final mission to put an end to Dr. Kronish and the Cure forever.",
                        "air_date": "2017-11-14",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 2,
                "episode_count": 13,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Countdown to a Prologue",
                        "overview": "Josh is confused to discover that he’s been released from jail. As he tries to make sense of this, he quickly realizes that all is not as it seems in his world. A new nefarious plan is afoot and Josh is being pulled into it whether he likes it or not.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The i of the Tiger",
                        "overview": "Tiger and Wolf arrive in the future they created. Tiger is not welcome in The NAG (The New Above Ground) so she heads to The Mons where she learns humanity is moving to Mars, her DNA created the cure, and Stu Camillo is alive and well in hologram form.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "A Wolf in the Torque House",
                        "overview": "Wolf is mistaken for Torque (the Wolf in this timeline) and he goes with it – learning about the NAG, and its 6-parent families and hatred of technology. Wolf tries to escape but the appeal of this new, strange world makes it hard for him to leave.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Guess Who's Coming to Lunch",
                        "overview": "As Tiger gets to know her doppelganger Ty-Anne, Wolf acclimates to the NAG, and Josh wanders the desert. Josh is brought to the NAG and remanded to indentured servitude as a technology smasher.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "J1: Judgment Day",
                        "overview": "Josh, Tiger, and Wolf go on a mission to find their TTD and take down the Pointed Circle.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Binx Ultimatum",
                        "overview": "Tiger uses Stu’s fondness for her to help her track down Athena. Meanwhile, Josh is now a “Smasher” remanded to a labor camp, where the Pointed Circle comes after him. Wolf, vowing to improve the NAG, faces off against Supreme Overlord Vice.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Homicide: Life in the Mons",
                        "overview": "Wolf, ignoring warnings about the Pointed Circle, brings Josh to live outside his Clusternest. Tiger reaches a dead end in her quest for the TTD.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The Last Horchata",
                        "overview": "Stu introduces a depressed Tiger to his simulation – where anything can be reality, drawing them closer than ever before.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Ballad of PUP-E Q. Barkington",
                        "overview": "Stu sends commandos to abduct Josh in the NAG – chaos and bloodshed ensue. Josh and Wolf learn the identity of Achilles, the elusive leader of the Pointed Circle.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Exes and OS",
                        "overview": "Ty-Anne shares the story of growing up with Stu as her father and her early exposure to The Pointed Circle. Josh believes he’s the key to stopping Stu once and for all.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Dia De Los Robots",
                        "overview": "It’s the day of the MARS launch. Josh goes on a suicide mission to sneak into Stu’s upload machine to shut him down for good.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The Brain Job",
                        "overview": "Armed with the newly discovered TTD, our team uses an 11-second window to jump back in time over and over to reach Stu’s brain and destroy it.",
                        "air_date": "2019-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Ultra-Max",
                        "overview": "Having messed with time travel one too many times, Josh, Tiger, and Wolf land in jail in the year 3491. Facing a death sentence for their crimes, their loyalty to each other is tested by their cruel and unusual jailer, Susan.",
                        "air_date": "2019-01-11",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 3,
                "episode_count": 8,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Precipice of Yesterday",
                        "overview": "Josh, Tiger, and Wolf are forced to compete in the Diecathalon, but a complication arises that puts them at odds with each other.",
                        "air_date": "2020-04-03",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "There Will Be Borscht",
                        "overview": "Josh puts his faith in The Voice while Wolf basks in his element and Tiger struggles to adapt.",
                        "air_date": "2020-04-03",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Trapper's Delight",
                        "overview": "Josh’s crisis of faith comes to a head as Tiger connects with her killer instincts, and Wolf struggles to lay low.",
                        "air_date": "2020-04-03",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Outlaw Wild Sam Bladden",
                        "overview": "Tiger and Wolf come to terms with their true selves as Josh is forced to confront what and who he truly believes.",
                        "air_date": "2020-04-03",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Haven Is for Real",
                        "overview": "Josh makes a risky deal. Tiger and Wolf let Josh take command.",
                        "air_date": "2020-04-03",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Land After Time",
                        "overview": "Josh discovers a new happiness as Wolf loses his mind and Tiger embarks on an unexpected journey.",
                        "air_date": "2020-04-03",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Time Rogues III: Escape From Forever",
                        "overview": "Josh and Wolf reunite and make a desperate move to escape while Tiger reconciles her past and present selves.",
                        "air_date": "2020-04-03",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Return of the Present",
                        "overview": "The universe is about to end. For real this time.",
                        "air_date": "2020-04-03",
                        "watched": false
                    }
                ]
            }
        ]
    },
    {
        "title": "cuphead",
        "status": "watched",
        "rating": 4,
        "overview": "Follow the misadventures of the impulsive Cuphead and his cautious but persuadable brother Mugman in this animated series based on the hit video game.",
        "poster": "https://image.tmdb.org/t/p/w500/l6nGUyxKCi7ODvyfc8qQShliVEd.jpg",
        "year": "2022",
        "tmdb_rating": 7.937,
        "seasons": [
            {
                "season_number": 1,
                "episode_count": 12,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Carn-Evil",
                        "overview": "Cuphead convinces Mugman they should ditch their chores and head to the carnival, unaware it's a front to collect souls.",
                        "air_date": "2022-02-18",
                        "watched": true
                    },
                    {
                        "episode_number": 2,
                        "name": "Baby Bottle",
                        "overview": "The brothers take care of a baby left at their front door. But with Elder Kettle gone and a strict warning to be good, it's harder than they imagined.",
                        "air_date": "2022-02-18",
                        "watched": true
                    },
                    {
                        "episode_number": 3,
                        "name": "Ribby & Croaks",
                        "overview": "A squabbling Mugman and Cuphead sneak into a club to grab some ice cream after the boxing champs who own it steal their money.",
                        "air_date": "2022-02-18",
                        "watched": true
                    },
                    {
                        "episode_number": 4,
                        "name": "Handle with Care",
                        "overview": "After Mugman's handle breaks off, the brothers visit a greedy shopkeeper and get creative while on the hunt for glue.",
                        "air_date": "2022-02-18",
                        "watched": true
                    },
                    {
                        "episode_number": 5,
                        "name": "Roll the Dice",
                        "overview": "All bets are off when Cuphead takes over Inkwell Isle's No. 1 game show, much to the annoyance of its devious host King Dice and his devilish boss.",
                        "air_date": "2022-02-18",
                        "watched": true
                    },
                    {
                        "episode_number": 6,
                        "name": "Ghosts Ain't Real",
                        "overview": "A spooky bunch of ghosts treat Cuphead and Mugman to a night of chills and thrills after trapping them inside a creepy graveyard.",
                        "air_date": "2022-02-18",
                        "watched": true
                    },
                    {
                        "episode_number": 7,
                        "name": "Root Packed",
                        "overview": "Cuphead and Mugman have to defend Elder Kettle's precious vegetable garden after a rotten gang turns their yard into a party.",
                        "air_date": "2022-02-18",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Sweater Off Dead",
                        "overview": "Mugman knits a special sweater to keep Cuphead's soul safe. Meanwhile, in the underworld, the Devil is throwing a party.",
                        "air_date": "2022-02-18",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Sweater Luck Next Time",
                        "overview": "The Devil follows the brothers day after day, waiting for Cuphead to take off his sweater so he can collect his soul before Stickler finds out.",
                        "air_date": "2022-02-18",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Dangerous Mugman",
                        "overview": "Cuphead and a cowardly Mugman test their courage after Porkrind sends them on a dangerous errand that quickly gets out of hand.",
                        "air_date": "2022-02-18",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Dirt Nap",
                        "overview": "Elder Kettle overhears strange conversations between Cuphead and Mugman, then worries that the boys have menacing plans for him.",
                        "air_date": "2022-02-18",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "In Charm's Way",
                        "overview": "Trouble follows the brothers when Cuphead and Mugman get in over their heads upon meeting a free-spirited, street-smart new friend.",
                        "air_date": "2022-02-18",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 2,
                "episode_count": 13,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Jail-Broken",
                        "overview": "Cuphead and Mugman are in the slammer after breaking into the cookie factory. Prison's scary — but now they can't decide whether to bust out or stay in!",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Charmed and Dangerous",
                        "overview": "Trouble comes a-knockin' when Ms. Chalice turns up on Elder Kettle's doorstep and turns on the charm. The question is: Can she be trusted?",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "A High Seas Adventure!",
                        "overview": "The boys think they're just \"playing\" pirate until they actually drift out to sea and get roped into a mission to reunite a captain and his sweetheart.",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Another Brother",
                        "overview": "After an argument with Mugman, Cuphead goes looking for another brother. But his reckless new sibling isn't all he's cracked up to be.",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Sweet Temptation",
                        "overview": "Cuphead's self-control is put to the test when he discovers a sugary dreamland where he can eat all the sweets he wants... with a catch.",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The I Scream Man",
                        "overview": "All Mugman wants is a little peace and quiet while Cuphead and Elder Kettle are away. Enter the ice cream man — and his jaunty truck's maddening jingle.",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Piano Lesson",
                        "overview": "Mugman gets dangerously jealous when his snooty piano teacher taps Cuphead to compete for a $10,000 musical prize instead of him.",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Release the Demons!",
                        "overview": "Steaming mad and ready for revenge, the Devil summons his finest demons and sends them above ground on a mission to recapture Cuphead's soul.",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Dead Broke",
                        "overview": "Ms. Chalice and the boys craft a perfect spooky scam: making money as ghost removers! But things get real when they pick a house that's already haunted.",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Rats All Folks!",
                        "overview": "A crafty rat claims ownership of Elder Kettle's cottage and all of its contents after a careless Cuphead and Mugman leave the door open.",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Say Cheese!",
                        "overview": "Elder Kettle wants to snap a family portrait of him and his boys — and, boy, does he get it! Just not in the picture-perfect setting he was expecting.",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Lost in the Woods",
                        "overview": "Winter's coming and there's lots of work to do, but Cuphead doesn't want to do any of it. Forget chopping wood — he'd rather launch rockets into the sky!",
                        "air_date": "2022-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Devil's Pitchfork",
                        "overview": "Cuphead and Mugman are giddy with power when they get their hands on the Devil's pitchfork and make fiery mischief all over town.",
                        "air_date": "2022-08-19",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 3,
                "episode_count": 11,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Devil's Revenge!",
                        "overview": "Without Mugman, Cuphead doesn't know what to do with himself. Can he strike a deal with the Devil to save his beloved brother and bring him home?",
                        "air_date": "2022-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Don't Answer the Door",
                        "overview": "Knock, knock! Danger's at the door when Elder Kettle goes out to get his mustache waxed, leaving a bumbling Cuphead and Mugman home alone.",
                        "air_date": "2022-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Cupstaged",
                        "overview": "Sally Stageplay's holding auditions for an exciting new space opera. But Cuphead, Mugman and the Devil all want the same role: the lead.",
                        "air_date": "2022-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Roadkill",
                        "overview": "After hitting the Devil with his car, Elder Kettle takes him in, mistaking him for a humble house cat he affectionately calls \"Mrs. Meow Meow.\"",
                        "air_date": "2022-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Holiday Tree-dition",
                        "overview": "With Christmas fast approaching, Elder Kettle sends the boys on an important errand: to pick out the perfect tree.",
                        "air_date": "2022-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "A Very Devil Christmas",
                        "overview": "Christmas brings out the worst in the Devil, who's notoriously naughty... until he schemes to get himself onto Santa's nice list.",
                        "air_date": "2022-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Special Delivery",
                        "overview": "After breaking Porkrind's window, Cuphead, Mugman and Ms. Chalice must work off the debt by delivering a mysterious package to Ribby and Croaks.",
                        "air_date": "2022-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Down and Out",
                        "overview": "King Dice — the Devil's onetime No. 1 — is out of the spotlight. But Cuphead of all people wants to be his manager and help him make a comeback.",
                        "air_date": "2022-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "JoyRide",
                        "overview": "It's time for a day of fun with Elder Kettle... or is it? With an assist from Ms. Chalice, Cuphead and Mugman are scaring up shenanigans all over town!",
                        "air_date": "2022-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Dance with Danger",
                        "overview": "A fateful flashback reveals what Ms. Chalice's life was like before she met Cuphead and Mugman.",
                        "air_date": "2022-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Devil and Ms. Chalice",
                        "overview": "An epic dance contest morphs into a high-stakes game of winners and losers, with more than one soul on the line. How will it all end? Hilariously.",
                        "air_date": "2022-11-18",
                        "watched": false
                    }
                ]
            }
        ]
    }
]