[
    {
        "title": "Breaking Bad",
        "status": "watched",
        "rating": 5,
        "overview": "A high school chemistry teacher turned methamphetamine manufacturer...",
        "poster": "https://image.tmdb.org/t/p/w500/ggFHVNu6YYI5L9pCfOacjizRGt.jpg",
        "year": "2008",
        "tmdb_rating": 8.8
    },
    {
        "title": "The Wire",
        "status": "watched",
        "rating": 5,
        "overview": "The Baltimore drug scene, as seen through the eyes of drug dealers and law enforcement...",
        "poster": "https://image.tmdb.org/t/p/w500/9Gtg2DzBhmYamXBS1hKAhiwbBKS.jpg",
        "year": "2002",
        "tmdb_rating": 9.3
    },
    {
        "title": "Better Call Saul",
        "status": "watched",
        "rating": 4,
        "overview": "The trials and tribulations of criminal lawyer Jimmy McGill in the years leading up to establishing his strip-mall law office in Albuquerque, New Mexico...",
        "poster": "https://image.tmdb.org/t/p/w500/4yYu7GR7Q7NY5zFQ7t3X0a8w0jz.jpg",
        "year": "2015",
        "tmdb_rating": 8.7
    },
    {
        "title": "The Squid Game",
        "status": "ongoing",
        "rating": 0,
        "overview": "Hundreds of cash-strapped contestants accept an invitation to compete in children's games for a tempting prize, but the stakes are deadly...",
        "poster": "https://image.tmdb.org/t/p/w500/dDlEmu3EZ0Pgg93K2SVNLCjCSvE.jpg",
        "year": "2021",
        "tmdb_rating": 7.9
    },
    {
        "title": "Silo",
        "status": "ongoing",
        "rating": 0,
        "overview": "In a ruined and toxic future, thousands live in a giant silo deep underground. After its sheriff breaks a cardinal rule and residents die mysteriously, engineer Juliette starts to uncover shocking secrets...",
        "poster": "https://image.tmdb.org/t/p/w500/8X8t0X5X2t3X0a8w0jz.jpg",
        "year": "2023",
        "tmdb_rating": 8.1
    },
    {
        "title": "The Sopranos",
        "status": "watched",
        "rating": 5,
        "overview": "The story of New Jersey-based Italian-American mobster Tony Soprano and the difficulties he faces as he tries to balance the conflicting requirements of his home life and the criminal organization he heads. Those difficulties are often highlighted through his ongoing professional relationship with psychiatrist Jennifer Melfi. The show features Tony's family members and Mafia associates in prominent roles and story arcs, most notably his wife Carmela and his cousin and protégé Christopher Moltisanti.",
        "poster": "https://image.tmdb.org/t/p/w500/57okJJUBK0AaijxLh3RjNUaMvFI.jpg",
        "year": "1999",
        "tmdb_rating": 8.7
    },
    {
        "title": "Six Feet Under",
        "status": "to_watch",
        "rating": 0,
        "overview": "When death is your business, what is your life? For the Fisher family, the world outside of their family-owned funeral home continues to be at least as challenging as—and far less predictable than—the one inside.",
        "poster": "https://image.tmdb.org/t/p/w500/ztuH5aJIZQpu5ci27tY2nx1gwjO.jpg",
        "year": "2001",
        "tmdb_rating": 8.1,
        "seasons": [
            {
                "season_number": 1,
                "episode_count": 13,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Pilot",
                        "overview": "Nate Fisher returns home for the holidays to the shattering news of his father's death.",
                        "air_date": "2001-06-03",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Will",
                        "overview": "After a pyramid scheme owner dies and leaves his wife and baby daughter with a load of debt, Nate offers to loan them a casket. Meanwhile, the Fisher family attend the reading of their father's will.",
                        "air_date": "2001-06-10",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Foot",
                        "overview": "When a bakery owner is killed, it's up to Federico to put the pieces back together. The family considers selling the funeral business altogether to Kroehner.",
                        "air_date": "2001-06-17",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Familia",
                        "overview": "After a gang member is killed, the Fishers find that his family's wishes for burial differ from those of his gang leader. Nate's girlfriend Brenda makes an unfavorable impression during a family dinner.",
                        "air_date": "2001-06-24",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "An Open Book",
                        "overview": "Ruth is stunned by the visitors at a porn star's wake; Nate has a strange first meeting with Brenda's brother Billy; and Keith takes issue with David's desire to replace his father as deacon at the family church.",
                        "air_date": "2001-07-01",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Room",
                        "overview": "An ornery widower camps out in the Fisher Funeral Home; sparks fly between Claire and Billy; Ruth spurns Hiram and is later wooed by a Russian florist; David is pursued by a pushy parishioner while performing charity work; and an examination of the business's receipts uncovers some interesting secrets.",
                        "air_date": "2001-07-08",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Brotherhood",
                        "overview": "When a young Army vet dies of Gulf War Syndrome, his brother opts for a cremation and disposal of the body; Ruth has Hiram over to cook dinner and then takes a job with Nikolai; David's church involvement results in his casting a very important vote; and Billy interferes with Nate and Brenda's vacation plans.",
                        "air_date": "2001-07-15",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Crossroads",
                        "overview": "In an effort to raise income, Nate and David decide to rent out a room in the funeral home; Claire struggles to grasp the lessons of her outreach hike in the mountains; Ruth attempts to reconcile her feelings about Hiram; Brenda's Aussie friend gets under Nate's skin; and David is buoyed by the news of extra funeral business.",
                        "air_date": "2001-07-22",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Life's Too Short",
                        "overview": "A tragedy reunites Claire with a guy who sullied her reputation at school; David and his new boyfriend run into Keith and his new partner on the disco circuit; and Ruth has an eye-opening camping trip with Hiram.",
                        "air_date": "2001-07-29",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The New Person",
                        "overview": "Nate and David hire an outspoken mortician; Billy's photo gallery exhibit features one particularly surprising shot; and Claire frets over Gabe's inconsistent behavior.",
                        "air_date": "2001-08-05",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Trip",
                        "overview": "Nate, David and Brenda take an interesting trip to Vegas for a funeral directors' conference; a baby's death from SIDS stuns the family; and Ruth takes a floral-arrangement class.",
                        "air_date": "2001-08-12",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "A Private Life",
                        "overview": "A gay man's murder forces David to confont his own fears about his lifestyle; Brenda's parents and Nate consider getting help for the increasingly troubled Billy...but Brenda isn't so sure that's the answer. Meanwhile, Ruth, Claire and David all share secrets with respective acquaintances.",
                        "air_date": "2001-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "Knock, Knock",
                        "overview": "The Fisher family experiences the control-freak side of Tracy Montrose Blaire; Brenda visits a remorseful Billy; David faces problems at his church; Gabe reverts to some bad habits; and Rico finds reason to celebrate.",
                        "air_date": "2001-08-19",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 2,
                "episode_count": 13,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "In the Game",
                        "overview": "A young actress's death prompts her castmates from a slasher film to pitch in for a cheap funeral at Fisher & Sons. Meanwhile, Ruth arranges a dinner for Nate, David and Claire--and their significant others--after reading a book for parents of gay and lesbian children.",
                        "air_date": "2002-03-03",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Out, Out Brief Candle",
                        "overview": "A college football player's death during practice bothers Nate, who earlier learned of his own potentially fatal condition. Meanwhile, Federico's request to borrow money from Nate and David is rejected, and he later learns of their newest purchase: a 'casket wall' display.",
                        "air_date": "2002-03-10",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Plan",
                        "overview": "The death of a psychic's husband sparks some interesting conversation around Fisher & Sons. Meanwhile, Ruth is changed after attending a lengthy self-actualization seminar; Claire is upset to discover that her guidance counselor has betrayed her confidence; and Brenda walks out on a college course she enrolled in.",
                        "air_date": "2002-03-17",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Driving Mr. Mossback",
                        "overview": "Nate brings Claire to his old stomping ground in Seattle to help him retrieve the body of a man who feared flying. There, they stay with Lisa, a woman who still carries a torch for Nate.",
                        "air_date": "2002-03-24",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Invisible Woman",
                        "overview": "Ruth takes a personal interest in the death of a woman who has no friends or relatives. Meanwhile, Brenda's search for a literary muse prompts her to turn to one of her massage clients--a prostitute named Melissa--and Nate's relationship with Brenda takes an unexpected turn.",
                        "air_date": "2002-03-31",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "In Place of Anger",
                        "overview": "Mitzi Huntley arrives back in Nate and David's lives thanks to a comparison-shopping widow. Meanwhile, Ruth's estranged sister Sarah arrives for an unexpected visit. Later, a vodka-fueled family dinner casts a pall over Nate and Brenda's happy news.",
                        "air_date": "2002-04-07",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Back to the Garden",
                        "overview": "A Jewish funeral at Fisher & Sons leads Nate to seek spiritual guidance from an intense female rabbi. Claire is surprised to meet a guy while visiting her Aunt Sarah. Meanwhile, a medical emergency prompts David to consider giving his relationship with Keith another shot. Federico's jealous suspicions about his cousin Ramon prove to be very misguided.",
                        "air_date": "2002-04-14",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "It's the Most Wonderful Time of the Year",
                        "overview": "The Christmas season marks the anniversary of Nathaniel's death...and gets everyone thinking about their last moments with him. Meanwhile, Nate and Brenda are shocked by Margaret Chenowith's Christmas Eve guest, Claire gets into a dangerous online relationship and Federico stirs up trouble in his own family.",
                        "air_date": "2002-04-21",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Someone Else's Eyes",
                        "overview": "Ruth continues to help an injured Nikolai recover, but her patience is tested when she discovers just how he broke his legs. Brenda's escapades help her to write, but her feelings about being engaged grow more muddled--especially after Billy's release from the hospital.",
                        "air_date": "2002-04-28",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Secret",
                        "overview": "David and Keith continue trying to iron out their problems...and Karla has a secret that isn't going to make things any better. Meanwhile, Claire takes a curious approach to photography, Ruth prepares to move ahead with Nikolai and Brenda's engagement anxiety leads her on a sexual adventure with Melissa.",
                        "air_date": "2002-05-05",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Liar and the Whore",
                        "overview": "Nate and Brenda find comfort thanks to Rabbi Ari's advice. Ruth's need to control the lives of Nikolai and Claire leads her to a surprising self-assessment. Federico's suspicions about an elderly woman's 'natural' death lead him to place Vanessa under scrutiny. A disgruntled former client files a lawsuit against Fisher & Sons.",
                        "air_date": "2002-05-12",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "I'll Take You",
                        "overview": "Claire seems to be finding some direction in her life, and a newly serious Billy is an unlikely choice to help her. Tensions between Nate and Brenda finally come to a head, while Keith has a problem that threatens everything he has worked towards in his relationship with David.",
                        "air_date": "2002-05-19",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Last Time",
                        "overview": "Fisher & Sons is the subject of an unannounced inspection, which proves surprisingly beneficial for Federico. Meanwhile, Claire's art-school interview takes an unexpected turn, and things grow tense between Keith and David. Also, Nate finds himself at a crossroads, both with Brenda and with his AVM.",
                        "air_date": "2002-06-02",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 3,
                "episode_count": 13,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Perfect Circles",
                        "overview": "Fisher & Sons has become Fisher & Diaz, and Rico is doing all he can to make sure he's not a 'gofer' anymore. Meanwhile, David and Keith decide to give couple's therapy a try, Claire skips art class to get to know a crematory worker named Phil; and Ruth goes overboard in her obsession with her granddaughter Maya.",
                        "air_date": "2003-03-02",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "You Never Know",
                        "overview": "David and Rico are at odds over doing business with the family of a deceased telemarketer, Claire finds she has more in common with a fellow art student named Russell than with Phil, and Ruth meets a new friend, Bettina. Meanwhile, David and Keith get a taste of a different kind of family life and Carol continues to make life miserable for Lisa.",
                        "air_date": "2003-03-09",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Eye Inside",
                        "overview": "Keith and David find the reality of a resort vacation different than advertised, Ruth learns the meaning of 'express checkout' during a shopping excursion with Bettina, and Claire gets a lesson in 'sick' art from a new teacher.",
                        "air_date": "2003-03-16",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Nobody Sleeps",
                        "overview": "While the partner of a recently deceased gay man is orchestrating an operatic tribute at Fisher & Diaz, Lisa plans an unwanted birthday party for Ruth. Meanwhile, Claire has a night to remember with Russell and two outlaw art teachers.",
                        "air_date": "2003-03-23",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Trap",
                        "overview": "Fisher & Diaz deal with the recently discovered body of a man missing for years. Meanwhile, Ruth sets the ground rules for a new live-in apprentice named Arthur, David meets an old acquaintance during an L.A. Gay Men's Chorus rehearsal, and Claire is surprised by her responsibilities as Olivier's new assistant.",
                        "air_date": "2003-03-30",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Making Love Work",
                        "overview": "A nosebleed proves deadly for one audience member queuing up to see the 'Dr. Dave' advice show. Meanwhile, Lisa takes Maya on an illuminating camping trip, and Rico wrestles with the challenges of a double-wide corpse and 'triple X' casket.",
                        "air_date": "2003-04-06",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "Timing & Space",
                        "overview": "A group of familiar relatives and friends is united in mourning. Meanwhile, David and Keith play 'Leading Ladies' at brunch with members of the Gay Men's Chorus, Ruth and Arthur perform a rendition of 'My Favorite Things,' and Rico grows increasingly concerned about Vanessa's 'intense energy.'",
                        "air_date": "2003-04-13",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Tears, Bones and Desire",
                        "overview": "After the patriarch of a cultish new-age clan dies, Fisher & Diaz is overrun by the wives and children left behind. Meanwhile, Keith gets back at David and his brunch pals during an intense game of paintball, Claire tires of being Olivier's lackey assistant, and Ruth and Arthur savor the smell of clean laundry.",
                        "air_date": "2003-04-20",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Opening",
                        "overview": "The Fishers run into some unexpected guests at an art-school benefit featuring works for sale by Claire, Russell and Olivier. Meanwhile, David and Keith have an awkward video-store meeting with Father Jack, then haggle over the 'rules' of three-way sex with a stranger.",
                        "air_date": "2003-04-27",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "Everyone Leaves",
                        "overview": "A bee sting during a family picnic ends a life. Nate tends to Maya while Lisa visits her sister in Santa Cruz. Meanwhile, Vanessa seems back to her old self, to Rico's relief; Russell's decision to share a secret with Claire backfires; Arthur wonders whether he should be mixing laundry with Ruth; and David gets a look at another dysfunctional family.",
                        "air_date": "2003-05-04",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Death Works Overtime",
                        "overview": "Fisher & Diaz is brimming over with activity after a trio of unrelated deaths. Meanwhile, Nate anxiously awaits Lisa's return from Santa Cruz; Vanessa and her sister Angelica enjoy a therapeutic shopping excursion, to Rico's chagrin; Claire grades herself in art school, then takes another important test; and Ruth cries all over a stranger's jacket.",
                        "air_date": "2003-05-11",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Twilight",
                        "overview": "After a serial killer is executed in Texas, his daughter brings him home for a fitting Fisher & Diaz funeral. Meanwhile, Ruth spends some quality time in the company of George Sibley; David arrives at a crossroads in his relationship with Keith; Rico can't find refuge from his domestic demons; and Nate and Claire get lost in their own separate twilights.",
                        "air_date": "2003-05-18",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "I'm Sorry, I'm Lost",
                        "overview": "Death continues to shuffle its deck randomly for would-be clients of Fisher & Diaz. Meanwhile, Nate looks to quell his inner demons through extreme remedies offered at a local bar--giving Claire way more baby-sitting action than she bargained for. Also, Ruth shakes up the family with some unexpected news.",
                        "air_date": "2003-06-01",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 4,
                "episode_count": 12,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Falling into Place",
                        "overview": "In an attempt to honor Lisa's last wishes, Nate finds himself at odds with her family. Meanwhile, David and Keith look for 'genuinely new' ways to start over; Federico seeks out a priest for absolution; Vanessa gets tired of Angelica; Brenda does 'the neighbor thing' with Joe; and Ruth sings the praises of her new husband George.",
                        "air_date": "2004-06-13",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "In Case of Rapture",
                        "overview": "George puts his stamp on the Fisher home. David cautions Nate about projecting his personal grief onto their clients; Keith applies for a glamorous new job; Joe challenges the logic of Brenda's 12-step plan; Claire reawakens her artistic muse after meeting a free spirit named Edie; and Federico proves that charity doesn't always begin at home.",
                        "air_date": "2004-06-20",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Parallel Play",
                        "overview": "A group of prank-happy teenagers find their latest joke is no laughing matter. Meanwhile, the Fishers decide to hold a yard sale; David grooms Arthur for a new role; Nate gets intimately involved in Maya's afternoon playgroup; Claire attends an art party; Ruth and George receive some unwanted wedding gifts; Federico gets caught up in family responsibilities; Keith adjusts to the peculiarities of his new job; Joe isn't thrilled by Brenda's yearning for normalcy; and some important memories go up in smoke.",
                        "air_date": "2004-06-27",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Can I Come Up Now?",
                        "overview": "David's ex-fiancee re-enters his life in search of answers to the question, 'Why me?' Meanwhile, Nate has a psychic rendezvous, Keith's new job sends him into the closet, Federico identifies with David's past, Claire decides not to let life pass her by, George dumps some surprise baggage on Ruth, and Margaret weighs in on daughter Brenda's new relationship.",
                        "air_date": "2004-07-11",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "That's My Dog",
                        "overview": "With Keith out of town on business, David gets taken for a ride by a hitchhiker. Meanwhile, Nate feels out of place in a bereavement group, Ruth tries to play matchmaker--to George's chagrin, Claire feels empty after a critique of her self-portraits, Brenda and her mom go back to school, and Federico gets an unexpected visitor at work.",
                        "air_date": "2004-07-18",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Terror Starts At Home",
                        "overview": "Fisher & Diaz hosts two very different parties in one night. Meanwhile, David is uncomfortable with all the comfort he's receiving; Nate finds temporary relief at a 'canine retreat,' Claire and her art-school friends go on a trip, Ruth grows frustrated with George's \"nasty little secrets\" and Federico gets his phone wires crossed.",
                        "air_date": "2004-07-25",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Dare",
                        "overview": "Ruth goes on a fossil hunt with George, and digs up Sarah and Bettina. Claire focuses her talents on Edie; Federico tries to unload on Sophia; Vanessa does some part-time detective work; Keith goes 'out' to a bar with his co-workers; David drowns his stress; Nate dares Brenda to be honest with Joe, and receives some relationship advice himself.",
                        "air_date": "2004-08-01",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Coming and Going",
                        "overview": "Nate and Brenda take Maya on a train ride, getting caught in their tracks when they go a little too far. Meanwhile, David tries to 'sex-orcise' his demons; Keith straightens out a conflict of interest; Federico starts sleeping on the job; Ruth schools George when he treads on her garden; Vanessa and Angelica take some female matters into their own hands; and Claire enjoys 'dancing' with Edie--as a spectator sport.",
                        "air_date": "2004-08-08",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Grinding the Corn",
                        "overview": "Ruth and Bettina take a road trip to Mexico, leaving the men of Fisher & Diaz to some male bonding--and comic-book crime-fighting. David and Keith open up after closing their 'open' relationship; Claire warms up to Jimmy after getting the cold shoulder from Edie and Anita; Billy resurfaces as a substitute art teacher; and Nate can't decide what he wants from Brenda, who turns to old friends to treat the pain.",
                        "air_date": "2004-08-15",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Black Forest",
                        "overview": "Nate gives Maya 'one last look' at a memorial for Lisa, where some surprise discoveries ensue. David and Keith are inspired by a same-sex wedding; George agrees to Ruth's marriage stipulations; Federico is disturbed by the 'new and improved' Vanessa; Brenda crosses a bridge with her therapy client; and Claire and Billy develop something in the darkroom.",
                        "air_date": "2004-08-22",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Bomb Shelter",
                        "overview": "Ruth is giddy about going to a tantric workshop with George, who retreats to the family's emergency shelter. Meanwhile, David's last bite at a sushi restaurant threatens to cost him--and Keith--a lot more than the bill; Nate drops a bomb on Barb, which sparks a counterattack; Claire fights Russell over credit for her latest photos; Margaret's hospital stay helps Brenda and Billy begin to heal their rift; and Vanessa shows she can beat Federico at his own game.",
                        "air_date": "2004-08-29",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Untitled",
                        "overview": "Ruth is delighted to meet George's daughter, but worries as his paranoid 'views' of the future escalate. 'Star' Claire gets high off her newfound fame; Federico pleads his case to Vanessa, who delivers a verdict; David confronts a demon face-to-face; Keith considers a business proposal; and Nate comes to final blows with Barb and Hoyt.",
                        "air_date": "2004-09-12",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 5,
                "episode_count": 12,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "A Coat of White Primer",
                        "overview": "Ruth dreads George's return from the hospital in light of his recent diagnosis; Nate and Brenda prep for a big day, but an emergency makes them reconsider; David and Keith discuss alternative parenting options; Rico tries internet dating; and Claire enjoys domestic bliss but crosses a line with her camera.",
                        "air_date": "2005-06-06",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Dancing for Me",
                        "overview": "Nate hangs with some high-school friends but finds that, as adults, they share little more than teenage memories; Ruth gets relief from George's daughter Maggie; Brenda is reluctant to accept Margaret's help and struggles in her new internship; David and Keith's latest baby dream starts to resemble a nightmare; Claire bemoans being pigeonholed by her art; Billy defends his career but secretly wonders what happened to his old self; and Rico, mortified that he couldn't take a dating hint, seeks sympathy from Vanessa.",
                        "air_date": "2005-06-13",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Hold My Hand",
                        "overview": "Claire is seduced by Billy's lust for life but hits a roadblock trying to fund the next leg of her educational journey; George is haunted by visions of an early trauma; Brenda feels at home with her new supervisor Jackie; David and Keith meet a fertile young woman named Mary; Vanessa encourages Rico to mingle, so he does--at a funeral directors' conference.",
                        "air_date": "2005-06-20",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Time Flies",
                        "overview": "Brenda is disturbed by Nate's reaction to her latest news; Ruth shares her feelings about George with her knitting circle; David and Keith 'propose' to Mary and meet Roger's equally unconventional family; Rico is shocked at how Vanessa and the boys are doing; frustrated, George shares a beer and a song with Billy; and Nate comes home to an unpleasant surprise.",
                        "air_date": "2005-06-27",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Eat a Peach",
                        "overview": "Nate and Brenda discuss giving Maya a 'coherent narrative'; David and Keith await news from Mary, and meet a special little boy; Vanessa is shocked when Julio gets into trouble at school--and mortified when Rico schmoozes things over; Billy invites Claire to dinner, but has no appetite; Margaret helps stage an ambush; and Maggie brings George to a tense meal.",
                        "air_date": "2005-07-04",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Rainbow of Her Reasons",
                        "overview": "Ruth happily helps 'circle the wagons' when Sarah calls; David and Keith discover it's hard work playing house with Anthony and his brother Durrell; Nate muses on the loss of his first love; Claire finds a temporary financial solution; Vanessa hires a nanny with unexpected talents; Rico gets an offer he can't believe--or refuse.",
                        "air_date": "2005-07-10",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Silence",
                        "overview": "David and Keith struggle to create parent-child boundaries; When Brenda and Nate get some ambiguous news, it confirms their views on life and death; Ruth fills her schedule with activities, but has trouble unwinding; Claire meets an interesting guy at work, and makes an effort to fit in; Margaret lets a cat out of the bag; and George drops a bomb on Ruth.",
                        "air_date": "2005-07-18",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "Singing for Our Lives",
                        "overview": "A young Latina's funeral raises questions about the culture--and future--of Fisher and Diaz. Meanwhile, David and Keith are upset when they're not in the driver's seat; Claire takes her co-worker Ted to an art school show; Brenda gets vital info from her doctor--and from Jackie; and Ruth goes out for some pampering and gets more than she paid for.",
                        "air_date": "2005-07-25",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "Ecotone",
                        "overview": "David and Keith get comfortable with their new family life; Claire is shocked to discover she and Ted share a passion for politics; Ruth finds empowerment in the woods; Maggie is forced to make a series of awkward calls; Brenda faces several truths at once; Rico finally 'gets' Vanessa; and Nate brings the family together against their will.",
                        "air_date": "2005-07-31",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "All Alone",
                        "overview": "While David attends to family business, Keith makes an embarrassing self-discovery on the job; Brenda is challenged by Nate and answers a hard question for Maya; Margaret compares herself to her daughter; Ruth lets Bettina play nurse; Rico and Vanessa decide to protect their future; Claire is comforted by Ted's squareness; and George makes a speech about love.",
                        "air_date": "2005-08-07",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "Static",
                        "overview": "As David's fears take over, Keith tries to protect him--and the boys; Billy attends to his sister; Claire goes on a drunken harassment spree and pushes Ted away; Rico pushes for a talk about the business; George tries to help Ruth with Maya; Nate urges Brenda to embrace a taboo; and Vanessa sees the future in a funeral home.",
                        "air_date": "2005-08-14",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "Everyone's Waiting",
                        "overview": "David finally embraces a demon; Keith gives 'tough love'; Nathaniel talks to his younger son; Brenda delivers and fights Nate's negativity; Claire gets an exciting call; Ted inspires sexy photos; Margaret is impressed to see Olivier's nurturing side; George's limitations eclipse his intentions; and Claire drives into her future.",
                        "air_date": "2005-08-21",
                        "watched": false
                    }
                ]
            }
        ]
    },
    {
        "title": "The IT Crowd",
        "status": "watched",
        "rating": 4,
        "overview": "Two I.T. nerds and their clueless female manager, who work in the basement of a very successful company. When they are called on for help, they are never treated with any respect at all.",
        "poster": "https://image.tmdb.org/t/p/w500/qZXkBoOUYzvKI4UCMzDQ5kqWHjh.jpg",
        "year": "2006",
        "tmdb_rating": 8.2,
        "seasons": [
            {
                "season_number": 1,
                "episode_count": 6,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Yesterday's Jam",
                        "overview": "It's Jen's first day at Reynholm Industries and she is assigned the position of manager of the IT department. Roy and Moss quickly find out that she has absolutely no knowledge of computers whatsoever.",
                        "air_date": "2006-02-03",
                        "watched": true
                    },
                    {
                        "episode_number": 2,
                        "name": "Calamity Jen",
                        "overview": "Denholm tries to reduce stress in the work place and invites a stress expert to give the employees a class about dealing with stress. Meanwhile, Jen buys new shoes that are a few sizes too small, which leads to a very painful result.",
                        "air_date": "2006-02-03",
                        "watched": true
                    },
                    {
                        "episode_number": 3,
                        "name": "Fifty-Fifty",
                        "overview": "Moss and Roy go on a lonely hearts website. Meanwhile Jen meets the man of her dreams.",
                        "air_date": "2006-02-10",
                        "watched": true
                    },
                    {
                        "episode_number": 4,
                        "name": "The Red Door",
                        "overview": "After being told that she can never open the red door, Jen finds a way to find out what the mystery is all about.",
                        "air_date": "2006-02-17",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Haunting of Bill Crouse",
                        "overview": "When her date Bill turns out to be a jerk, Jen asks Moss to send him away if he stops by. When he does and Moss can't convince him to leave, Moss has to lie and ends up telling Bill that Jen is dead.",
                        "air_date": "2006-02-24",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Aunt Irma Visits",
                        "overview": "Roy and Moss get the same symptoms as Jen when it's her time of the month.",
                        "air_date": "2006-03-03",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 2,
                "episode_count": 6,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Work Outing",
                        "overview": "Jen is asked out on a date by Philip and Roy and Moss decide to tag along which ruins any chance of romance Jen was hoping for.",
                        "air_date": "2007-08-24",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Return of the Golden Child",
                        "overview": "Moss decides to try and work out exactly when Roy will die by using a website on the Internet that calulates time of death based on the answers given to certain questions. Roy doesn't want to know anything about it, but Moss spills it anyway, making Roy very nervous.",
                        "air_date": "2007-08-31",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Moss and the German",
                        "overview": "Moss decides to sign himself up for a German cookery course, but due to a slight miscommunication between Moss and the advertiser, it turns out to be something else entirely.  Roy tries to see a film before someone can spoil the ending for him.  Jen finds out smoking is not as glamorous as she used to think.",
                        "air_date": "2007-09-07",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Dinner Party",
                        "overview": "Jen's attempt to throw a successful dinner party don't go exactly the way she was hoping. The evening isn't a total disaster for everyone, though, as Richmond meets the woman of his dreams.",
                        "air_date": "2007-09-14",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Smoke and Mirrors",
                        "overview": "When Jen complains about her bad bra, Moss attempts to create the world's most perfect bra. When he succeeds, he attempts to get onto the BBC show Dragon's Den to demonstrate it, which turns out a bit awkward.",
                        "air_date": "2007-09-21",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Men Without Women",
                        "overview": "After making several unsuccessful advances, Douglas offers Jen the job as his new PA in order to get even closer to her. This way he hopes to slip a potion in her tea, that he obtained from a sorcerer and which should make Douglas irresistable to Jen.",
                        "air_date": "2007-09-28",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 3,
                "episode_count": 6,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "From Hell",
                        "overview": "Douglas's neglegance in running the company nearly ruins Reynholm Industries. Meanwhile, Jen has a builder over at her house to do some renovations. When Roy seems to remember the guy from being on a TV show \"Builders from hell\", Jen gets a bit nervous.",
                        "air_date": "2008-11-21",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "Are We Not Men?",
                        "overview": "Roy and Moss try to meet new friends by getting familiar with the latest football news and slang. They meet new, yet peculiar friends. Meanwhile, Jen dates a guy who looks like a magician.",
                        "air_date": "2008-11-28",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Tramps Like Us",
                        "overview": "When a sexual harassment case ends with a low pay out, Jen, Roy and Moss find themselves all moving in different directions. ",
                        "air_date": "2008-12-05",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Speech",
                        "overview": "Jen makes enemies of Roy and Moss after trying to assert herself more after being named as Employee of the Month. Douglas discovers that the woman who he loves is not quite as she seems.",
                        "air_date": "2008-12-12",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Friendface",
                        "overview": "The boys are introduced to a social networking website by Jen.  Through the site they get in touch with old acquaintances to which they brag a little bit too much, which leads to awkward situations.",
                        "air_date": "2008-12-19",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Calendar Geeks",
                        "overview": "To raise money for charity, the girls of the 7th floor come up with the idea to do a nude calendar. Roy -who happens to be there to fix a computer- gets excited when the girls ask him to do the photography. Jen doesn't like the idea so much and comes up with an alternative.",
                        "air_date": "2008-12-26",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 4,
                "episode_count": 6,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Jen the Fredo",
                        "overview": "Jen decides she wants to stretch herself more at work and applies for the post of Entertainment Manager. After discovering that her boss Douglas's business connections have wilder tastes than she planned for, she ends up turning to Moss and Roy for help.",
                        "air_date": "2010-06-25",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Final Countdown",
                        "overview": "Moss ends up becoming a celebrity after he beats all the records on a popular daytime quiz show. Roy tries to explain to an old mate after being mistaken for a window cleaner. Jen finds herself pre-occupied with Douglas' secret head of department meetings.",
                        "air_date": "2010-07-02",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "Something Happened",
                        "overview": "Douglas finds himself becoming a Spaceologist. Some bad luck changes Roy's life. Jen ends up getting involved with a rock band.",
                        "air_date": "2010-07-09",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Italian for Beginners",
                        "overview": "Roy gets obsessed by his latest girlfriend's sad family history, while Jen tells an absolute whopper to get some attention.",
                        "air_date": "2010-07-16",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "Bad Boys",
                        "overview": "When Roy and Moss become juvenile delinquents for the day they end up having an uncomfortable experience at a local shopping centre.",
                        "air_date": "2010-07-23",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "Reynholm vs Reynholm",
                        "overview": "Douglas discovers that marriage agrees with him for all of a fortnight. He then finds himself in court defending himself with Jen, Roy and Moss' help.",
                        "air_date": "2010-07-30",
                        "watched": false
                    }
                ]
            }
        ]
    },
    {
        "title": "Friends",
        "status": "watched",
        "rating": 0,
        "overview": "Six young people from New York City, on their own and struggling to survive in the real world, find the companionship, comfort and support they get from each other to be the perfect antidote to the pressures of life.",
        "poster": "https://image.tmdb.org/t/p/w500/2koX1xLkpTQM4IZebYvKysFW1Nh.jpg",
        "year": "1994",
        "tmdb_rating": 8.4,
        "seasons": [
            {
                "season_number": 1,
                "episode_count": 24,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "Pilot",
                        "overview": "An introduction to the gang. After Rachel leaves her fiancé at the altar, she moves in with Monica and finds that independence is not so easy, particularly without Daddy's credit cards.",
                        "air_date": "1994-09-22",
                        "watched": true
                    },
                    {
                        "episode_number": 2,
                        "name": "The One with the Sonogram at the End",
                        "overview": "Ross's lesbian ex-wife, Carol, is pregnant with his child, and he doesn't like her choice of last name for the baby. Rachel finds out that her ex-fiancé went on what would have been their honeymoon with her maid of honor.",
                        "air_date": "1994-09-29",
                        "watched": true
                    },
                    {
                        "episode_number": 3,
                        "name": "The One with the Thumb",
                        "overview": "Monica finds it difficult to break up with her latest boyfriend whom everyone likes; Chandler is reunited with his beloved cigarettes; Phoebe receives a large sum of money.",
                        "air_date": "1994-10-06",
                        "watched": true
                    },
                    {
                        "episode_number": 4,
                        "name": "The One with George Stephanopoulos",
                        "overview": "While the men attend a hockey game and end up at a hospital, a delivery man accidentally brings a pizza meant for George Stephanopoulos, who lives across the street from the girls; they decide to peek at the former White House advisor with their binoculars.",
                        "air_date": "1994-10-13",
                        "watched": true
                    },
                    {
                        "episode_number": 5,
                        "name": "The One with the East German Laundry Detergent",
                        "overview": "While Chandler and Phoebe decide to break up with their significant others on the same night, Ross helps Rachel do laundry and considers the evening a first date. Joey has Monica pose as his new girlfriend, because he wants to get back with the girl he just dumped.",
                        "air_date": "1994-10-20",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The One with the Butt",
                        "overview": "Joey gets his big film break when he's hired to be Al Pacino's stunt butt. Ross tries to be less conservative and Chandler thinks his fantasies have come true when he has an affair with a married woman.",
                        "air_date": "1994-10-27",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The One with the Blackout",
                        "overview": "A power outage leaves Chandler stranded in an ATM vestibule with Victoria's Secret model Jill Goodacre, whom he desperately tries to impress, Ross tries to ask Rachel out on a date, and Joey learns that Monica used to be infatuated with him.",
                        "air_date": "1994-11-03",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The One Where Nana Dies Twice",
                        "overview": "Monica and Ross mourn the death of their grandmother with a little help from the gang, and Monica and her mom come to an unspoken understanding about the relationship between mothers and daughters. Meanwhile, Chandler is irritated by office speculation that he is gay.",
                        "air_date": "1994-11-10",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The One Where Underdog Gets Away",
                        "overview": "Monica's first Thanksgiving dinner for the gang goes horribly wrong when they all run to the rooftop to see the runaway Underdog balloon from the parade.",
                        "air_date": "1994-11-17",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The One with the Monkey",
                        "overview": "The gang makes--then breaks--a pact to celebrate New Year's Eve without dates. Ross compensates for his loneliness by getting a roommate, a monkey named Marcel.",
                        "air_date": "1994-12-15",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The One with Mrs. Bing",
                        "overview": "Chandler's romance-novelist mother comes to New York to visit him, and Joey catches her and Ross kissing.",
                        "air_date": "1995-01-05",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The One with the Dozen Lasagnas",
                        "overview": "Everyone knows the sex of Ross's baby, except for Ross, who doesn't want to find out until it's born. Monica gives Paolo one of the dozen lasagnas she made for her aunt, who doesn't want them anymore because they've got meat in them.",
                        "air_date": "1995-01-12",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The One with the Boobies",
                        "overview": "Chandler accidentally sees Rachel wandering around topless after her shower, so Rachel tries to even the score. And no one can stand Phoebe's new boyfriend, an irritating guy named Roger.",
                        "air_date": "1995-01-19",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The One with the Candy Hearts",
                        "overview": "Ross's first date in nine years is on Valentine's Day with a beautiful neighbor. Susan and Carol, also out on a romantic date; end up at the same restaurant. Joey sets Chandler up on a blind date. And Phoebe, Rachel and Monica decide to spend the holiday building a boyfriend bonfire in their apartment.",
                        "air_date": "1995-02-09",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The One with the Stoned Guy",
                        "overview": "Monica cooks a gourmet meal for a restaurateur looking for a new chef but, unfortunately, he's stoned. After working as a data processing permanent temp for five years, Chandler gets promoted. And Ross has a date with a beautiful colleague.",
                        "air_date": "1995-02-16",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The One with Two Parts (1)",
                        "overview": "Joey falls for Phoebe's twin sister, Ursula, making Phoebe feel neglected. Ross has doubts about parenthood when he attends Lamaze classes with Carol and Susan. Meanwhile, Chandler finds himself between a rock and a hard place, when he is told to fire an employee he is attracted to.",
                        "air_date": "1995-02-23",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The One with Two Parts (2)",
                        "overview": "When Rachel sprains her ankle and has no insurance, she cajoles Monica into trading identities so she can use Monica's coverage. When Phoebe's twin sister, Ursula, breaks Joey's heart, Phoebe tries to fix it.",
                        "air_date": "1995-02-23",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The One with All the Poker",
                        "overview": "Tired of being referred to by customers as \"Excuse me\" Rachel interviews for a job as an assistant buyer at Saks Fifth Avenue. She also sees another side of the usually docile Ross when the girls face the boys during a not-so-friendly game of poker.",
                        "air_date": "1995-03-02",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The One Where the Monkey Gets Away",
                        "overview": "The gang searches frantically for Marcel, who slipped out of the apartment while Rachel was baby-sitting him. Just as it looks as though Rachel and Ross might actually spend a romantic evening together, her ex-fiancé barges in and declares his love for her.",
                        "air_date": "1995-03-09",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The One with the Evil Orthodontist",
                        "overview": "Rachel and Barry start dating again, which is kind of awkward since he's now engaged to Mindy, who wants Rachel to be her maid of honor. Meanwhile, Chandler goes nuts when a woman he likes won't return his phone calls.",
                        "air_date": "1995-04-06",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The One with the Fake Monica",
                        "overview": "When Monica's credit card is stolen, she, along with Phoebe and Rachel, decide to catch the thief. Joey enlists his friends to help him come up with a less ethnic-sounding stage name. And  Ross finds out that Marcel has reached sexual maturity and needs to be with other monkeys.",
                        "air_date": "1995-04-27",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The One with the Ick Factor",
                        "overview": "After losing his virginity to her, Monica's boyfriend reveals that he's a high school senior. When Phoebe temps as Chandler's secretary, she finds out a secret.",
                        "air_date": "1995-05-04",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The One with the Birth",
                        "overview": "As Monica's biological clock ticks away like a time bomb, Carol goes into labor. Ross, Susan and Phoebe end up getting locked in a closet just as Carol's about to give birth to the baby. And Rachel flirts with an OB/GYN.",
                        "air_date": "1995-05-11",
                        "watched": false
                    },
                    {
                        "episode_number": 24,
                        "name": "The One Where Rachel Finds Out",
                        "overview": "Joey's new girlfriend wants to go to bed with him but he can't, yet. During Rachel's birthday party, Chandler accidentally lets it slip that Ross is in love with her. However, Ross is on his way to China and Rachel can't decide whether she wants to be more than friends with Ross.",
                        "air_date": "1995-05-18",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 2,
                "episode_count": 24,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The One with Ross's New Girlfriend",
                        "overview": "Rachel waits patiently at the airport for Ross, returning from China. Meanwhile, after giving Joey and Chandler new haircuts, Phoebe is persuaded to cut Monica's hair. And Joey learns that his tailor is a very naughty man.",
                        "air_date": "1995-09-21",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The One with the Breast Milk",
                        "overview": "The guys are uncomfortable with the thought of Carol's breast milk while Rachel is upset by Monica's growing friendship with Julie. Meanwhile, Joey competes with a fellow cologne spritzer for the affections of a beautiful colleague.",
                        "air_date": "1995-09-28",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The One Where Heckles Dies",
                        "overview": "After Mr. Heckles dies and leaves all his belongings to Monica and Rachel, Chandler discovers eerie similarities between the late eccentric man and his own life. Ross and Phoebe have a dispute over the progression of evolution.",
                        "air_date": "1995-10-05",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The One with Phoebe's Husband",
                        "overview": "The gang is amazed to learn that Phoebe married a gay Canadian ice dancer to help him get his green card. And Ross seeks relationship advice from Rachel.",
                        "air_date": "1995-10-12",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The One with Five Steaks and an Eggplant",
                        "overview": "When a sexy woman calls the wrong number, Chandler seeks to make the most of the situation. Income issues divide the friends; Monica, Ross and Chandler have money, while Phoebe, Rachel and Joey don't.",
                        "air_date": "1995-10-19",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The One with the Baby on the Bus",
                        "overview": "Chandler and Joey lose Ross's son, Ben, while checking out women on a bus. Phoebe loses her Central Perk singing gig to a professional singer. And Ross has an allergic reaction to Monica's kiwi-lime pie.",
                        "air_date": "1995-11-02",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The One Where Ross Finds Out",
                        "overview": "A drunken Rachel is persuaded to call Ross and reveal her feelings for him on his answering machine. Now, Ross must make a decision between her and Julie. Meanwhile, Monica finds work as Chandler's personal trainer and Phoebe has a hard time trying to get her boyfriend to have sex with her.",
                        "air_date": "1995-11-09",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The One with the List",
                        "overview": "Ross enlists Joey and Chandler to help with his decision to choose Julie or Rachel by making a list of the pros and cons of each. Big mistake. Meanwhile, Monica gets a job making food with a synthetic chocolate substitute called Mockolate.",
                        "air_date": "1995-11-16",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The One with Phoebe's Dad",
                        "overview": "It's Christmas time and Monica tries tipping with cookies, rather than cash, with mixed results. Phoebe tries to track down her real father. And Chandler and Joey wait too late to shop for presents.",
                        "air_date": "1995-12-14",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The One with Russ",
                        "overview": "Monica gets back together with Fun Bobby. Joey lands a role of a neurosurgeon on Days of Our Lives. And Rachel, dating a guy named Russ, can't see his uncanny resemblance to Ross.",
                        "air_date": "1996-01-04",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The One with the Lesbian Wedding",
                        "overview": "Monica caters the wedding of Ross's ex-wife and her lesbian lover. Phoebe is possessed by the spirit of an 82-year-old massage client who dies in the middle of a session. And Rachel's mom comes to visit and drops a bombshell.",
                        "air_date": "1996-01-18",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The One After the Super Bowl (1)",
                        "overview": "Ross goes to visit Marcel, his monkey, while on a trip to California. Joey gets his first fan letter and ends up dating the woman. Phoebe is asked to sing for the children at the library, but their parents are horrified by her lyrics.",
                        "air_date": "1996-01-28",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The One After the Super Bowl (2)",
                        "overview": "Rachel and Monica compete for the affections of Jean-Claude Van Damme after meeting him on a movie set. Chandler meets a former schoolmate while an excited Joey gets a role as an extra in the movie. Ross and Marcel go on a whirlwind tour of the city.",
                        "air_date": "1996-01-28",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The One with the Prom Video",
                        "overview": "After getting his big break, with Days of Our Lives, Joey pays Chandler back. Monica is unemployed and hard up for money. Monica and Rachel's prom video reveals Monica's former girth, Rachel's former nose and the way Ross has always felt about Rachel.",
                        "air_date": "1996-02-01",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The One Where Ross and Rachel... You Know",
                        "overview": "Joey buys a big screen TV and two leather recliners with his newfound money. Monica has a catering job for one of her parents' friends and becomes infatuated. Ross and Rachel attempt to have their first real date, but Rachel laughs every time they kiss. When they try again the next evening, they are interrupted when Ross is called into the museum.",
                        "air_date": "1996-02-08",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The One Where Joey Moves Out",
                        "overview": "After having a fight with Chandler, Joey decides to move out. Rachel and Phoebe decide to get tattoos. And, on his birthday, Mr. Geller receives the unsettling news that his best friend and his daughter are dating.",
                        "air_date": "1996-02-15",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The One Where Eddie Moves In",
                        "overview": "Phoebe is discovered by a record producer who wants to make \"Smelly Cat\" a video. Ross's new relationship with Rachel makes Monica feel like she's living with her brother again... and she hates it.  And Joey considers moving back in with Chandler, but Chandler has a new roommate.",
                        "air_date": "1996-02-22",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The One Where Dr. Ramoray Dies",
                        "overview": "Chandler learns more about his new roommate, Eddie. Ross is stressed out to learn that Rachel had 'animal sex' with Paolo. Richard and Monica are uncomfortable to learn what their numbers of ex-lovers are. Joey's remarks to a fan magazine could cause him to lose his job playing Dr Ramoray.",
                        "air_date": "1996-03-21",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The One Where Eddie Won't Go",
                        "overview": "Creeped out by his bizarre new roommate, Chandler demands he move out; Eddie agrees... but won't go. Joey has trouble coming to grips with the death of Dr. Drake Ramoray and is facing some exorbitant bills. And a new book on women's empowerment inspires the ladies to have a \"goddess meeting.\"",
                        "air_date": "1996-03-28",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The One Where Old Yeller Dies",
                        "overview": "Monica's new boyfriend impresses Chandler and Joey. Phoebe's world view is shattered when she finds out what she missed as a child, and Rachel resents the fact that Ross has planned their whole life together.",
                        "air_date": "1996-04-04",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The One with the Bullies",
                        "overview": "Monica is broke and decides to gamble on the stock market, while Chandler and Ross run into a couple of bullies in Central Park. Rachel and Joey help Phoebe locate her father, but a vicious dog prevents Phoebe from finally meeting him.",
                        "air_date": "1996-04-25",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The One with the Two Parties",
                        "overview": "Monica decides to hold a surprise birthday for Rachel, but everything goes wrong when Rachel's estranged parents turn up unexpectedly. The party then splits into two factions, but complications inevitably ensue.",
                        "air_date": "1996-05-02",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The One with the Chicken Pox",
                        "overview": "Phoebe's submariner ex-boyfriend visits New York on leave for 2 weeks from the Navy. Unfortunately, Phoebe catches chicken pox at Ben's first birthday party. When Monica realizes that Richard has no real neuroses, she worries that she is too strange for him. Chandler organizes a job as a processor for Joey.",
                        "air_date": "1996-05-09",
                        "watched": false
                    },
                    {
                        "episode_number": 24,
                        "name": "The One with Barry and Mindy's Wedding",
                        "overview": "Rachel agrees to be maid of honor at her ex-fiancé's wedding; she relives the nightmare of her own failed wedding day. Meanwhile, Chandler becomes enamored with a woman he meets on the Internet, but is surprised when he finally meets her. Monica ponders her future with Richard.",
                        "air_date": "1996-05-16",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 3,
                "episode_count": 25,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The One with the Princess Leia Fantasy",
                        "overview": "Ross reveals a fantasy to Rachel involving a certain \"Star Wars\" character. Monica suffers from insomnia after her breakup with Richard. And Chandler, back together with Janice, wants Joey to bond with her.",
                        "air_date": "1996-09-16",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The One Where No One's Ready",
                        "overview": "In a race against the clock, a stressed Ross tries to get the gang dressed and ready for a black-tie benefit at the museum while Joey and Chandler clash over personal belongings and personal space.",
                        "air_date": "1996-09-26",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The One with the Jam",
                        "overview": "Phoebe dates a man who thinks he's stalking her twin sister. Ross and Rachel give Chandler \"boyfriend\" lessons. Monica decides the best way to get over Richard is to keep herself busy, so she uses her free time to make jam and considers insemination via a sperm bank.",
                        "air_date": "1996-10-03",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The One with the Metaphorical Tunnel",
                        "overview": "Phoebe poses as Joey's agent and has some success in getting him auditions. Ross panics when he sees his son with a Barbie doll. Chandler is advancing in his relationship with Janice and, realizing that he has a fear of commitment, goes to the girls for advice.",
                        "air_date": "1996-10-10",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The One with Frank, Jr.",
                        "overview": "Phoebe's half-brother visits, but they have trouble bonding. Joey attempts to build an entertainment center. Ross is challenged to name the five celebrities he'd like to sleep with most.",
                        "air_date": "1996-10-17",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The One with the Flashback",
                        "overview": "When Janice asks the gang if any of them have ever slept together, the friends flash back to a time three years before.",
                        "air_date": "1996-10-31",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The One with the Race Car Bed",
                        "overview": "Monica buys a new bed from Janice's soon-to-be-ex-husband, \"The Mattress King\", but the wrong one is delivered.  Rachel's attempts to have her father and Ross bond fail, until she stops trying. Joey gets a job teaching a soap opera acting class.",
                        "air_date": "1996-11-07",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The One with the Giant Poking Device",
                        "overview": "When Phoebe believes she's killed the ugly naked guy across the street from Rachel and Monica, Joey constructs a long poking device. Joey and Monica catch Janice kissing her ex-husband; Chandler confronts Janice.",
                        "air_date": "1996-11-14",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The One with the Football",
                        "overview": "Emotions become the feast of the day when the gang plays a game of touch football on Thanksgiving. Joey and Chandler argue over who gets to date a model while Ross and Monica argue over winning in a case of sibling rivalry. [Thanksgiving Episode]",
                        "air_date": "1996-11-21",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The One Where Rachel Quits",
                        "overview": "Rachel makes a rash decision after Gunther tells her she needs to be retrained.  Phoebe tries to help Joey when he gets a job selling Christmas trees.  And Ross accidentally breaks a girl's leg and tries to make it up to her.",
                        "air_date": "1996-12-12",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The One Where Chandler Can't Remember Which Sister",
                        "overview": "Ross is suspicious about Rachel's possible job offer from a good-looking stranger.  And a drunken Chandler fools around with one of Joey's sisters, but he can't remember which one.",
                        "air_date": "1997-01-09",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The One with All the Jealousy",
                        "overview": "Ross becomes increasingly jealous of Rachel's new colleague, Mark, and spies on her. Monica hooks up with a co-worker, who writes her a poem with a hidden meaning. One of Joey's numerous lies on his resume is exposed when he takes part in a Broadway musical.",
                        "air_date": "1997-01-16",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The One Where Monica and Richard Are Just Friends",
                        "overview": "Monica's willpower is tested when she runs into Richard at the video store. Rachel agrees to read The Shining if Joey reads Little Women. Phoebe's athletic date has a problem with short shorts.",
                        "air_date": "1997-01-30",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The One with Phoebe's Ex-Partner",
                        "overview": "Phoebe is reunited with her former singing partner who thinks \"Smelly Cat\" has hit potential; Chandler dates a woman with a prosthetic leg who also has some history with Joey. Meanwhile, Ross goes to a fashion seminar with Rachel, so she won't go with Mark, but falls asleep in the middle of it.",
                        "air_date": "1997-02-06",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The One Where Ross and Rachel Take a Break",
                        "overview": "Wanting more time to focus on her new job, Rachel suggests that she and Ross take a break from their relationship. Ross later seeks solace at a party. Phoebe dates a diplomat who needs an interpreter to communicate with her. Chandler and Joey ponder a ménage a trois with a woman who seems hot for both of them. [First part of a 2-part episode]",
                        "air_date": "1997-02-13",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The One with the Morning After",
                        "overview": "Ross tries to prevent Rachel from learning his disturbing secret. She finds out anyway and they go back to her apartment to have a fight. The other four friends are trapped in Monica's bedroom, forced to listen in.",
                        "air_date": "1997-02-20",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The One Without the Ski Trip",
                        "overview": "Ross and Rachel compete to spend time with their other friends. When a lonely Ross is excluded from Rachel's ski trip with her pals, he visits Carol. On the way to the cabin, they run out of gas. Meanwhile, Chandler starts smoking again.",
                        "air_date": "1997-03-06",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The One with the Hypnosis Tape",
                        "overview": "Monica receives a tip from an admirer worth a small fortune then goes out with the guy. A hypnosis tape intended to assist Chandler to stop smoking has a rather strange side effect. Phoebe is upset when her 18-year-old half-brother, Frank Jr., makes a surprise announcement that he is getting married - to a woman more than twice his age.",
                        "air_date": "1997-03-13",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The One with the Tiny T-Shirt",
                        "overview": "Rachel goes on her first date after splitting from Ross...and it's with Mark, her former colleague. Joey is cast in a play and develops a crush on his costar. Monica continues to date Pete, even though she is still not attracted to him.",
                        "air_date": "1997-03-27",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The One with the Dollhouse",
                        "overview": "Monica inherits a beautiful dollhouse that is too elaborate to play with, so Phoebe makes her own. Joey thinks he's found his true love, and Rachel's boss dates Chandler, placing her in a dangerous situation.",
                        "air_date": "1997-04-10",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The One with the Chick and the Duck",
                        "overview": "Monica considers a dream job as head chef in Pete's new restaurant, but Phoebe fears there is more to the deal. Ross makes a sacrifice to help Rachel, who may have a broken rib. Meanwhile, Joey buys Chandler an unusual pet.",
                        "air_date": "1997-04-17",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The One with the Screamer",
                        "overview": "When Rachel finds out that Ross is bringing a date to the premiere of Joey's big play, she finds one of her own. Ross alone concludes that her date is insane. Poor Phoebe is on hold for days with a company she needs to talk to before her phone warranty expires. Meanwhile, Joey's play gets terrible reviews, but his co-star provides some comfort.",
                        "air_date": "1997-04-24",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The One with Ross's Thing",
                        "overview": "Afflicted with a mysterious skin condition on his butt that doctors cannot identify the cause of, Ross seeks advice from Phoebe's herbalist. Phoebe finds herself in a dilemma when she cannot choose between two guys. Monica can't decide about Pete when she thinks he is going to propose.",
                        "air_date": "1997-05-01",
                        "watched": false
                    },
                    {
                        "episode_number": 24,
                        "name": "The One with the Ultimate Fighting Champion",
                        "overview": "To Monica's horror, Pete wants to be the Ultimate Fighting Champion. Chandler has a problem when his new boss is slaphappy. Phoebe sets Ross up on a date with a woman who used to be bald. The group overhears a scandalous conversation at Central Perk.",
                        "air_date": "1997-05-08",
                        "watched": false
                    },
                    {
                        "episode_number": 25,
                        "name": "The One at the Beach",
                        "overview": "Phoebe invites everyone to stay at her massage client's beach house for the weekend. In search of her father, Phoebe meets someone who knows details about her family. Rachel expresses her jealousy of Ross' uninhibited girlfriend and Joey nags the friends into agreeing to play strip poker with unintended results. Chandler wonders why Monica doesn't think he's serious after asking if she would ever date him.",
                        "air_date": "1997-05-15",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 4,
                "episode_count": 23,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The One with the Jellyfish",
                        "overview": "Ross chooses between Rachel and his bald-headed girlfriend Bonnie. Phoebe struggles to deal with the revelation that her mother's friend is actually her mother. Monica gets stung by a jellyfish, forcing Chandler and Joey to step up to the plate in order to relieve her pain.",
                        "air_date": "1997-09-25",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The One with the Cat",
                        "overview": "Phoebe believes that her adoptive mother's spirit resides in a cat that jumped into her guitar case in Central Perk.  Monica goes on a date with Rachel's hunky high-school boyfriend, who was cool in high-school, but a failure now. And when Joey and Chandler decide to sell the entertainment center, Joey takes stupidity to a new level.",
                        "air_date": "1997-10-02",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The One with the 'Cuffs",
                        "overview": "Monica caters a party for her mother, who still doesn't quite know how to talk to her daughter. Chandler's encounter with Rachel's boss leads to an embarrassing situation. And an encyclopedia salesman takes advantage of Joey.",
                        "air_date": "1997-10-09",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The One with the Ballroom Dancing",
                        "overview": "Joey attempts ballroom dancing in order to help Monica and Rachel keep their illegal sublet. Phoebe is attracted to one of her massage clients. And Ross tries to help Chandler quit the gym.",
                        "air_date": "1997-10-16",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The One with Joey's New Girlfriend",
                        "overview": "Chandler hits on a woman at Central Perk, not realizing she is Joey's new girlfriend. He soon realizes he is very attracted to, possibly in love, with her. Ross and Rachel play the jealousy game in their relationships. And Phoebe desperately tries to catch a cold after discovering that her voice is sexier and her singing better when she has phlegm in her throat.",
                        "air_date": "1997-10-30",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The One with the Dirty Girl",
                        "overview": "Ross's new girlfriend seems nearly perfect until he visits her house and discovers that her apartment is incredibly dirty.  Chandler helps Joey pick out a thoughtful present for Kathy's birthday. Rachel attempts to finish a crossword puzzle by herself. And Phoebe helps Monica cater a funeral.",
                        "air_date": "1997-11-06",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The One Where Chandler Crosses the Line",
                        "overview": "Chandler must decide between the girl of his dreams and his best friend when he and Kathy share a passionate kiss. Needless to say, Joey is not happy when he finds out about it. And nobody wants to tell Ross how awful his keyboard playing is.",
                        "air_date": "1997-11-13",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The One with Chandler in a Box",
                        "overview": "Chandler agrees to spend Thanksgiving in a shipping crate as penance for kissing Kathy. The gang decides to give each other Secret Santa gifts. After Monica gets ice in her eye, she ends up visiting Richard's son, who is as attracted to Monica as his father was.",
                        "air_date": "1997-11-20",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The One Where They're Going to Party!",
                        "overview": "Chandler and Ross's college friend Gandalf is planning to come to town. Gandalf is \"the party wizard.\" Ross and Chandler are very excited until Gandalf cancels. However, they decide to make their own party with Joey's help. Joanna squashes Rachel's chance at a promotion. And when Monica fills in for a friend as food critic for a small newspaper, she must decide between a steady job as head chef of a restaurant she panned or keeping her catering business with her friend Phoebe.",
                        "air_date": "1997-12-11",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The One with the Girl from Poughkeepsie",
                        "overview": "Ross must decide whether to continue dating a girl he must travel two-and-a-half hours to see. Chandler sets Rachel up with a co-worker who misunderstands her intentions. Monica is being treated poorly by her new co-workers so she hires Joey just so she can fire him and show who's the boss. And Phoebe tries to write the perfect holiday song.",
                        "air_date": "1997-12-18",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The One with Phoebe's Uterus",
                        "overview": "Phoebe considers her options when her brother visits with his new wife and asks her to carry their child. Joey works as a tour guide at Ross's museum and tries to tear down the walls between tour guides and scientists. And Chandler seeks advice from Monica and Rachel after he fears that he will not live up to Kathy's sexual expectations--especially since the last guy she slept with before him was Joey.",
                        "air_date": "1998-01-08",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The One with the Embryos",
                        "overview": "Phoebe's uterus is examined for implantation of the embryos. Meanwhile, a seemingly harmless game between Chandler and Joey against Monica and Rachel escalates into a full blown contest where the stakes are raised higher and higher.",
                        "air_date": "1998-01-15",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The One with Rachel's Crush",
                        "overview": "After seeing Kathy's play, Chandler becomes convinced she is cheating on him with her co-star. Rachel develops a crush on one of her customers. Monica becomes jealous when she realizes she is no longer the 'hostess'.",
                        "air_date": "1998-01-29",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The One with Joey's Dirty Day",
                        "overview": "After a three-day fishing trip with his dad, Joey is in a jam when he doesn't have time to take a shower before going to the set of Charlton Heston's new movie.  Rachel, continuing to fawn over clothing shopper Joshua, sets Ross up with her boss's niece Emily when she is unable to take her to the opera. And while Chandler is despondent after his breakup with Kathy, the girls take him to a strip club.",
                        "air_date": "1998-02-05",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The One with All the Rugby",
                        "overview": "Chandler runs into Janice, and finds her more irritating than ever. Meanwhile, Ross attempts to learn how to play rugby to impress Emily and Monica obsesses over an electric switch in her new apartment.",
                        "air_date": "1998-02-26",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The One with the Fake Party",
                        "overview": "With two days left until Emily's departure back to England, Rachel throws a fake party for her, just so that she can see Joshua outside of work. And a pregnant (vegetarian) Phoebe craves meat.",
                        "air_date": "1998-03-19",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The One with the Free Porn",
                        "overview": "Chandler and Joey discover that they're getting a free porno station on their TV. Monica encourages Ross to tell Emily he loves her just before she leaves for London. Phoebe gets some shocking news when she visits her OB-GYN.",
                        "air_date": "1998-03-26",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The One with Rachel's New Dress",
                        "overview": "Rachel has an awkward encounter with Joshua's parents. Phoebe is offered the chance to name one of the triplets. Ross becomes paranoid when Emily goes to London with Susan.",
                        "air_date": "1998-04-02",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The One with All the Haste",
                        "overview": "Ross proposes to Emily. Monica and Rachel try to win their apartment back from Chandler and Joey.",
                        "air_date": "1998-04-09",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The One with All the Wedding Dresses",
                        "overview": "Chandler takes Joey to a sleep clinic when he starts snoring. After Ross asks Monica to pick up Emily's wedding dress, she tries it on and can't stop wearing it. Meanwhile, jealous of Ross's proposal to Emily, Rachel tries to talk Joshua into marriage.",
                        "air_date": "1998-04-16",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The One with the Invitation",
                        "overview": "As Ross and Emily send out wedding invitations, he and Rachel each look back on their relationship together while Joey and Chandler look for a purpose in life.",
                        "air_date": "1998-04-23",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The One with the Worst Best Man Ever",
                        "overview": "Joey convinces Ross to pick him as his best man instead of Chandler. He throws a great bachelor party, but the next morning he's shocked to find out that the wedding ring is missing and he suspects that the stripper stole it. Meanwhile, Phoebe is experiencing major mood swings due to her pregnancy and the girls decide to throw her a baby shower to cheer her up, but it only makes matters worse.",
                        "air_date": "1998-04-30",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The One with Ross's Wedding",
                        "overview": "The gang heads over to London for Ross and Emily's wedding. Joey can't contain his excitement about London which annoys Chandler to no end and results in two of them arguing. While the guys are touring the city, Monica, together with Ross and Emily, visit the chapel where the wedding ceremony is supposed to take place only to find out that it's being torn down prematurely.\n\nPhoebe tries to warn the gang that Rachel is coming to London to tell Ross that she still loves him. After the initial excitement about visiting England dissipates, Joey begins to feel homesick, however, one of the bridesmaids helps him to forget about it. Meanwhile, Ross and Emily's parents get into an argument over the bill for the wedding.",
                        "air_date": "1998-05-07",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 5,
                "episode_count": 23,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The One After Ross Says Rachel",
                        "overview": "In the aftermath of his Freudian slip, Ross tries to rescue his marriage with Emily.  Meanwhile, Chandler and Monica try and find a moment alone in order to continue their affair while overseas.",
                        "air_date": "1998-09-24",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The One with All the Kissing",
                        "overview": "Ross continues to try and mend his marriage to Emily. When Chandler accidentally kisses Monica in front of everyone before leaving for work, he tries to recover by kissing Rachel and Phoebe as well. Meanwhile, Phoebe starts getting irritated by everyone's London stories.",
                        "air_date": "1998-10-01",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The One Hundredth",
                        "overview": "Phoebe is rushed to the hospital for the birth of her brother's triplets. While there, Joey winds up with severe sympathy pains that turn out to be kidney stones. Meanwhile, Rachel tries to set Monica up on a date with a male nurse.",
                        "air_date": "1998-10-08",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The One Where Phoebe Hates PBS",
                        "overview": "Joey lands a job with a PBS telethon, which ignites an old hatred Phoebe has towards the network.  Meanwhile, Monica tries to convince Rachel that she's dating someone from work to hide her relationship with Chandler. And Ross finally gets in touch with Emily and they try to work it out.",
                        "air_date": "1998-10-15",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The One with the Kips",
                        "overview": "Monica and Chandler plan an Atlantic City getaway in order to have an intimate weekend away from their friends.  Meanwhile, Ross prepares himself to tell Rachel that he can't see her anymore.",
                        "air_date": "1998-10-29",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The One with the Yeti",
                        "overview": "Emily decides that the only way to continue her marriage with Ross is to have him get rid of all traces of Rachel in his apartment.  Meanwhile, Rachel and Monica mistake a hairy neighbor for a yeti.",
                        "air_date": "1998-11-05",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The One Where Ross Moves In",
                        "overview": "Chandler and Joey let Ross move in with them once his marriage to Emily falls apart.  Meanwhile, Phoebe gets involved with the local health inspector and Rachel becomes convinced that Danny is trying to seduce her with mind games.",
                        "air_date": "1998-11-12",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The One with All the Thanksgivings",
                        "overview": "Although the Thanksgiving meal is great, Chandler is still moody over his parent's divorce during the holiday when he was a boy and Ross is depressed about his second divorce. The group reminisces about their worst Thanksgivings in order to cheer them up, and Monica's worst memory is revealed.",
                        "air_date": "1998-11-19",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The One with Ross's Sandwich",
                        "overview": "Joey starts to get uncomfortable with protecting Monica and Chandler's secret, especially when it places him in embarrassing situations with the rest of the group. Meanwhile, Ross becomes enraged at work when someone swipes his turkey sandwich. Phoebe and Rachel enroll in a literature class.",
                        "air_date": "1998-12-10",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The One with the Inappropriate Sister",
                        "overview": "Joey teaches Ross how to be unemployed. Phoebe is working for the Salvation Army during the holidays. Monica is tired of Rachel's obsessing about Danny and asks him to go out with her. Ross convinces Joey to write a play about himself. Phoebe is distressed after finding out that New Yorkers are mean. Rachel meets Danny's sister and is dismayed when the two seem a little too playful. Phoebe vows a return to \"Street Phoebe.\"",
                        "air_date": "1998-12-17",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The One with All the Resolutions",
                        "overview": "With the New Year, the friends make New Year's resolutions. Ross resolves to try a new thing every day. Chandler resolves to not make fun of his friends for a week. Joey resolves to learn how to play the guitar, with Phoebe as his teacher. Rachel resolves to give up gossiping. Chandler nearly goes insane holding it all in. Ross is stuck in a sticky situation at his date's apartment, in constricting and hot leather pants. Rachel discovers a big secret (Monica and Chandler) that threatens to spoil her resolution.",
                        "air_date": "1999-01-07",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The One with Chandler's Work Laugh",
                        "overview": "Monica begins to hang out with Chandler during his work functions, since they don't have to keep their relationship a secret among his coworkers.  However, she learns that Chandler has a second, more annoying personality when he's around his boss.  Meanwhile, Ross learns that Emily is getting remarried and in his grief hooks up with an old nemesis of the gang: Janice.",
                        "air_date": "1999-01-21",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The One with Joey's Bag",
                        "overview": "Phoebe's grandmother dies, and Phoebe is shocked when her father turns up at the funeral. Meanwhile, Rachel gives Joey a \"man's bag\" for an audition, and Chandler is scared to tell Monica he doesn't like her massages.",
                        "air_date": "1999-02-04",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The One Where Everybody Finds Out",
                        "overview": "When the friends discover that Ugly Naked Guy is moving out of his apartment, Ross leaps at the opportunity to get his own place again. Phoebe finds out about Monica and Chandler's relationship, and tries to get them to reveal the truth by seducing Chandler.",
                        "air_date": "1999-02-11",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The One with the Girl Who Hits Joey",
                        "overview": "Joey starts dating Katie, a little girl who packs a mean punch.  When Ross refuses to contribute to the retirement fund of the building's maintenance man, he winds up offending everyone in the building. Meanwhile, Chandler freaks out about his relationship with Monica.",
                        "air_date": "1999-02-18",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The One with the Cop",
                        "overview": "Joey has a dream about Monica and becomes convinced he is in love with her. Meanwhile, Phoebe finds a police badge in Central Perk and uses it to go on missions of mercy. And Ross buys a new sofa but has trouble moving it up the stairs into his new apartment.",
                        "air_date": "1999-02-25",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The One with Rachel's Inadvertent Kiss",
                        "overview": "Monica becomes jealous of Phoebe and Gary. Rachel has an awkward encounter when she interviews for a new job. Joey tries to meet a girl living in Ross's building, but has trouble with finding her apartment.",
                        "air_date": "1999-03-18",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The One Where Rachel Smokes",
                        "overview": "Rachel decides to start smoking in order to avoid missing important meetings with her boss. Meanwhile, Ben gets offered an audition for a soup commercial, and Joey auditions to be Ben's father during the ad. Also, Monica and Phoebe plan a surprise birthday party for Rachel together, but Monica takes over.",
                        "air_date": "1999-04-08",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The One Where Ross Can't Flirt",
                        "overview": "As Joey's Italian-speaking grandmother visits to watch him on TV, Ross has trouble flirting with the pizza delivery girl, and Rachel tries to find an earring of Monica's that she has misplaced.",
                        "air_date": "1999-04-22",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The One with the Ride Along",
                        "overview": "While the guys go on a ride-along with Gary, Rachel accidentally deletes a message from Emily on Ross's answering machine.",
                        "air_date": "1999-04-29",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The One with the Ball",
                        "overview": "Phoebe learns that Gary is going to ask her to move in with him and thinking this is way to fast, she tries to get Chandler to talk him out of this decision. Rachel buys an expensive sphynx cat but is disappointed when it doesn't behave as she hoped it would. Meanwhile, Ross and Joey start throwing a ball while they are bored but it changes from a time-filler to a super-competitive obsession when Monica joins in.",
                        "air_date": "1999-05-06",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The One with Joey's Big Break",
                        "overview": "Joey seems to have finally hit big when he gets offered a lead part in a movie shooting outside of Las Vegas. However, when Chandler begins expressing doubts about the film's legitimacy, it causes a rift in their friendship. Also, Rachel gets an eye infection but is reluctant to seek treatment because of her eye phobia. And Phoebe is mad at Ross, but doesn't know why.",
                        "air_date": "1999-05-13",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The One in Vegas",
                        "overview": "Chandler decides the only way to mend his friendship with Joey is to fly out to Vegas and visit him. Phoebe is determined not to be left out on another adventure, so everyone winds up going. Trouble is in the water, however, when Chandler finds out that Monica had lunch with Richard. Meanwhile, Ross and Rachel try to embarrass each other after an awkward encounter.\n\nChandler and Monica reconcile and hastily decide to get married. Ross and Rachel get drunk and roam the casino. Phoebe deals with a 'lurker' on the slot machines.",
                        "air_date": "1999-05-20",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 6,
                "episode_count": 23,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The One After Vegas",
                        "overview": "Ross and Rachel experience the world’s worst hangover when they realize they’ve gotten married.  Chandler and Monica back away from their own altar plans.  Phoebe and Joey head back to New York in the taxi cab.",
                        "air_date": "1999-09-23",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The One Where Ross Hugs Rachel",
                        "overview": "Monica and Chandler decide to move in together, leading Rachel to believe that all three of them will be roommates, and Monica doesn't want to tell her the truth.  Meanwhile, Ross tries to keep Rachel from learning that their marriage hasn't been annulled.",
                        "air_date": "1999-09-30",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The One with Ross's Denial",
                        "overview": "Monica and Chandler disagree over how to redecorate Rachel's old room. Joey advertises for a \"non-ugly\" roommate. Ross is unwilling to accept that he still has feelings for Rachel.",
                        "air_date": "1999-10-07",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The One Where Joey Loses His Insurance",
                        "overview": "Joey's health benefits lapse just as he develops a hernia. Ross is asked to give a lecture at NYU and eager to impress his students, he puts on a fake British accent. Meanwhile, Phoebe gets some bad news from her psychic.",
                        "air_date": "1999-10-14",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The One with Joey's Porsche",
                        "overview": "Ross and Rachel try to get an annulment, but run into some legal obstacles. Joey finds keys to a Porsche in Central Perk and discovers some perks of being a fancy car owner. Meanwhile, Chandler, Monica and Phoebe babysit the triplets.",
                        "air_date": "1999-10-21",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The One on the Last Night",
                        "overview": "On the last night before Chandler and Monica move in together, Monica and Rachel argue, while Chandler tries to give Joey money to help him pay the upcoming bills.",
                        "air_date": "1999-11-04",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The One Where Phoebe Runs",
                        "overview": "Now roommates Phoebe and Rachel decide to start running together, but Rachel is embarrassed by Phoebe's odd running style. Joey finds a sexy new female roommate and tries very hard not to flirt with her. Meanwhile, Chandler decides to surprise Monica by cleaning the apartment, but forgets where everything goes. Ross tries to help him remedy the situation.",
                        "air_date": "1999-11-11",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The One with Ross's Teeth",
                        "overview": "Ross goes too far while trying to impress a date by over-whitening his teeth. Rachel uses gossip to get her boss to like her after Phoebe supposedly makes out with Ralph Lauren. Meanwhile, Chandler convinces Joey that the changes Janine has introduced to their old apartment is making it too girly.",
                        "air_date": "1999-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The One Where Ross Got High",
                        "overview": "It's Thanksgiving and Monica's parents are coming to visit, which is a problem because, not only they do not like Chandler, they also don't know that he and Monica are living together. Rachel is tasked with making a Thanksgiving dessert, but she does so with mixed results. Meanwhile, Joey and Ross are eager to finish the dinner and leave, because they want to go to a Thanksgiving party with Janine and her dancer friends.",
                        "air_date": "1999-11-25",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The One with the Routine",
                        "overview": "Janine gets an invitation to dance on \"Dick Clark's New Year's Rockin' Eve\" and she invites Joey, Monica and Ross to join her. Being huge fans of the show, Monica and Ross get overly excited. At the taping, Joey tries to kiss Janine at midnight and Monica and Ross resurrect their dance routine from high school. Meanwhile, Rachel, Phoebe and Chandler look for Monica's Christmas presents.",
                        "air_date": "1999-12-16",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The One with the Apothecary Table",
                        "overview": "Rachel orders an apothecary table from Pottery Barn, which is a problem because Phoebe hates the mass-producing company. After Janine and Joey double date with Chandler and Monica, Janine tells Joey that she thinks the other two are boring. Ross buys a new apothecary table too, which causes problems for Rachel. After a confrontation with Monica and Chandler, Joey breaks up with Janine and she moves out.",
                        "air_date": "2000-01-06",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The One with the Joke",
                        "overview": "After a joke gets published in Playboy, Chandler and Ross have an argument about who came up with it first. Meanwhile, a wayward remark of Phoebe's leads to trouble between the girls and a broke Joey starts working at Central Perk.",
                        "air_date": "2000-01-13",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The One with Rachel's Sister (1)",
                        "overview": "Joey gets in trouble for giving attractive female customers free food at Central Perk. A sick Monica desperately tries to convince Chandler that she's not sick. After her father cuts her off, Rachel's sister Jill comes to town. Rachel encourages her to start an independent life by finding a job and an apartment, but one thing leads to another and Jill ends up asking Ross out on a date. Even though Rachel doesn't want to admit it, she clearly isn't okay with that...",
                        "air_date": "2000-02-03",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The One Where Chandler Can't Cry (2)",
                        "overview": "Chandler admits that he hasn't cried since he was a child. Phoebe discovers that Ursula is starring in porno movies using her name. Rachel desperately tries to stop Ross and Jill from starting a relationship.",
                        "air_date": "2000-02-10",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The One That Could Have Been",
                        "overview": "Barry and Mindy's impending divorce prompts the gang to fantasize about what their lives might be like if they'd all taken different courses. Ross is still married to Carol, and Rachel is married to Barry, but fawning over famous soap star Joey Tribbiani. Monica is still fat and dating a doctor. Chandler is an aspiring writer and Phoebe is a Wall Street shark for Merrill Lynch.\n\nThe gang continue to fantasize about how different their lives could have been. Carol and Ross decide to have a threesome to spice up their marriage. Rachel goes to Joey's but is incredibly nervous about cheating and gets drunk. Meanwhile, Monica's dinner date falls through and Chandler tries to cheer her up but things take an unexpected turn.",
                        "air_date": "2000-02-17",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The One with Unagi",
                        "overview": "Joey tries to earn some extra money by entering a medical study, however, there's a slight problem: the study is for identical twins. Rachel and Phoebe take self-defense classes, but Ross attempts to give them a lesson in Unagi instead. Meanwhile, Chandler and Monica agree to give each other homemade presents for Valentine's Day.",
                        "air_date": "2000-02-24",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The One Where Ross Dates a Student",
                        "overview": "At the end of semester Ross gets his student evaluations and one of them writes that he's hot. It turns out to be a cute girl named Elizabeth and even though it could cost him his job, Ross considers dating her. An ex-girlfriend of Chandler's from college is directing the new Al Pacino movie and Joey asks Chandler for help with getting an audition. Meanwhile, after a fire ruins Phoebe and Rachel's apartment, they're forced to find temporary living spaces with Monica and Joey.",
                        "air_date": "2000-03-09",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The One with Joey's Fridge",
                        "overview": "After Joey's fridge breaks, he tries to cajole his friends into helping him buy a new one. Meanwhile, Ralph Lauren is organizing a charity ball and Rachel looks for a date, however, unexpectedly it turns into a competition between Monica & Chandler against Phoebe for finding the best candidate. Ross continues to date Elizabeth, but he gets nervous when she makes plans for a spring break at Daytona Beach.",
                        "air_date": "2000-03-23",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The One with Mac and C.H.E.E.S.E.",
                        "overview": "Joey gets an audition for the lead character in a new TV show. When the audition is rescheduled, Chandler takes the message but forgets to tell Joey. When Joey misses the audition, he gets upset and the group reminisces about their mishaps in the past.",
                        "air_date": "2000-04-13",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The One Where Ross Meets Elizabeth's Dad",
                        "overview": "Ross meets Elizabeth's father for the first time and unfortunately he takes an instant disliking to Ross. However Paul does hit it off with Rachel and she tries to talk Ross up but does so with mixed results. Joey almost gets fired from \"Mac and C.H.E.E.S.E.\" after offending the operator of the robot. Meanwhile, Phoebe writes a book based on Monica and Chandler.",
                        "air_date": "2000-04-27",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The One Where Paul's the Man",
                        "overview": "While visiting an art museum, Monica puts her name on a two-year waiting list to use the museum for a wedding. Accidentally Chandler finds out about this and freaks out. Meanwhile, Paul threatens to have Ross fired from the university if he continues to date Elizabeth, however, that doesn't stop the two of them from going to her dad's mountain cabin over the weekend. Unfortunately for them, Paul has the same idea to bring Rachel there.",
                        "air_date": "2000-05-04",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The One with the Ring",
                        "overview": "Chandler and Phoebe shop for a ring for Monica. Chandler finds the perfect one, but Phoebe accidentally lets it get away. While Chandler is busy with getting the ring back, Joey and Ross are lead to believe that he's mad at them, so they decide to team up and give him a cold shoulder treatment. Rachel continues to date Paul and wants him to open up to her, however, he opens up a bit too much.",
                        "air_date": "2000-05-11",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The One with the Proposal",
                        "overview": "Chandler plans to propose to Monica at dinner, but his plans go awry when Richard shows up at the same restaurant. Meanwhile, Phoebe and Joey join Rachel at a charity auction only to discover that Joey isn't aware what a silent auction is. And Ross and Elizabeth's relationship comes to a crossroad.\n\nChandler continues to pretend to hate the idea of marriage, unaware that Richard wants Monica back. Meanwhile, Rachel and Phoebe discuss their 'back-up' plans, if they are not married by the time they're 40.",
                        "air_date": "2000-05-18",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 7,
                "episode_count": 23,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The One with Monica's Thunder",
                        "overview": "The gang celebrate Monica and Chandler's engagement. Phoebe wants to be the musician at the wedding and comes up with a new song, while Joey tries to dress and act like a 19-year-old for an audition. Ross and Rachel briefly reunite and after Monica catches them kissing, she's convinced that Rachel is trying to steal her thunder.",
                        "air_date": "2000-10-12",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The One with Rachel's Book",
                        "overview": "As Monica starts planning her wedding she's shocked to find out that her parents have spent her entire wedding fund. However, her spirits are restored when she discovers that Chandler has enough savings for her dream wedding scenario. Phoebe temporarily moves into Ross's apartment, bringing her massage clients with her. This leads to some weird encounters for Ross. Meanwhile, Joey mocks Rachel when he finds an erotic novel she is reading.",
                        "air_date": "2000-10-12",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The One with Phoebe's Cookies",
                        "overview": "Monica tries to figure out Phoebe's grandmother's secret chocolate chip cookie recipe. Meanwhile, Rachel tries to teach Joey how to sail, and Chandler has an awkward encounter when he tries to bond with Monica's father.",
                        "air_date": "2000-10-19",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The One with Rachel's Assistant",
                        "overview": "While hiring a new assistant, Rachel is torn between hiring a much more qualified woman, or a handsome but inexperienced young man. Monica, Chandler and Ross engage in a war of secret sharing after Monica and Chandler vow to be more honest. Meanwhile, Joey has problems when his TV show is cancelled after just one airing.",
                        "air_date": "2000-10-26",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The One with the Engagement Picture",
                        "overview": "While taking an engagement picture for himself and Monica, Chandler cannot make anything but a weird face. Meanwhile, Rachel enlists Joey to take Tag out for a night on the town. Also, Phoebe and Ross date a couple in the middle of a divorce.",
                        "air_date": "2000-11-02",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The One with the Nap Partners",
                        "overview": "Joey and Ross accidentally take a nap together - and much to their dismay, find that they liked it. Phoebe and Rachel compete to become Monica's maid of honor.",
                        "air_date": "2000-11-09",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The One with Ross's Library Book",
                        "overview": "Rachel and Phoebe befriend a girl Joey's dating and they try to convince him to get more serious with her, however he's reluctant to do so. At least at first. Meanwhile, Ross discovers that his doctoral dissertation is hosted at university's library and is very excited about the fact. Unfortunately, he soon finds out that students aren't exactly reading it, but rather engaging in other 'physical activities' in the paleontology section. Also, Monica runs into Janice and before she knows it, Janice has invited herself to Monica's wedding. Needless to say that neither she nor Chandler aren't exactly ecstatic about it and they both try to find a way to tactfully uninvite her.",
                        "air_date": "2000-11-16",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The One Where Chandler Doesn't Like Dogs",
                        "overview": "Ross drives himself insane when he can't name all 50 states in a simple game. Tag joins the gang for Thanksgiving dinner, where Joey accidentally spills the beans about Rachel's crush on him. Phoebe sneaks a dog into the apartment, making Chandler extremely nervous.",
                        "air_date": "2000-11-23",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The One with All the Candy",
                        "overview": "When Phoebe tells the gang about how she was too poor to have a bike as a child, Ross goes out and buys her one. While Phoebe absolutely loves the bike, the gang soon discovers that she doesn't actually know how to ride one. Meanwhile, Monica decides to make candy in order to get to know her neighbours, and while they all love the candy, nobody is particularly interested in Monica herself. Rachel and Tag try to hide their relationship at work, but things go awry when Rachel writes a playful work evaluation of Tag that he accidentally turns in to Human Resources.",
                        "air_date": "2000-12-07",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The One with the Holiday Armadillo",
                        "overview": "Ross's plans to teach Ben about Hanukkah are continually thwarted when the young boy can't get his mind off of Santa. Meanwhile, Phoebe prepares to move back into her refurbished apartment, with or without Rachel. However, she'll stop at nothing to get Rachel to go with her, including buying Joey a drum set. Monica is mystified by Chandler's inability to tip properly.",
                        "air_date": "2000-12-14",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The One with All the Cheesecakes",
                        "overview": "Phoebe gets upset with Joey when he blows off dinner with her for a date, however only a few days later she finds herself in the same situation but with their roles reversed. Meanwhile, Chandler and Rachel enjoy a cheesecake that gets delivered to their address by accident. They feel guilt-ridden at first, but it's just too delicious. Also, Ross and Monica attend a wedding reception of their cousin and find themselves in an awkward situation.",
                        "air_date": "2001-01-04",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The One Where They're Up All Night",
                        "overview": "After the gang head up to the roof to see a passing comet, separate events unfold that lead to them all having a sleepless night.",
                        "air_date": "2001-01-11",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The One Where Rosita Dies",
                        "overview": "Rachel accidentally breaks Joey's armchair (that he's named Rosita) and while they're out shopping for a new one, it appears that Rosita has magically \"healed\" herself. Meanwhile, Phoebe takes a temp job as a telemarketer for an office supply company and when her first client turns out to be suicidal, she goes out of her way to talk him out of it. Also, Ross and Monica find out that their parents are selling their childhood home.",
                        "air_date": "2001-02-01",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The One Where They All Turn Thirty",
                        "overview": "When Rachel turns 30, the gang reminisces about their 30th birthdays. Ross buys a sports car to look cool, Monica gets drunk, and Phoebe, while trying to patch things up with Ursula, discovers that she is actually 31.",
                        "air_date": "2001-02-08",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The One with Joey's New Brain",
                        "overview": "Joey's character on Days of Our Lives is awakened from his coma with a brain transplant from one of the show's most legendary characters. Ross practices the bagpipes for Monica and Chandler's wedding. Meanwhile, Phoebe and Rachel fight over a guy who left his cell phone in Central Perk.",
                        "air_date": "2001-02-15",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The One with the Truth About London",
                        "overview": "Chandler is shocked to find out who Monica really wanted to sleep with the night they first got together in London. Meanwhile, Rachel gets into trouble with Ross when she teaches Ben practical jokes.",
                        "air_date": "2001-02-22",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The One with the Cheap Wedding Dress",
                        "overview": "Monica regrets telling a woman about a discount bridal shop when they end up fighting over the same dress. Meanwhile, Joey and Ross discover that they're dating the same girl.",
                        "air_date": "2001-03-15",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The One with Joey's Award",
                        "overview": "Joey is nominated for a Soapie Award for his part on Days of Our Lives, and while he doesn't win, he ends up with an award anyway - together with his partner in crime, Rachel. Meanwhile, Ross finds himself in an awkward position when one of his students proclaims that he failed his midterm because he's in love with Ross. Also, Monica freaks out a little when she realizes that after marrying Chandler she's not gonna experience a rush of dating someone new ever again. In a surprising change of roles, Chandler becomes a voice of reason that calms her.",
                        "air_date": "2001-03-29",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The One with Ross and Monica's Cousin",
                        "overview": "Joey auditions for a big movie role which will require him to appear naked. A problem arises, however, when the part calls for an uncircumcised man. Meanwhile, Rachel and Phoebe go through the trouble of organizing  a last minute bridal shower for Monica. And Ross becomes attracted to his cousin after she visits.",
                        "air_date": "2001-04-19",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The One with Rachel's Big Kiss",
                        "overview": "At Central Perk Rachel runs into her friend from college, Melissa, and it turns out they share something more than just a friendship. Meanwhile, Monica plans the seating arrangement for the wedding and is taken by surprise when Joey mentions that his parents are coming to the wedding too. Also, Chandler and Ross argue who gets to wear a celebrity tux for the event.",
                        "air_date": "2001-04-26",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The One with the Vows",
                        "overview": "Monica and Chandler are getting married in four weeks and have to write their vows, but neither has a clue what to say, so they reflect on their past. In the end, the only real problem is who will be saying the vows first.",
                        "air_date": "2001-05-03",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The One with Chandler's Dad",
                        "overview": "When Monica's Porsche shows up again, Ross and Rachel hit the freeway together and it turns out to be an adventurous ride. Meanwhile, Chandler and Monica go off to Vegas to find Chandler's estranged father. And back at home, Joey proves his masculinity to Phoebe.",
                        "air_date": "2001-05-10",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The One with Chandler and Monica's Wedding",
                        "overview": "So close to the wedding, Chandler suddenly realizes the overwhelming meaning of getting married and takes off without warning anyone. Meanwhile, Joey acts opposite a famous actor in a movie, but can't bring himself to tell him that he spits when he says his lines. Phoebe and Ross try to find Chandler before the wedding starts, while Rachel tries to hinder Monica, so that she doesn't find out the shocking news. On the day of the wedding Joey encounters a scheduling problem, while Phoebe and Rachel come across a surprising discovery.",
                        "air_date": "2001-05-17",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 8,
                "episode_count": 23,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The One After \"I Do\"",
                        "overview": "The excitement of Monica and Chandler's wedding is diminished by the news that someone may be pregnant. Chandler's hopes of not embarrassing Monica on the dance floor are ruined by his slippery new shoes, and Ross' attempts to flirt with an attractive wedding guest.",
                        "air_date": "2001-09-27",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The One with the Red Sweater",
                        "overview": "Speculation regarding the father of Rachel's baby leads to a misunderstanding when Joey discovers a red sweater left behind in a one-night stand Rachel had. Meanwhile, Chandler and Ross search for the disposable cameras left behind at the wedding and Monica goes on a present-opening binge.",
                        "air_date": "2001-10-04",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The One Where Rachel Tells...",
                        "overview": "Chandler and Monica prepare to leave for their honeymoon as Rachel prepares to tell Ross that he's the father of her baby. While traveling, Monica and Chandler become jealous of another honeymooning couple who get bumped to first class on the airplane. Meanwhile, Joey and Phoebe scheme to get inside the newlyweds' apartment after discovering that they don't have a key.",
                        "air_date": "2001-10-11",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The One with the Videotape",
                        "overview": "Monica and Chandler return from their honeymoon with stories of a couple that they met on the flight back, but soon discover that the couple gave them a wrong number. Meanwhile, Ross and Rachel tell everyone about the night they were together, however, their stories differ as to who made the first move. While Ross emphatically defends his side of the story, he accidentally reveals that he has the encounter on videotape. Unsurprisingly, everyone wants to see it.",
                        "air_date": "2001-10-18",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The One with Rachel's Date",
                        "overview": "Phoebe begins dating a guy who works for Monica as a sous-chef, however, they soon find themselves in an awkward position when things don't work out for neither of them. Meanwhile, Ross discovers that a co-worker of Chandler's has been calling him Toby for five years. And Joey sets Rachel up on a date with one of his co-stars, which freaks Ross out when he realizes that this guy might become a step-father of his and Rachel's baby.",
                        "air_date": "2001-10-25",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The One with the Halloween Party",
                        "overview": "Monica and Chandler decide to throw a costumed Halloween party. Meanwhile, Phoebe runs into Ursula, who's preparing to get married soon, and as a courtesy invites her and her fiancé to the party. When they finally meet, Phoebe takes an instant liking to him, but soon she discovers that he knows nothing about the \"real\" Ursula.",
                        "air_date": "2001-11-01",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The One with the Stain",
                        "overview": "Chandler hires a maid, whom Monica suspects is stealing her clothing. Eric has broken up with Ursula and is ready to date Phoebe, except for one problem: he can't look at her without seeing Ursula. Meanwhile, Ross tries to get Rachel an apartment in his building, but the woman living there isn't in a hurry to die, and Joey wants Rachel to stay with him.",
                        "air_date": "2001-11-08",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The One with the Stripper",
                        "overview": "Chandler finds out that Monica had a bachelorette party with a stripper, even though they promised not to have bachelor/bachelorette parties. Monica feels bad about it, so she organizes a bachelor party including a stripper for Chandler, however, the only one excited about it seems to be Joey. Meanwhile, Rachel prepares to have dinner with her dad and tell him that she's pregnant and it doesn't go particularly well for either of the involved parties.",
                        "air_date": "2001-11-15",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The One with the Rumor",
                        "overview": "Monica invites Will, an old high school friend of her and Ross over for a Thanksgiving dinner, unaware that he isn't too fond of Rachel. Meanwhile, Joey vows to eat an entire turkey by himself, and Chandler and Phoebe pretend to watch a football game in order to avoid helping in the kitchen.",
                        "air_date": "2001-11-22",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The One with Monica's Boots",
                        "overview": "Chandler is peeved when Monica splurges on an expensive pair of boots. Meanwhile, Phoebe learns that Ben and Sting's son attend the same school and she angles to meet the celebrity and get concert tickets. Also, after Joey's sister Dina tells him that she's pregnant, he freaks out and goes to find the father to marry them. Rachel tries to calm him down.",
                        "air_date": "2001-12-06",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The One with Ross's Step Forward",
                        "overview": "Ross starts to panic when Mona suggests that the two of them could send out a holiday card together, thinking that their relationship is starting to move too fast. Chandler's newly divorced boss tries to get Monica and Chandler to go out to a dinner with him, but Monica can't stand him, so Chandler steps up to cover for her. Meanwhile, Rachel's hormones start acting up due to her pregnancy, causing her to hit on almost every guy she meets.",
                        "air_date": "2001-12-13",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The One Where Joey Dates Rachel",
                        "overview": "Phoebe gets Monica and Chandler a Ms. Pacman arcade game for a wedding present, which leads to some heavy competition between Monica, Phoebe, and, surprisingly, Chandler. Ross gets to teach an advanced class because of a retiring professor, but soon learns that its on the other side of town, and he doesn't have enough time to get there. Meanwhile, Joey takes Rachel to dinner on a pretend date and they have a great time together, however, at the end of the night things take an unexpected turn.",
                        "air_date": "2002-01-10",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The One Where Chandler Takes a Bath",
                        "overview": "Monica turns Chandler on to the concept of taking a bath to relax, complete with scented oils and candles. Ross and Rachel toss baby names back and forth while deciding whether to learn the baby's sex. Meanwhile, Joey struggles with his feelings for Rachel.",
                        "air_date": "2002-01-17",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The One with the Secret Closet",
                        "overview": "Chandler's very curious about a locked closet by the bathroom in their apartment, but Monica won't tell him what is inside. After Phoebe convinces Monica to get a massage from her, she soon finds out that Monica makes sexual noises during the process, which makes Phoebe very uncomfortable. Meanwhile, Rachel feels her baby kick for the first time and Ross is upset when he can't be more involved in Rachel's pregnancy issues.",
                        "air_date": "2002-01-31",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The One with the Birthing Video",
                        "overview": "During Valentine's Day, Chandler and Monica discover the miracle of birth by watching an extremely graphic video. Ross hides the fact that Rachel is now living with him from Mona, which only gets him into more trouble. Meanwhile, Phoebe tries to help with Joey's depression caused by his feelings for Rachel by lending him the world's happiest dog.",
                        "air_date": "2002-02-07",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The One Where Joey Tells Rachel",
                        "overview": "After Joey reveals to Ross that he's in love with Rachel, Ross has a hard time accepting this revelation. However, after giving it some thought, he convinces Joey to tell Rachel how he feels. So he does exactly that by taking Rachel out to dinner, however, her reaction to the news isn't quite what he expected. Meanwhile, Phoebe claims that she has met Monica's soulmate which makes Chandler really anxious.",
                        "air_date": "2002-02-28",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The One with the Tea Leaves",
                        "overview": "At Central Perk Phoebe does a reading of tea leaves which tell her that she's soon going to meet a man of her dreams. In fact, she does meet a man she keeps constantly bumping into, however, he turns out to be a bit creepy to say the least. Meanwhile, after their conversation, things between Joey and Rachel are still weird and Joey keeps finding excuses to avoid her. As a result Rachel comes up with a rather crazy problem at work to draw him into a conversation. She doesn't realize though, how far he's willing to go to help with her fake problem after their conversation is over. Also, Ross tries to retrieve his favorite shirt from Mona's, interrupted when she returns home with a date.",
                        "air_date": "2002-03-07",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The One in Massapequa",
                        "overview": "Everybody prepares to go out to Long Island for the elder Gellers' 35th wedding anniversary party. Monica struggles to prepare the perfect toast that would make everybody cry. Meanwhile, Ross and Rachel discover that his parents have told people they're married and they decide to just go along with it for the night. However, Rachel gets carried away a little telling stories about their \"wedding\" that didn't happen. Also, Phoebe invites her new boyfriend, Parker, who is extremely enthusiastic.",
                        "air_date": "2002-03-28",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The One with Joey's Interview",
                        "overview": "Joey prepares for an interview with Soap Opera Digest, although he's afraid of saying something stupid and getting himself into trouble, so he enlists his friends to make sure things go well. During the interview, he reminisces about his past acting experiences, his friends and his romantic life.",
                        "air_date": "2002-04-04",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The One with the Baby Shower",
                        "overview": "Monica and Phoebe throw Rachel a baby shower but forget to invite Rachel's mom. During the baby shower Rachel panics when she realizes she has no idea how to look after the baby after the birth. Meanwhile, Joey auditions for a job as a host for a new game show called \"Bamboozled\", and Chandler and Ross help him practice.",
                        "air_date": "2002-04-25",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The One with the Cooking Class",
                        "overview": "Monica's restaurant gets a bad review in the Post. After confronting the critic who wrote it, she decides to join a cooking class, with Joey in tow. Meanwhile, Rachel gets jealous when Ross hits it off with a woman at the baby department store. And Chandler prepares for a job interview after Phoebe tells him that he makes a bad first impression.",
                        "air_date": "2002-05-02",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The One Where Rachel Is Late",
                        "overview": "Monica and Phoebe bet on when Rachel's baby will be born as the due date comes and goes as Rachel becomes extremely irritable. Meanwhile, Joey invites Chandler to his big movie premiere and he manages to fall asleep during it. Also, Ross attempts to help Rachel speed things along by trying every possible method suggested by the doctor, except one.",
                        "air_date": "2002-05-09",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The One Where Rachel Has a Baby",
                        "overview": "Ross and Rachel go to the hospital to have their baby, but it's a long labor. They get stuck in a semi-private room, and many other couples come and go before Rachel is ready to deliver - the last couple being Janice and her new husband. Meanwhile, Chandler and Monica decide to start trying to have a baby, but can't find an empty hospital room where they wouldn't be disturbed. Also, Phoebe meets a handsome stranger and \"recruits\" Dr. Drake Ramoray to gather some personal information about him.\n\nAfter Rachel gives birth to her little baby girl, she must confront relationship issues around her. So does Ross, who gets an engagement ring from his mother, while she urges him to propose to Rachel. The things, however, take an interesting turn.",
                        "air_date": "2002-05-16",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 9,
                "episode_count": 23,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The One Where No One Proposes",
                        "overview": "Following Rachel's acceptance of Joey's accidental proposal, confusion reigns as Rachel wonders whether it was the right thing to do and Phoebe can't seem to mind her own business. Finally, Rachel, Ross and Joey get together and figure out that no one was actually going to propose. Meanwhile, Mr. Geller walks in on Monica and Chandler having sex in a closet.",
                        "air_date": "2002-09-26",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The One Where Emma Cries",
                        "overview": "Chandler, having trouble getting enough sleep at home, falls asleep in a meeting and accidentally agrees to run his company's Tulsa office. Emma won't stop crying after Rachel interrupts her nap; Monica and Phoebe try to help get her back to sleep. Meanwhile, Ross is still mad at Joey, and breaks his finger trying to punch him.",
                        "air_date": "2002-10-03",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The One with the Pediatrician",
                        "overview": "Rachel's pediatrician drops her as a client because she calls him incessantly to ask about any insignificant issue concerning Emma, so now she must find a new one, which puts Ross in an awkward situation. Meanwhile, Joey arranges a blind date for Phoebe. Also, as Chandler and Monica are preparing to leave for Tulsa, Monica receives a job offer from a prestige restaurant in Manhattan.",
                        "air_date": "2002-10-10",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The One with the Sharks",
                        "overview": "After Phoebe has a talk with Ross, it prompts her to realize that she's never had a long term relationship. Monica makes a startling discovery while visiting Chandler in Tulsa. Also, Joey goes on a date with an attractive woman and discovers that her apartment seems really familiar, although he doesn't remember sleeping with her before.",
                        "air_date": "2002-10-17",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The One with Phoebe's Birthday Dinner",
                        "overview": "The friends are looking forward to getting together and celebrating Phoebe's birthday. However, on the day of the party, Ross struggles to convince Rachel to leave Emma with Mrs. Geller babysitting, and Monica and Chandler get into an argument, after Monica discovers that he's been smoking. All of this causes them to be incredibly late, leaving Phoebe and Joey alone at a restaurant with a table for six.",
                        "air_date": "2002-10-31",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The One with the Male Nanny",
                        "overview": "Ross and Rachel hire a nanny for Emma named Sandy and things seem to be going great. However, Ross is uncomfortable having a male nanny. Meanwhile, Chandler becomes upset when Monica says that somebody from her new job is the funniest guy she's ever met. Also, after Phoebe and Mike  decide to take their relationship to a new level and exchange apartment keys, Phoebe gets a surprise visit from her ex-boyfriend David.",
                        "air_date": "2002-11-07",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The One with Ross's Inappropriate Song",
                        "overview": "Ross finds a way to make Emma laugh - singing Sir Mix-A-Lot's \"Baby Got Back.\" Needless to say, Rachel isn't as amused, once she finds out. Meanwhile, Phoebe meets Mike's parents and tries her best to leave a good impression. Also, while viewing Richard's old apartment, Joey and Chandler discover a video tape with Monica's name on it, which causes Chandler to freak out, since he thinks it's a sex tape.",
                        "air_date": "2002-11-14",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The One with Rachel's Other Sister",
                        "overview": "Rachel's sister Amy tags along for Thanksgiving at Monica's place, because her (married) boyfriend cancels their plans. While watching the parade, Joey realizes that he forgot to show up for the Days of Our Lives cast float, and he asks Phoebe's help to come up with a believable lie. The dinner goes fairly well, however, Monica constantly obsesses about anybody damaging her best china. To make matters worse, Amy comes up with a crazy scenario involving Emma, which sparks a massive argument among the gang.",
                        "air_date": "2002-11-21",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The One with Rachel's Phone Number",
                        "overview": "Joey becomes convinced that Monica is having an affair, after Chandler sneaks back into town without him knowing, in order to have some alone time with his wife. Meanwhile, Rachel and Phoebe have a girls night out, and Rachel gives her phone number to a guy they meet at a bar. Also, Ross and Mike try to hang out together but it doesn't go very well, since they can't find a common interest to talk about.",
                        "air_date": "2002-12-05",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The One with Christmas in Tulsa",
                        "overview": "Everyone in the gang gets a little upset when Chandler announces that he'll be spending Christmas and New Year's Eve in Tulsa because of work. To make matters worse, Monica gets quite jealous when she finds out that one of Chandler's co-workers is a former Miss Oklahoma runner-up. After doing some retrospection, Chandler decides to quit his job.",
                        "air_date": "2002-12-12",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The One Where Rachel Goes Back to Work",
                        "overview": "Chandler starts looking for a job and is anxious about having a baby with Monica while uncertain about his career prospects. Meanwhile, Rachel visits work and finds out that during her leave, a guy named Gavin has been temporarily assigned to take care of her job. She starts to feel insecure about her job position and decides to come back from her leave early. Also, Phoebe works as an extra on Joey's TV show and brings even more drama to the set.",
                        "air_date": "2003-01-09",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The One with Phoebe's Rats",
                        "overview": "Gavin gives Rachel a very interesting birthday gift while Ross begs Joey to stay away from Emma's hot new nanny. Meanwhile, Mike meets and then accidentally murders Phoebe's unusual pet.",
                        "air_date": "2003-01-16",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The One Where Monica Sings",
                        "overview": "A night at Mike's piano bar gives Monica a very showy moment in the spotlight. Ross struggles to move on after witnessing Gavin and Rachel kiss. Meanwhile, Chandler employs his secret skill to repair Joey's botched eyebrow-waxing job.",
                        "air_date": "2003-01-30",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The One with the Blind Dates",
                        "overview": "Phoebe and Joey purposely set Ross and Rachel up on bad dates in the hopes they'll get back together. Meanwhile, Monica and Chandler babysit Emma, and aren't being as responsible as they should be.",
                        "air_date": "2003-02-06",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The One with the Mugging",
                        "overview": "Joey endures a draining audition at the hands of a pompous actor-director. Ross and Phoebe discover a secret link after being mugged together on the street. Chandler's advertising internship gets off to an impressive start.",
                        "air_date": "2003-02-13",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The One with the Boob Job",
                        "overview": "While reviewing their monthly expenses, Monica and Chandler discover that their situation is less than stellar. This results in Monica asking Joey to lend her some money without telling Chandler. When Chandler eventually finds out, Joey comes up with a lie that Monica needs the money for breast enhancement procedure. Meanwhile, Phoebe gets really excited as she and Mike decide to move in together, but her excitement quickly dissipates once she discovers that Mike doesn't see himself getting married ever again. Also, Rachel's attempt to baby-proof the apartment tampers with a frustrated Joey's sanity.",
                        "air_date": "2003-02-20",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The One with the Memorial Service",
                        "overview": "Chandler's jokey entry on his and Ross's college website leads to a faux burial service for the allegedly dead and obviously unpopular Gellar. Meanwhile, Joey is unwilling to give his favorite stuffed animal, Hugsy, to Emma. And Phoebe asks Monica to help her avoid a post-breakup tryst with Mike.",
                        "air_date": "2003-03-13",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The One with the Lottery",
                        "overview": "Monica leads the gang, except for a scoffing Ross, to purchase a bunch of lottery tickets for the multi-million-dollar powerball jackpot. However, as they gleefully plot about how they will spend the fortune if they win, they start bickering among themselves until Phoebe takes matters into her own hands. Meanwhile, Chandler frets as he waits for a phone call about a hiring job position and Rachel thinks baby Emma is close to saying her first words.",
                        "air_date": "2003-04-03",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The One with Rachel's Dream",
                        "overview": "After visiting the set of \"Days of Our Lives\", Rachel catches herself dreaming about a romantic encounter with Joey. Meanwhile, Chandler buys a non-refundable weekend getaway for himself and Monica, but when she can't get time off at work, Ross joins him. Also, Phoebe takes advantage of Monica's restaurant clientele.",
                        "air_date": "2003-04-17",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The One with the Soap Opera Party",
                        "overview": "Joey secretly throws a party on the roof of his building for the \"Days of Our Lives\" cast and he reluctantly invites the rest of the gang, once they discover his plans. Meanwhile, Ross meets a new colleague, Charlie, and is instantly attracted to her, however, he feels intimidated once he learns about her accomplished ex-boyfriends. Also, everyone forgets to tell Chandler about the change of plans and he gets stuck at a theater play by himself.",
                        "air_date": "2003-04-24",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The One with the Fertility Test",
                        "overview": "Joey comes to Ross for advice on dating Charlie, since they don't share much of the same interests. Meanwhile, Chandler and Monica bump into Janice at a fertility clinic. Also, Rachel has a gift certificate for a massage at a fancy massage place which Phoebe doesn't want her to use, since she doesn't approve of big corporations.",
                        "air_date": "2003-05-01",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The One with the Donor",
                        "overview": "Rachel and Phoebe take Joey's girlfriend Charlie shopping, where she overhears the two of them gossiping about Joey. Meanwhile, Ross gives a presentation to a fellow professor in the hopes of getting the role of keynote speaker at the paleontology convention in Barbados. Also, Monica and Chandler consider alternate pregnancy options making some people really uncomfortable in the process.",
                        "air_date": "2003-05-08",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The One in Barbados",
                        "overview": "The gang heads down to Barbados for the paleontology conference. While Ross and Charlie are excited about attending multiple seminars, the rest of the gang just want to enjoy their time on the beach but the rainy weather prevents them from doing so. Things, however, are far from boring - Phoebe discovers that she still has feelings for Mike even though she enjoys spending time with David, Rachel feels lonely and struggles to keep her feelings about Joey to herself, and Chandler is amused by Monica's hair.",
                        "air_date": "2003-05-15",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 10,
                "episode_count": 17,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The One After Joey and Rachel Kiss",
                        "overview": "After leaving Barbados, Joey and Ross both attempt to come clean to each other that they're dating Rachel and Charlie, however, various obstacles constantly get in their way. Meanwhile, Monica gets a new haircut much to Chandler's dismay and Phoebe finds out that Mike has another girlfriend.",
                        "air_date": "2003-09-25",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The One Where Ross Is Fine",
                        "overview": "After Ross finds out about Joey and Rachel's relationship, he invites Rachel, Joey and Charlie to a dinner party at his apartment, which ends up being really uncomfortable for everyone involved. Meanwhile, Monica and Chandler are overwhelmed by various adoption options and Phoebe suggests talking to a couple that has gone through the process. Unfortunately things go sideways when Chandler can't keep his big mouth shut. Also, Phoebe is visited by her brother, Frank Jr., who is desperate because he can no longer cope with his precocious triplets.",
                        "air_date": "2003-10-02",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The One with Ross's Tan",
                        "overview": "Ross goes to a spray-on tanning salon but fails to follow the 'simple' instructions. Meanwhile, Joey and Rachel struggle to make the transition from friends to lovers. Also, Monica and Phoebe try to avoid an annoying woman that used to live in their building.",
                        "air_date": "2003-10-09",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The One with the Cake",
                        "overview": "On Emma's first birthday, Ross and Rachel convince everyone to delay their plans so they can attend her party, however plans go awry when Emma's birthday cake is revealed.",
                        "air_date": "2003-10-23",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The One Where Rachel's Sister Babysits",
                        "overview": "To help her younger sister, Amy, become a more responsible person, Rachel overrides Ross' strong protests and allows Amy to baby-sit Emma but soon regrets that decision. Meanwhile, Joey volunteers to write a recommendation letter for Monica and Chandler's adoption agency, however, he's concerned about not sounding smart. Also, Phoebe unknowingly thwarts Mike's \"anniversary\" surprise for her.",
                        "air_date": "2003-10-30",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The One with Ross's Grant",
                        "overview": "Ross has a chance to be selected by Dr. Benjamin Hobart for an esteemed paleontology grant. Unfortunately, Hobart happens to be Charlie's obsessed ex-boyfriend. Meanwhile, Phoebe tries to give a hideous painting she created to an extremely reluctant Monica and Rachel. Also, Joey is offended when Chandler lies about viewing Joey's bizarre audition tape reel.",
                        "air_date": "2003-11-06",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The One with the Home Study",
                        "overview": "Monica and Chandler nervously prepare for a visit from an adoption worker who will decide if they would be suitable parents. Meanwhile, Phoebe and Mike keep changing their minds about donating their wedding money to a children's charity. And Ross tries to help Rachel overcome her fear of swing sets so that baby Emma can enjoy the playground.",
                        "air_date": "2003-11-13",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The One with the Late Thanksgiving",
                        "overview": "Joey, Ross, Rachel and Phoebe convince Monica and Chandler to host a Thanksgiving dinner, however the four of them end up arriving an hour late as the boys decide to go to Rangers game, while the girls take Emma to a baby beauty pageant. This enrages Monica and she refuses to let the famished guests into her and Chandler's apartment which causes even bigger problems.",
                        "air_date": "2003-11-20",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The One with the Birth Mother",
                        "overview": "Nervous and excited, Monica and Chandler travel to Ohio to meet a young pregnant woman, Erica Simmons, who is considering allowing them to adopt her child when it's born. Upon meeting her they discover that due to a mix-up at the adoption agency, Erica thinks that Monica is a reverend and Chandler is a doctor. Meanwhile, Joey dates Phoebe's friend but annoys her with his territorial eating habits. Also Rachel picks out an outfit for Ross to wear on a date but due to a mix up he ends up in an awkward position.",
                        "air_date": "2004-01-08",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The One Where Chandler Gets Caught",
                        "overview": "Phoebe and Rachel catch Chandler getting into a car with a blonde woman, they follow him to the suburbs. Fearing that Chandler is cheating on Monica, they inform her--and learn that the woman is a real estate agent. The pair has been secretly shopping for houses and struggling with how to tell their best friends. The friends reminisce about their good times in the apartment.",
                        "air_date": "2004-01-15",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The One Where the Stripper Cries",
                        "overview": "Joey is a celebrity contestant on \"The $100,000 Pyramid,\" with its actual host, Donny Osmond. Meanwhile, Phoebe's bachelorette party features a rather unexpected surprise when the stripper shows up. Also, Chandler and Ross attend a college reunion and flash back to 1987 to reflect on a pact they made when they were in college.",
                        "air_date": "2004-02-05",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The One with Phoebe's Wedding",
                        "overview": "As the big day approaches, Phoebe's wedding planner, Monica, makes everyone around her crazy because according to her - every little thing needs to happen around schedule. This doesn't sit well with Phoebe and she fires her. Unfortunately, on the wedding day New York is hit with the worst snowstorm its seen in 20 years, forcing plans to change. As a substitute for Phoebe's incarcerated father, Joey takes his role much too seriously. Meanwhile, Chandler and Ross discover that neither of them has a part in the wedding; however, after one of Mike's groomsmen is unable to attend, they compete for the open position by any means necessary.",
                        "air_date": "2004-02-12",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The One Where Joey Speaks French",
                        "overview": "Joey implores Francophile Phoebe to teach him French before an important audition, but she quickly becomes exasperated. Surrogate mom Erica is visiting town and tells the Bings that the baby's father may be a shovel killer. Ross and Rachel grow closer after her sarcastic father, Dr. Green, suffers a heart attack.",
                        "air_date": "2004-02-19",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The One with Princess Consuela",
                        "overview": "Monica and Chandler visit their house, which is in escrow, where Joey is comforted about losing his friends by the 8-year-old girl who presently lives there.  Phoebe learns she can legally change her name to whatever she wants, so she considers something more exotic. Ross gets tenure at his job. Rachel's boss is sitting next to her in a restaurant while she's interviewing for another job.",
                        "air_date": "2004-02-26",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The One Where Estelle Dies",
                        "overview": "When Rachel makes a startling announcement, Ross secretly schemes to get her former job back for her. Joey is so flustered by all of the upheaval in his friends' lives that Phoebe prevents him from learning about the sudden death of his agent. Monica and Chandler check out the house for sale next door to their new home--and make a stunning discovery.",
                        "air_date": "2004-04-22",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The One with Rachel's Going Away Party",
                        "overview": "With Rachel leaving tomorrow, the gang hosts a farewell party for her. She says goodbye to each of her friends individually, except for Ross and he's offended. Monica precisely packs for her new life in the suburbs with Chandler, and they keep a watchful eye on the extremely pregnant Erica, who is in town until the baby arrives.",
                        "air_date": "2004-04-29",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The Last One",
                        "overview": "Ross and Phoebe chase Rachel to the airport, but end up at the wrong one. Chandler and Monica finish packing for their move to the suburbs, and Joey loses Chick Jr. and Duck Jr. in the foosball table.\n\nThe series finale finds Rachel, Monica, Phoebe, Joey, Chandler and Ross embarking on the next chapters in their lives. The six of them have been there for one another through all the ups and downs of becoming adults. Now it's their last day together, and it's one of momentous events and last-minute surprises. Even as the friends make major decisions, they share a bond that will last forever.",
                        "air_date": "2004-05-06",
                        "watched": false
                    }
                ]
            }
        ]
    },
    {
        "title": "Seinfeld",
        "status": "ongoing",
        "rating": 0,
        "overview": "A stand-up comedian and his three offbeat friends weather the pitfalls and payoffs of life in New York City in the '90s. It's a show about nothing.",
        "poster": "https://image.tmdb.org/t/p/w500/aCw8ONfyz3AhngVQa1E2Ss4KSUQ.jpg",
        "year": "1989",
        "tmdb_rating": 8.3,
        "seasons": [
            {
                "season_number": 1,
                "episode_count": 5,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Seinfeld Chronicles",
                        "overview": "Jerry is ecstatic that a woman he met on the road is coming to stay with him in New York. George and Kramer weigh in on how Jerry should best approach the situation.",
                        "air_date": "1989-07-05",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Stake Out",
                        "overview": "Jerry meets an attractive woman at a party but by the time she leaves, he has only learned where she works. Jerry stakes out the mystery woman's office with George so that he can “casually” bump into her.",
                        "air_date": "1990-05-31",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Robbery",
                        "overview": "Jerry is robbed after Kramer fails to close the apartment door. Elaine talks Jerry into looking at a fabulous apartment in the hopes that she can then have Jerry’s place. Things are further complicated when George decides he wants the new place too.",
                        "air_date": "1990-06-07",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "Male Unbonding",
                        "overview": "Jerry tries to “break-up” with his obnoxious childhood friend but his pathetic weeping leads Jerry to give him another chance. Elaine helps Jerry come up with excuses to avoid him.",
                        "air_date": "1990-06-14",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Stock Tip",
                        "overview": "After George receives a stock tip, he and Jerry take the financial plunge. Elaine and her allergies battle her boyfriend’s cats. Meanwhile,Jerry’s weekend getaway with his new girlfriend proves to be a relationship killer.",
                        "air_date": "1990-06-21",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 2,
                "episode_count": 12,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Ex-Girlfriend",
                        "overview": "George has doubts about his current relationship that he broke off. Elaine is curious about a relationship that she has with a guy in her building that has degenerated over the past two years. Jerry is reluctantly drawn into George's ex-relationship when he picks up some books left at her apartment. Although he wants to break it off with her, she has this \"psycho-sexual\" hold over him and he becomes worried about what George might think if he lets this relationship develop. Elaine confronts the guy in her building and Jerry's relationship maybe in jeopardy when his girlfriend sees his act.",
                        "air_date": "1991-01-23",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Pony Remark",
                        "overview": "Jerry's parents come to town for a 50th anniversary party. Jerry bets Kramer that he won't complete his plans to renovate his apartment with levels in a month. Jerry takes Elaine to the dinner and he makes an observation about children who have ponies, this remark offends the guest of honor. When she dies soon afterwards, Jerry wonders if he should go to the funeral or go to his championship softball game. Elaine wonders about the fate of the apartment, when she hears the widower is moving to Arizona. George wonders if it will ever be possible for him to have sex again.",
                        "air_date": "1991-01-30",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Jacket",
                        "overview": "Jerry buys a real expensive new suede jacket with a colorful inner lining. George has a song from Les Miserables that he just can't get out of his mind. Kramer is supposed pickup a magician friend's doves, and needs someone to help him for two minutes; Elaine takes on the job. Kramer promises she'll get \"a lift\" to the hotel where Jerry and George are meeting her and her father, Alton Benes, an author cut from Hemingway cloth. Jerry and George suffer while waiting with Elaine's father. When it begins to snow, Jerry turns his new jacket inside out, to protect it, but Alton Benes doesn't want to be seen on the street with him.",
                        "air_date": "1991-02-06",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Phone Message",
                        "overview": "George blows an invitation upstairs with his latest girlfriend and then when he tries to make restitution he leaves progressively nastier messages on her answering machine. He gets the chance to prevent her from hearing her messages by having Jerry switch the tape out of her machine, while he distracts her. Jerry and his girlfriend have a disagreement about a TV commercial for Dockers, and his telling his friends about their conflict.",
                        "air_date": "1991-02-13",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Apartment",
                        "overview": "Kramer tries mousse in his hair. Jerry gets Elaine an opportunity to get the apartment right above him, before he realizes the possible implications. George tests the \"man with a wedding band\" theory of meeting women.",
                        "air_date": "1991-04-04",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Statue",
                        "overview": "Jerry has a box of stuff his grandfather left him. Inside is an interesting looking statue that could replace one George's parents had years ago, but he broke. George plans to pick the statue up later but in the meantime he tells his parents about the replacement statue. Meanwhile the boyfriend of a bitter Finnish author (whose latest work Elaine is going to edit) is going to clean Jerry's apartment. When Jerry returns to his apartment it is cleaned beyond reason. Later when Jerry and Elaine are at the author's apartment, they see the statue on her mantelpiece. Getting it back may jeopardize Elaine's chance at being an editor, but save George from his parent's wrath.",
                        "air_date": "1991-04-11",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Revenge",
                        "overview": "George quits his job in a huff after he is demoted to using the regular bathroom. Newman tells Kramer that he plans to jump off the building. Jerry suggests that George just go back into work next Monday morning and pretend like nothing happened; however, that doesn't work. Newman jumps, from the second floor. George plots revenge, and with Elaine's help, tries to slip his boss \"a Mickey.\" Jerry suspects that his launderer is a larcenist after he discovers that $1500 he had stashed in his laundry bag is missing. Kramer helps Jerry get revenge by bringing a bag of concrete in to put into one of the wash machines.",
                        "air_date": "1991-04-18",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The Heart Attack",
                        "overview": "George thinks he's had a heart attack. The doctor tells him otherwise, but he might want to get his tonsils and adenoids removed. Elaine is interested in the doctor and he is interested in her tongue. George not wanting to deal with the cost, follows Kramer's suggestion of going to a holistic healer. The healer's cure turns George purple and the ride to the hospital is delayed over a Chuckle.",
                        "air_date": "1991-04-25",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Deal",
                        "overview": "Jerry and Elaine are watching TV late at night and stumble across \"naked people\" and that gets them both discussing whether they could have a relationship and not jeopardize their friendship. George says it can't be done, but Jerry and Elaine devise \"a system\"; however, it develops a little trouble when her birthday comes along.",
                        "air_date": "1991-05-02",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Baby Shower",
                        "overview": "Elaine needs to use Jerry's apartment to hold a baby shower for a woman that once dated George. George reflects that she was \"unequivocally the worst date of my life.\" Jerry has to go out of town for a show, so he lets Elaine use the apartment. Kramer sells Jerry on the idea on getting an illegal cable hookup. The party begins. The cable guys come to install the hookup. Jerry's show gets canceled, so he returns to the apartment with George (who's prepared to confront the bad date). Jerry is the victim of his own confrontation.",
                        "air_date": "1991-05-16",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Chinese Restaurant",
                        "overview": "Jerry, Elaine and George stop for a quick Chinese dinner before a showing of Plan 9 From Outer Space on the big screen. However, while waiting a really long time to get a table, Jerry sees a woman whose name he can't recall; George needs to use a phone he can't have and Elaine needs food, more than those seated ahead of them.",
                        "air_date": "1991-05-23",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The Busboy",
                        "overview": "George inadvertently meddles in the life of a busboy, by getting him fired. He tries to rectify things; however, he winds up compounding them by losing the busboy's cat. Elaine discovers that a week is much too long to have a houseguest. She does everything in her power to get him out. The busboy's life is saved and made for the better after his involvement with George, until he meets Elaine's houseguest.",
                        "air_date": "1991-06-26",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 3,
                "episode_count": 23,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Note",
                        "overview": "Physical therapy proves painful as Jerry has a misunderstanding with his therapist; and he finds a way for insurance to cover treatment for Elaine and a paranoid George.",
                        "air_date": "1991-09-18",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Truth",
                        "overview": "George's relationship with a former IRS worker eases Jerry's tax worries--until she becomes George's former relationship; Kramer sees too much of Elaine while seeing her roommate.",
                        "air_date": "1991-09-25",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Pen",
                        "overview": "Elaine regrets accompanying Jerry on a visit to his parents, where local gossip includes how Jerry acquired a pen that writes upside down.",
                        "air_date": "1991-10-02",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Dog",
                        "overview": "Jerry's gig as a dog sitter provides some time alone to George and Elaine, who find they have little to say.",
                        "air_date": "1991-10-09",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Library",
                        "overview": "A library cop says Jerry is 20 years overdue with a steamy novel.",
                        "air_date": "1991-10-16",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Parking Garage",
                        "overview": "Saturday at the mall with the gang, none of whom bothered to note where the car was parked.",
                        "air_date": "1991-10-30",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Cafe",
                        "overview": "While Jerry tries to help a cafe owner, Elaine tries to help George with an IQ test, and Kramer...well, nobody can help Kramer.",
                        "air_date": "1991-11-06",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The Tape",
                        "overview": "George is hot for a potential baldness remedy, and for Elaine after she plays a joke on Jerry.",
                        "air_date": "1991-11-13",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Nose Job",
                        "overview": "Kramer is the catalyst for George to urge his otherwise wonderful girlfriend to get a nose job, while Jerry dates a beauty whose brain is a beaut.",
                        "air_date": "1991-11-20",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Stranded",
                        "overview": "Jerry pays a high price for being stranded at a party by George, who pays the price for romance in the workplace but forgets to pay for something else.",
                        "air_date": "1991-11-27",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Alternate Side",
                        "overview": "Jerry gets his car stolen; Kramer gets a line in a Woody Allen film; George gets a job; and Elaine gets tired of her boyfriend.",
                        "air_date": "1991-12-04",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The Red Dot",
                        "overview": "An imperfection mars George's gift to Elaine; Jerry inadvertently helps an alcoholic go off the wagon.",
                        "air_date": "1991-12-11",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Subway",
                        "overview": "A beauty picks up George; Jerry makes friends with a naked guy; Kramer is tipped off about a hot horse; Elaine gets stuck en route to a lesbian wedding.",
                        "air_date": "1992-01-08",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The Pez Dispenser",
                        "overview": "Kramer's advice gives George \"the upper hand\" in his relationship with a pianist, whose recital is ruined by Elaine's outburst of laughter.",
                        "air_date": "1992-01-15",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The Suicide",
                        "overview": "A psychic warns George to cancel his vacation; Jerry is hit on by his neighbor's girl after the neighbor's suicide attempt; Elaine fasts.",
                        "air_date": "1992-01-29",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The Fix-Up",
                        "overview": "Jerry and Elaine fix up George with Elaine's friend--then wait nervously.",
                        "air_date": "1992-02-05",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The Boyfriend (1)",
                        "overview": "Jerry becomes friends with baseball's Keith Hernandez, who has a history with Kramer and would like a future with Elaine.",
                        "air_date": "1992-02-12",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The Boyfriend (2)",
                        "overview": "Jerry and Elaine compete for the attention of baseball's Keith Hernandez, while Kramer and Newman investigate a spitting incident involving Hernandez.",
                        "air_date": "1992-02-12",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The Limo",
                        "overview": "Jerry and George take a limo meant for another, whose agenda includes more than just getting in from the airport.",
                        "air_date": "1992-02-26",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The Good Samaritan",
                        "overview": "Jerry witnesses an accident--and is attracted to the victim and the perpetrator.",
                        "air_date": "1992-03-04",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The Letter",
                        "overview": "Kramer sits for Jerry's artist girlfriend, but Jerry won't stand for her temperament, until she declares her feelings.",
                        "air_date": "1992-03-25",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The Parking Space",
                        "overview": "George argues with a stranger over a \"dream\" parking space in front of Jerry's apartment.",
                        "air_date": "1992-04-22",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The Keys",
                        "overview": "Kramer hits the road after a dispute over his use of his keys to Jerry's apartment.",
                        "air_date": "1992-05-06",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 4,
                "episode_count": 24,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Trip (1)",
                        "overview": "Jerry and George look for Kramer in Hollywood, where Kramer's new friend becomes a victim.",
                        "air_date": "1992-08-12",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Trip (2)",
                        "overview": "Jerry and George find Kramer, whose past is laid out by the lieutenant seeking his confession.",
                        "air_date": "1992-08-19",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Pitch",
                        "overview": "A show about \"nothing\" is George's pitch to network execs interested in a series for Jerry.",
                        "air_date": "1992-09-16",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Ticket",
                        "overview": "Jerry and George take another meeting; Kramer testifies for Newman in a speeding-ticket protest.",
                        "air_date": "1992-09-16",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Wallet",
                        "overview": "Jerry's dad has a bad time at the back doctor's; Elaine wants to part with her boyfriend; Jerry's unhappy with George's network \"negotiating.\"",
                        "air_date": "1992-09-23",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Watch",
                        "overview": "The network president doesn't play George's game; Jerry deals for his \"broken\" watch; Elaine is a hot topic in the office of her psychiatrist boyfriend.",
                        "air_date": "1992-09-30",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Bubble Boy",
                        "overview": "A weekend is kaput, partly because of George's driving.",
                        "air_date": "1992-10-07",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The Cheever Letters",
                        "overview": "Elaine's assistant has words with Jerry, who has few with George; Kramer deals for more Cuban cigars.",
                        "air_date": "1992-10-28",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Opera",
                        "overview": "The man who's threatening Jerry is the same Joe who's dating Elaine.",
                        "air_date": "1992-11-04",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Virgin",
                        "overview": "Jerry courts a woman with a tame past; George makes a bad move at a meeting; a man disagrees with Elaine.",
                        "air_date": "1992-11-11",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Contest",
                        "overview": "George's mom lands in the hospital; a contest begins among Jerry, George, Kramer and Elaine, involving a naked woman and an attractive man.",
                        "air_date": "1992-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The Airport",
                        "overview": "On a flight to NYC, Jerry has a first-class time, but Elaine suffers in coach. Meanwhile, Kramer and George try to hit the right airport.",
                        "air_date": "1992-11-25",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Pick",
                        "overview": "Kramer makes Elaine's Christmas card a collector's item, and settles an argument with a designer; Jerry is caught in a human moment by his new female friend; George pleads to make up with Susan.",
                        "air_date": "1992-12-16",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The Movie",
                        "overview": "The difficulties met by four persons trying to meet at one movie.",
                        "air_date": "1993-01-06",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The Visa",
                        "overview": "A lawyer George dates could help Jerry's pal, who's facing deportation, thanks, in part, to Kramer's trip to Florida.",
                        "air_date": "1993-01-27",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The Shoes",
                        "overview": "There's something about Elaine's shoes that leads to the stalling of George and Jerry's TV pilot, until Elaine gives it a kick.",
                        "air_date": "1993-02-04",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The Outing",
                        "overview": "Elaine's prank leads a reporter to believe Jerry and George are a gay couple.",
                        "air_date": "1993-02-11",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The Old Man",
                        "overview": "Volunteering with seniors...Elaine is enthralled by hers, George gets fired and Jerry loses his.",
                        "air_date": "1993-02-18",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The Implant",
                        "overview": "Jerry adopts Elaine's opinion about a woman he's seeing; then Elaine changes her mind.",
                        "air_date": "1993-02-25",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The Junior Mint",
                        "overview": "Jerry can't remember the name of his date, and he observes a splenectomy.",
                        "air_date": "1993-03-18",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The Smelly Car",
                        "overview": "An odor in Jerry's car seeps into the love life of Elaine.",
                        "air_date": "1993-04-15",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The Handicap Spot",
                        "overview": "There are many repercussions after the gang parks in a handicap space.",
                        "air_date": "1993-05-13",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The Pilot (1)",
                        "overview": "Kramer wants to audition for Jerry and George's pilot; and the network president becomes obsessed with Elaine.",
                        "air_date": "1993-05-20",
                        "watched": false
                    },
                    {
                        "episode_number": 24,
                        "name": "The Pilot (2)",
                        "overview": "The pilot is cast, taped and aired, but George doesn't think he'll live to see its success.",
                        "air_date": "1993-05-20",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 5,
                "episode_count": 22,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Mango",
                        "overview": "Jerry shares George's self-doubt after Elaine admits not all was as it seemed during their romantic relationship.",
                        "air_date": "1993-09-16",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Puffy Shirt",
                        "overview": "Jerry's appearance with Bryant Gumbel is not the expected career boost for Kramer's girlfriend; but George gets a new career after moving back with his parents.",
                        "air_date": "1993-09-23",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Glasses",
                        "overview": "Kramer's optometrist pal replaces George's glasses with suspect frames.",
                        "air_date": "1993-09-30",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Sniffing Accountant",
                        "overview": "Jerry thinks his accountant may be on drugs; George's passion wins him a job; Elaine's exclamations end her relationship.",
                        "air_date": "1993-10-07",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Bris",
                        "overview": "Godparenting is a chore for Jerry and Elaine; tragedy befalls George's car; Kramer decries a genetic experiment.",
                        "air_date": "1993-10-14",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Lip Reader",
                        "overview": "A tennis lineswoman is game to help George learn why he's been dumped.",
                        "air_date": "1993-10-28",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Non-Fat Yogurt",
                        "overview": "Jerry and Elaine's suspicion about \"nonfat\" yogurt figures into New York City's mayoral race.",
                        "air_date": "1993-11-04",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The Barber",
                        "overview": "Jerry wants to switch barbers without hurting anyone's feelings; George goes to work, but was he hired?",
                        "air_date": "1993-11-11",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Masseuse",
                        "overview": "Jerry's masseuse-girlfriend doesn't like George; Elaine's boyfriend shares a moniker with a mass murderer.",
                        "air_date": "1993-11-18",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Cigar Store Indian",
                        "overview": "Reading TV Guide nets Elaine an admirer, but gets her into trouble with George's father; Jerry's gift to Elaine offends her friend.",
                        "air_date": "1993-12-09",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Conversion",
                        "overview": "George wants to change religions for the sake of romance, while Kramer is attracted to a novice nun.",
                        "air_date": "1993-12-16",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The Stall",
                        "overview": "George is charmed by Elaine's new boyfriend; Kramer thinks Jerry's new girlfriend is his phone-sex mate.",
                        "air_date": "1994-01-06",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Dinner Party",
                        "overview": "A \"brief\" stop to buy gifts for a dinner party becomes an ordeal thanks to George's big coat.",
                        "air_date": "1994-02-03",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The Marine Biologist",
                        "overview": "A writer hits a woman in the head with Elaine's electronic organiser; George lies to impress a woman.",
                        "air_date": "1994-02-10",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The Pie",
                        "overview": "A mannequin resembles Elaine; George battles for a bargain suit; Jerry wonders why his date won't try a pie; Kramer has an itch.",
                        "air_date": "1994-02-17",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The Stand-In",
                        "overview": "George postpones breaking up with his girlfriend; Kramer befriends a fellow soap-opera stand-in; and Jerry bombs trying to cheer up a sick friend.",
                        "air_date": "1994-02-24",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The Wife",
                        "overview": "Jerry's girlfriend poses as his wife to get in on his dry-cleaning discount.",
                        "air_date": "1994-03-17",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The Raincoats (1)",
                        "overview": "Kramer plans to profit from raincoats created by Jerry's dad; George sells his dad's old \"cruisewear.\"",
                        "air_date": "1994-04-28",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The Raincoats (2)",
                        "overview": "The sale of Morty's raincoats is delayed; George tries to buy back his dad's clothes.",
                        "air_date": "1994-04-28",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The Fire",
                        "overview": "George embarrasses himself at a kids' birthday party; Jerry heckles back at a heckler.",
                        "air_date": "1994-05-05",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The Hamptons",
                        "overview": "In the Hamptons, George's date sunbathes topless; Kramer steals lobsters; and a handsome doctor compliments Elaine, or does he?",
                        "air_date": "1994-05-12",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The Opposite",
                        "overview": "George changes his life by going against his instincts; Kramer plugs his book on \"Live with Regis and Kathie Lee.\"",
                        "air_date": "1994-05-19",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 6,
                "episode_count": 24,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Chaperone",
                        "overview": "Kramer supervises Jerry's date with a Miss America contestant; George gets the Yankees to wear cotton; Elaine tries to fill the shoes of a late book editor.",
                        "air_date": "1994-09-22",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Big Salad",
                        "overview": "Kramer fears a golf dispute has pushed his opponent to murder; Jerry dates a woman whom Newman rejected.",
                        "air_date": "1994-09-29",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Pledge Drive",
                        "overview": "Elaine mistakes a man for a woman on the phone; George gets baseball's Danny Tartabull to join Jerry at a fund-raiser.",
                        "air_date": "1994-10-06",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Chinese Woman",
                        "overview": "Jerry makes a blind date; Kramer makes a change to increase his sperm count.",
                        "air_date": "1994-10-13",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Couch",
                        "overview": "Freedom-of-choice issues disrupt Elaine's new relationship and Kramer's business; George watches a video instead of reading his book-club book.",
                        "air_date": "1994-10-27",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Gymnast",
                        "overview": "His girl's mom sees George as a bum; Kramer encourages Jerry to make the most of dating a gymnast; 3-D art mesmerizes Mr. Pitt.",
                        "air_date": "1994-11-03",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Soup",
                        "overview": "Jerry pays dearly for a \"free\" suit from a comic; Elaine has a beau who's no gentleman; George's way with words ends his relationship with a waitress.",
                        "air_date": "1994-11-10",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The Mom & Pop Store",
                        "overview": "George buys a car thinking it was owned by Jon Voight; Kramer tries to save a mom-and-pop store; Elaine gets her boss into the Macy's Thanksgiving Day Parade.",
                        "air_date": "1994-11-17",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Secretary",
                        "overview": "Clothing problems are a hang-up; George hires a secretary.",
                        "air_date": "1994-12-08",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Race",
                        "overview": "Jerry dates a woman whose boss has a grudge against him; Elaine dates a Communist whose ideology spreads to George and Kramer.",
                        "air_date": "1994-12-15",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Switch",
                        "overview": "George suspects that his girlfriend is bulimic; Jerry dates a woman who has a friendlier roommate; Elaine loans out her boss's tennis racket.",
                        "air_date": "1995-01-05",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The Label Maker",
                        "overview": "George objects to his girlfriend's roommate; Super Bowl tickets make the rounds as plans change.",
                        "air_date": "1995-01-19",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Scofflaw",
                        "overview": "George fails to keep a secret about a friend; Kramer fingers Newman as a scofflaw.",
                        "air_date": "1995-01-26",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The Highlights of 100 (1)",
                        "overview": "The first of a two-part collection of highlights from the first 100 shows includes the characters' ambitions and outside relationships; and George explaining the \"show about nothing.\"",
                        "air_date": "1995-02-02",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The Highlights of 100 (2)",
                        "overview": "The conclusion of a two-part collection of highlights from the first 100 shows includes the characters' concern about their self-images. Also: the evolution of \"the contest\"; how \"marine biologist\" George saved a beached whale.",
                        "air_date": "1995-02-02",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The Beard",
                        "overview": "A toupee qualifies George to date Kramer's friend; Elaine tries to change a gay man; Jerry owns up to watching \"Melrose Place.\"",
                        "air_date": "1995-02-09",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The Kiss Hello",
                        "overview": "A physical therapist bothers Jerry, angers George and attracts Kramer. Meanwhile, Kramer promotes friendliness within his building.",
                        "air_date": "1995-02-16",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The Doorman",
                        "overview": "Jerry runs afoul of a doorman; Kramer invents a bra for men. Elaine offends Mr. Pitt's neighbor.",
                        "air_date": "1995-02-23",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The Jimmy",
                        "overview": "A gym member teams with George in business and makes a date with Elaine to see Mel Torme; Jerry suspects his dentist of hanky-panky.",
                        "air_date": "1995-03-16",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The Doodle",
                        "overview": "Jerry's family lives it up at the Plaza for free, thanks to Elaine; the fumigation of Jerry's apartment disables Kramer's taste buds.",
                        "air_date": "1995-04-06",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The Fusilli Jerry",
                        "overview": "Jerry's mechanic \"steals\" his lovemaking technique; someone's license plates enhance Kramer's image; Mrs. Costanza gets an eye job.",
                        "air_date": "1995-04-27",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The Diplomat's Club",
                        "overview": "A booking agent is overly attentive to Jerry; Pitt puts Elaine in his will; Kramer starts gambling again.",
                        "air_date": "1995-05-04",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The Face Painter",
                        "overview": "Elaine's boyfriend is too zealous a hockey fan; George ventures saying \"I love you\"; Kramer has an altercation with a chimp.",
                        "air_date": "1995-05-11",
                        "watched": false
                    },
                    {
                        "episode_number": 24,
                        "name": "The Understudy",
                        "overview": "Jerry dates Bette Midler's understudy, who gets the call after George injures Bette; Elaine suspects she's being insulted in Korean.",
                        "air_date": "1995-05-18",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 7,
                "episode_count": 24,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Engagement",
                        "overview": "Jerry reneges on his pact with George to be more like \"grown-up men\"; Newman takes care of a barking dog that keeps Elaine awake.",
                        "air_date": "1995-09-21",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Postponement",
                        "overview": "Elaine shares her feelings about George with the wrong person. Meanwhile, George discovers the power of tears.",
                        "air_date": "1995-09-28",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Maestro",
                        "overview": "A maestro impresses Elaine, jeopardizes Kramer's lawsuit and makes Jerry curious about housing in Italy.",
                        "air_date": "1995-10-05",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Wink",
                        "overview": "George's involuntary winking is misinterpreted by many, and prompts Kramer to seek a favor from Yankee Paul O'Neill; Jerry tries to hide his distaste for meat from Elaine's cousin.",
                        "air_date": "1995-10-12",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Hot Tub",
                        "overview": "An Olympic athlete stays at Elaine's; George picks up colloquialisms from Houston Astros execs; Kramer installs a hot tub at his pad.",
                        "air_date": "1995-10-19",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Soup Nazi",
                        "overview": "Cooing between Jerry and his girlfriend irritates George; Elaine runs afoul of a soup vendor; Kramer loses Elaine's armoire to muggers.",
                        "air_date": "1995-11-02",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Secret Code",
                        "overview": "George dines with Elaine's boss; Jerry's sleeping foot costs him a commercial; Kramer gives traffic advice to firemen.",
                        "air_date": "1995-11-09",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The Pool Guy",
                        "overview": "An acquaintance latches on to Jerry; George objects to Susan's relationship with his pals; Kramer's new phone number brings many wrong numbers.",
                        "air_date": "1995-11-16",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Sponge",
                        "overview": "Elaine holds a monopoly on the contraceptive devices that Susan prefers; Kramer refuses to wear a ribbon on his AIDS walk.",
                        "air_date": "1995-12-07",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Gum",
                        "overview": "Kramer is overprotective of a friend who had a breakdown after dating Elaine; a former neighbor is worried about George's mental stability.",
                        "air_date": "1995-12-14",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Rye",
                        "overview": "George's parents meet Susan's; Elaine fears her enthusiasm may have scared off the musician she's dating; Kramer drives a hansom cab, but feeds his steed bad fuel.",
                        "air_date": "1996-01-04",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The Caddy",
                        "overview": "Kramer sues Elaine's friend for sinking his golf career; George's apparent work ethic impresses his bosses.",
                        "air_date": "1996-01-25",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Seven",
                        "overview": "Kramer demands compensation from Elaine for his chiropractic effort; Jerry's flame always wears the same outfit.",
                        "air_date": "1996-02-01",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The Cadillac (1)",
                        "overview": "George becomes obsessed with Marisa Tomei after he's told he's her type; Jerry gives his father a Cadillac.",
                        "air_date": "1996-02-08",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The Cadillac (2)",
                        "overview": "George has a meeting with Marisa Tomei; the Cadillac Jerry buys his father sparks trouble for his dad.",
                        "air_date": "1996-02-08",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The Shower Head",
                        "overview": "Elaine fails a drug test--twice--and loses her job; Jerry talks about his Uncle Leo on \"The Tonight Show.\"",
                        "air_date": "1996-02-15",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The Doll",
                        "overview": "Susan's friend interferes with Jerry's planned jokes; Susan's doll reminds George of his mother; Frank Costanza builds a billiard room.",
                        "air_date": "1996-02-22",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The Friars Club",
                        "overview": "Elaine suspects a co-worker is faking a hearing impairment; Jerry makes a faux pas at the Friars Club after comic Pat Cooper sponsors him for membership.",
                        "air_date": "1996-03-07",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The Wig Master",
                        "overview": "Jerry gets miffed when a salesman hits on Elaine while she's with him; George suspects hookers are conducting business in his parked car.",
                        "air_date": "1996-04-04",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The Calzone",
                        "overview": "George gets his boss, George Steinbrenner, hooked on calzones, then loses his supplier; Kramer warms to clothing fresh from the dryer.",
                        "air_date": "1996-04-25",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The Bottle Deposit (1)",
                        "overview": "Jerry has an argument with his mechanic; Newman becomes obsessed with Michigan's recycling program; Elaine goes to an auction for her boss.",
                        "air_date": "1996-05-02",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The Bottle Deposit (2)",
                        "overview": "While driving a postal truck, Kramer and Newman spot Jerry's stolen car, containing Elaine's JFK golf clubs.",
                        "air_date": "1996-05-02",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The Wait Out",
                        "overview": "Jerry and Elaine see opportunities for themselves when George causes a couple to separate; Kramer can't remove his new jeans.",
                        "air_date": "1996-05-09",
                        "watched": false
                    },
                    {
                        "episode_number": 24,
                        "name": "The Invitations",
                        "overview": "Jerry falls for a woman much like himself; George wants out of his wedding, and his fiancée doesn't want Elaine in the wedding party.",
                        "air_date": "1996-05-16",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 8,
                "episode_count": 22,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Foundation",
                        "overview": "Susan's parents act to preserve her memory; Kramer gives Elaine a confidence boost after Peterman puts her in charge.",
                        "air_date": "1996-09-19",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Soul Mate",
                        "overview": "Kramer falls for the woman Jerry's seeing; George suspects he's suspected of foul play.",
                        "air_date": "1996-09-26",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Bizarro Jerry",
                        "overview": "Elaine hangs out with men who are opposites of Jerry, George and Kramer; Kramer stumbles into a white-collar job; Jerry finds a flaw in Elaine's beautiful friend.",
                        "air_date": "1996-10-03",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Little Kicks",
                        "overview": "Elaine's staff loses respect for her after seeing her dance; George benefits socially when Elaine labels him a \"bad seed\"; Kramer's friend forces Jerry into crime.",
                        "air_date": "1996-10-10",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Package",
                        "overview": "Elaine regrets peeking at her medical chart; George takes dating advice from Kramer, who also hatches a scheme to improve Jerry's stereo.",
                        "air_date": "1996-10-17",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Fatigues",
                        "overview": "An employee's military bent scares Elaine; Kramer cooks for a Jewish singles night; Jerry finds fault with his girlfriend's mentor.",
                        "air_date": "1996-10-31",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Checks",
                        "overview": "Jerry's popularity in Japan brings new friends to Kramer, and maybe new life to Jerry's TV pilot; Elaine's new beau won't share \"his song\" with her.",
                        "air_date": "1996-11-07",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The Chicken Roaster",
                        "overview": "George loses an expensive hat Elaine charged to her business account; a neon sign prompts Kramer and Jerry to swap apartments.",
                        "air_date": "1996-11-14",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Abstinence",
                        "overview": "George's intellect thrives when thoughts of sex are shut out; Elaine wants her intern to become a doctor--stat; Jerry is bumped from a school's Career Day.",
                        "air_date": "1996-11-21",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Andrea Doria",
                        "overview": "Jerry tries to help Newman get transferred; George trades tales with a shipwreck survivor to obtain a dream apartment; Kramer coughs like a dog; a minor insult has a major effect on Elaine.",
                        "air_date": "1996-12-19",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Little Jerry",
                        "overview": "George finds a new romance--in a women's prison; Kramer buys a chicken, then puts his fowl to foul use; Elaine encourages her shaved-headed beau to grow back his hair.",
                        "air_date": "1997-01-09",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The Money",
                        "overview": "Kramer's girlfriend disrupts his sleep; Jerry's parents think he needs financial aid; George ponders an inheritance.",
                        "air_date": "1997-01-16",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Comeback",
                        "overview": "Kramer arranges to die with dignity; Jerry learns his tennis consultant is a lousy player; George becomes obsessed with responding to an insult long after the fact; Elaine offends her video advisor.",
                        "air_date": "1997-01-30",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The Van Buren Boys",
                        "overview": "Gang members protest George's handling of a scholarship named for Susan; some find Jerry's new girlfriend objectionable; Peterman wants Kramer's life experiences for his own autobiography, written by Elaine.",
                        "air_date": "1997-02-06",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The Susie",
                        "overview": "Kramer becomes the spokesman for a woman George wants to avoid; Jerry's bookie welches; a co-worker mistakes Elaine for someone else, who's reported as a problem worker.",
                        "air_date": "1997-02-13",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The Pothole",
                        "overview": "Jerry has an accident with his girlfriend's toothbrush; Elaine crams herself into a restaurant's delivery boundary; Kramer alters his \"adopted\" highway.",
                        "air_date": "1997-02-20",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The English Patient",
                        "overview": "Elaine's review of a film loses her friends; a woman mistakes George for her boyfriend; Jerry visits his parents in Florida.",
                        "air_date": "1997-03-13",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The Nap",
                        "overview": "George crafts a place to nap at work; a new beau gives Elaine a mattress, which Kramer promptly soils; Jerry's kitchen is redesigned against his will.",
                        "air_date": "1997-04-10",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The Yada Yada",
                        "overview": "George adopts his girlfriend's verbal shorthand; Jerry suspects a comic motive behind his dentist's conversion to Judaism; double-daters Kramer and Mickey don't know whose date is whose.",
                        "air_date": "1997-04-24",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The Millennium",
                        "overview": "The Mets express interest in George; an inattentive saleswoman irks Elaine; Kramer prepares for his millennium party; Jerry jockeys for position on his girlfriend's speed dial.",
                        "air_date": "1997-05-01",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The Muffin Tops",
                        "overview": "George pretends he's a tourist to bond with a tourism worker; Elaine's former boss steals her million-dollar idea, while Kramer promotes a bus tour about the life of Elaine's current boss; Jerry shaves his chest hair.",
                        "air_date": "1997-05-08",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The Summer of George",
                        "overview": "Kramer's job at the Tony Awards leads to a meeting with Raquel Welch; George helps Jerry date a high-maintenance woman; Elaine is labeled catty after making a comment about a co-worker.",
                        "air_date": "1997-05-15",
                        "watched": false
                    }
                ]
            },
            {
                "season_number": 9,
                "episode_count": 24,
                "episodes": [
                    {
                        "episode_number": 1,
                        "name": "The Butter Shave",
                        "overview": "Kramer uses butter for shaving--and more; George's cane is an advantage at his new job; Jerry feels used by his comedy nemesis, Bania; Elaine breaks up with her boyfriend before their flight back from Europe.",
                        "air_date": "1997-09-25",
                        "watched": false
                    },
                    {
                        "episode_number": 2,
                        "name": "The Voice",
                        "overview": "Kramer hires an assistant; George's boss tries to force him out; Elaine bets Jerry she won't get back with her latest ex.",
                        "air_date": "1997-10-02",
                        "watched": false
                    },
                    {
                        "episode_number": 3,
                        "name": "The Serenity Now",
                        "overview": "George goes to work for his father; Jerry's girlfriend wants to see his emotions; Kramer adopts a suburban feel at home; Elaine prompts two Jewish men to renounce their faith.",
                        "air_date": "1997-10-09",
                        "watched": false
                    },
                    {
                        "episode_number": 4,
                        "name": "The Blood",
                        "overview": "Kramer stores his own blood to avoid a blood-bank fee; George tries to combine his two passions, sex and food; Elaine's plan to show responsibility backfires; Jerry trains with fitness guru Izzy Mendelbaum.",
                        "air_date": "1997-10-16",
                        "watched": false
                    },
                    {
                        "episode_number": 5,
                        "name": "The Junk Mail",
                        "overview": "Kramer battles junk mail; George thinks his parents are trying to avoid him; Jerry acquires a van; and Elaine gets a new man, whose past comes back to haunt her.",
                        "air_date": "1997-10-30",
                        "watched": false
                    },
                    {
                        "episode_number": 6,
                        "name": "The Merv Griffin Show",
                        "overview": "Kramer turns his apartment into a talk-show set; Jerry's girlfriend won't let him play with her toys; George's clash with pigeons leads to problems with a squirrel; a new employee's silent movement rattles Elaine.",
                        "air_date": "1997-11-06",
                        "watched": false
                    },
                    {
                        "episode_number": 7,
                        "name": "The Slicer",
                        "overview": "George has a past with his new boss; Jerry's \"revenge date\" backfires; Kramer's deli slicer solves Elaine's problem with a neighbor.",
                        "air_date": "1997-11-13",
                        "watched": false
                    },
                    {
                        "episode_number": 8,
                        "name": "The Betrayal",
                        "overview": "Flashbacks trace the evolution of Jerry, George and Elaine's disastrous trip to a wedding in India, and Kramer's desperate need to barter for a birthday wish.",
                        "air_date": "1997-11-20",
                        "watched": false
                    },
                    {
                        "episode_number": 9,
                        "name": "The Apology",
                        "overview": "Jerry's girlfriend is naked too often; Elaine's lifestyle offends a co-worker; Kramer seeks to shorten his showers; George has a disagreement with a new AA member.",
                        "air_date": "1997-12-11",
                        "watched": false
                    },
                    {
                        "episode_number": 10,
                        "name": "The Strike",
                        "overview": "Kramer returns to work after his 12-year strike is settled; Jerry dates a woman whose appearance fluctuates; George gives holiday gifts in his co-workers' names to a fraudulent charity.",
                        "air_date": "1997-12-18",
                        "watched": false
                    },
                    {
                        "episode_number": 11,
                        "name": "The Dealership",
                        "overview": "At a car dealership, Kramer takes a test drive, while Jerry's deal is threatened by a fight between Elaine and Puddy.",
                        "air_date": "1998-01-08",
                        "watched": false
                    },
                    {
                        "episode_number": 12,
                        "name": "The Reverse Peephole",
                        "overview": "Elaine gets into a hassle regarding fur; Jerry stops carrying a wallet, while George suffers from his overstuffed one; Kramer keeps Newman from being evicted.",
                        "air_date": "1998-01-15",
                        "watched": false
                    },
                    {
                        "episode_number": 13,
                        "name": "The Cartoon",
                        "overview": "An actress turns Jerry's criticism into a one-woman show; Kramer stops talking after offending George; Elaine struggles to understand a cartoon in The New Yorker.",
                        "air_date": "1998-01-29",
                        "watched": false
                    },
                    {
                        "episode_number": 14,
                        "name": "The Strong Box",
                        "overview": "Jerry keeps finding Kramer's hidden strongbox key. Elaine dates a mysterious man. George plans a breakup.",
                        "air_date": "1998-02-05",
                        "watched": false
                    },
                    {
                        "episode_number": 15,
                        "name": "The Wizard",
                        "overview": "Kramer retires and moves next door to Jerry's parents in Florida; Susan's parents catch George in a lie; Elaine can't tell if she's part of an interracial couple.",
                        "air_date": "1998-02-26",
                        "watched": false
                    },
                    {
                        "episode_number": 16,
                        "name": "The Burning",
                        "overview": "Kramer and Mickey play ill for med students; Elaine learns that Puddy's religious; George works out how and when to make a good exit; a tractor figures into the past of Jerry's girlfriend.",
                        "air_date": "1998-03-19",
                        "watched": false
                    },
                    {
                        "episode_number": 17,
                        "name": "The Bookstore",
                        "overview": "A bookstore busts Uncle Leo for shoplifting and George for bathroom reading; a misdeed at a company party costs Elaine; Kramer and Newman get a rickshaw, and audition homeless people to pull it.",
                        "air_date": "1998-04-09",
                        "watched": false
                    },
                    {
                        "episode_number": 18,
                        "name": "The Frogger",
                        "overview": "George buys an arcade game to preserve his high score; fear of a serial killer adversely affects Jerry's social life; Elaine eats Peterman's slice of wedding cake from the nuptials of the Duke and Duchess of Windsor.",
                        "air_date": "1998-04-23",
                        "watched": false
                    },
                    {
                        "episode_number": 19,
                        "name": "The Maid",
                        "overview": "Elaine's area code is changed; a co-worker steals George's desired nickname; Jerry sleeps with his maid; Kramer endures a \"long-distance relationship\" when his girlfriend moves downtown.",
                        "air_date": "1998-04-30",
                        "watched": false
                    },
                    {
                        "episode_number": 20,
                        "name": "The Puerto Rican Day",
                        "overview": "Gridlocked by a parade, Jerry verbally spars with another driver; George goes to a movie; and Kramer looks for a bathroom. Elaine, meanwhile, searches for a crossing point with a group of strangers.",
                        "air_date": "1998-05-07",
                        "watched": false
                    },
                    {
                        "episode_number": 21,
                        "name": "The Chronicle (1)",
                        "overview": "Part 1 of a two-part retrospective on the series' nine seasons.",
                        "air_date": "1998-05-14",
                        "watched": false
                    },
                    {
                        "episode_number": 22,
                        "name": "The Chronicle (2)",
                        "overview": "A two-part retrospective on the series' nine seasons concludes.",
                        "air_date": "1998-05-14",
                        "watched": false
                    },
                    {
                        "episode_number": 23,
                        "name": "The Finale (1)",
                        "overview": "The gang plans a trip to Paris to celebrate after NBC picks up Jerry and George's sitcom. But there's an in-flight emergency, stranding them in a small town.",
                        "air_date": "1998-05-14",
                        "watched": false
                    },
                    {
                        "episode_number": 24,
                        "name": "The Finale (2)",
                        "overview": "Witnesses testify to the gang's (lack of) character as they go on trial for violating a \"Good Samaritan Law.\"",
                        "air_date": "1998-05-14",
                        "watched": false
                    }
                ]
            }
        ]
    }
]